[
    {
        "Title":"Grilled Watermelon Salad With Lime Mango Dressing and Cornbread Croutons",
        "Ingredients":"['½ cup coarsely chopped ripe mango', '¼ cup fresh lime juice', '¼ cup dry sake', '2 tablespoons champagne vinegar', '1 teaspoon minced seeded bird’s-eye chile', '½ teaspoon kosher salt', '¼ cup canola oil', '3 pounds seedless watermelon, peel left on, cut into 1-inch-thick slabs', 'Olive oil', 'Kosher salt', '½ cup hulled pumpkin seeds', '¼ teaspoon ground cayenne', '1 teaspoon sugar', '4 cups 1-inch cubes homemade or store-bought cornbread', '2 tablespoons unsalted butter, melted', '8 fresh shiso leaves, shredded (or Thai basil or mint)', '½ cup dates, pitted and chopped', '1 serrano chile, sliced into rings', 'Freshly ground black pepper', '½ cup ricotta or mascarpone']",
        "Instructions":"Put all of the ingredients except the oil in a blender. Blend on high. After the ingredients are blended, slowly add the oil and continue to blend until the mixture is thickened and emulsified. (Makes 1 cup.)\nHeat a grill pan to medium-high heat. Drizzle the watermelon slices with just enough oil to thinly coat and place them on the hot grill.\nGrill each side of the watermelon slices for about 2 minutes, until charred. Transfer to a plate and season with salt.\nRemove the rind and dice the grilled watermelon into large cubes.\nPreheat the oven to 350°F. Toss the pumpkin seeds with the cayenne, sugar, and 2 teaspoons oil and place on a small baking sheet. Roast for 6 to 10 minutes, until golden.\nBrush the cornbread cubes with the melted butter and place in a single layer on a baking sheet. Put in the oven along with the pumpkin seeds and bake for 10 minutes, turning halfway with a flexible spatula. Remove from the oven when the croutons are toasted and golden.\nToss the watermelon, shiso, dates, and chile in the bowl with ¼ cup Lime Mango Dressing (reserve remaining dressing for another use). Taste and adjust the seasoning with salt and pepper. Add the cornbread croutons and toss very gently to combine without breaking the croutons. Spoon the salad onto a large platter and garnish with the pumpkin seeds and cheese.",
        "Image_Name":"grilled-watermelon-salad-with-lime-mango-dressing-and-cornbread-croutons"
    },
    {
        "Title":"Cornbread Muffins With Whipped Sweet Corn",
        "Ingredients":"['3 tablespoons coconut oil, plus more for greasing', '6 pitted Medjool dates', 'Boiling water', '¾ cup medium-grind yellow cornmeal', '¾ cup flour', '2 tablespoons coconut palm sugar', '1 tablespoon baking powder', '½ teaspoon fine sea salt', '2 heaping tablespoons freshly ground golden flaxseeds', '1 cup unsweetened oat milk', '3 tablespoons vegan butter', '¼ cup finely diced white onion', '2 cups fresh corn kernels (from about 3 ears)', '2 teaspoons coconut palm sugar', '¼ teaspoon kosher salt, plus more as needed', '½ cup Cashew Cream', 'Fresh lemon juice', 'Freshly ground white pepper', 'Jalapeño Pepper Jelly, for serving']",
        "Instructions":"Make the muffins: Preheat the oven to 400°F. Generously coat nine wells of a standard muffin tin with coconut oil.\nPut the dates in a small heatproof bowl and cover with boiling water. Let soak for about 5 minutes. Drain the dates, reserving the soaking liquid, and transfer them to a food processor. Add 1 tablespoon of the reserved soaking liquid and process, scraping down the sides and adding more of the reserved soaking liquid if necessary, until mostly creamy but with a few chunks remaining.\nPlace the prepared muffin tin in the oven to heat for 5 minutes. Meanwhile, in a large bowl, sift together the cornmeal, flour, sugar, baking powder, and salt. Whisk until blended.\nPut the flaxseeds and 6 tablespoons water in a medium bowl and whisk until well blended. Whisk in the pureed dates and the coconut oil until smooth. Whisk in the oat milk until well combined. Add the oat milk mixture to the cornmeal mixture and stir until just combined.\nWhen the muffin tin is hot, remove it from the oven and immediately scrape the batter into the prepared muffin cups, distributing it evenly among them (they should be a little over three-quarters full).\nBake until the muffins are golden brown, 16 to 18 minutes. Let cool in the tin for about 10 minutes, then transfer to a wire rack to cool a bit more.\nMake the whipped sweet corn: While the muffins are cooling, in a large skillet, melt the butter over medium heat. Add the onion and sauté, stirring often, until soft, 3 to 5 minutes. Add the corn, sugar, and salt and cook, stirring often, until the corn is just tender, about 5 minutes.\nScrape the contents of the skillet into a food processor. Add the cashew cream and process until silky smooth, adding water as necessary to reach the desired consistency. Taste and season with lemon juice, salt, and white pepper. Transfer to a serving bowl. Serve the warm muffins slathered with whipped sweet corn and topped with pepper jelly.",
        "Image_Name":"cornbread-muffins-with-whipped-sweet-corn"
    },
    {
        "Title":"Flatbread With Avocado and Scallion Salsa",
        "Ingredients":"['1 ½ tsp. sugar', '1 (¼-oz.) envelope active dry yeast (about 2¼ tsp.)', '2½ cups (313 g) all-purpose flour', '½ cup whole-milk plain Greek yogurt', '2 Tbsp. extra-virgin olive oil', '2 tsp. kosher salt', '2 tsp. coriander seeds', '2 tsp. cumin seeds', '8 scallions', '4 Tbsp. plus 1 cup extra-virgin olive oil, divided, plus more for brushing', 'Kosher salt', '1 red or green chile (such as serrano or jalapeño), finely chopped', '1 cup finely chopped parsley', '1 lemon', '4 medium avocados, pits removed', 'Flaky sea salt (optional)', 'Special Equipment: A spice mill']",
        "Instructions":"Stir sugar into ¾ cup warm water in a large bowl. Sprinkle in yeast and let sit until foamy, about 10 minutes.\nAdd flour, yogurt, oil, and kosher salt to sugar mixture and mix until a shaggy dough forms (don’t worry about any dry or unincorporated bits). Cover bowl with a damp kitchen towel and let sit in a warm, dry spot until doubled in size, about 1 hour.\nWhile the dough is rising, toast coriander seeds and cumin seeds in a dry medium skillet over medium heat, shaking often, until fragrant and slightly darkened in color, about 3 minutes. Transfer to a spice mill. Let cool, then coarsely grind. Set spice mixture aside.\nPlace scallions and 1 Tbsp. oil in skillet, season with kosher salt, and cook, turning occasionally, until softened and deeply charred, about 4 minutes. Transfer to a cutting board; trim roots and discard. Finely chop scallions and place in a medium bowl. Add reserved spice mixture, chile, and parsley. Finely grate half of lemon zest into bowl, then cut lemon in half and squeeze in juice. Add 1 cup oil and stir well to combine. Season with kosher salt and let sit while you make the flatbreads.\nTurn out dough onto a lightly dusted surface and divide into 8 equal pieces. Form into balls and, working with 1 ball at a time, roll out into 6\" rounds about ¼\" thick.\nHeat 1 Tbsp. oil in a large skillet over medium-high. Working 1 at a time and adding remaining 2 Tbsp. oil as needed, cook flatbread until bubbles appear over the surface, about 1 minute. Flip and cook until cooked through, about 1 minute. Continue to cook, turning often, until browned in spots on both sides, about 1 minute longer. Transfer to a plate and wrap up in a clean kitchen towel to keep warm.\nTo serve, brush each flatbread with oil. Coarsely smash avocados onto flatbread and spoon salsa over. Sprinkle with sea salt if desired.",
        "Image_Name":"flatbread-with-avocado-and-scallion-salsa"
    },
    {
        "Title":"Fragrant Mixed Herb and Flatbread Salad (Domaaj)",
        "Ingredients":"['4-5 pieces Persian flatbread (or toasted tortillas or pitta bread)', '½ cup walnuts, roughly chopped', 'Scant cup feta, crumbled', 'I small bunch mint, roughly chopped', '1 small bunch basil, roughly chopped', '1 small bunch tarragon, roughly chopped', '3 tbsp. pomegranate seeds, to garnish', '2 tbsp. balsamic vinegar', '3 tbsp. extra-virgin olive oil', '¼ tsp. golpar (optional)', '½ tsp. sea salt', '½ tsp. black pepper']",
        "Instructions":"Using a pair of scissors, cut the flatbread into small jagged pieces and place them in a large bowl.\nToast the walnuts in a small pan over a medium heat for 2 minutes. Add them to the bowl, along with the crumbled cheese and chopped herbs.\nTo make the dressing, whisk the balsamic vinegar, olive oil and golpar (if you are using it) with the salt and pepper. Drizzle the dressing over the salad and then get your hands in there, giving the whole thing a good stir to evenly distribute it.\nLeave the salad for 10 minutes for the flavors to soak into the bread, then taste and adjust the seasoning. Garnish with a generous sprinkling of pomegranate seeds just before serving.",
        "Image_Name":"persian-fragrant-mixed-herb-and-flatbread-salad-domaaj"
    },
    {
        "Title":"Cornbread Stuffing With Sausage and Corn Nuts",
        "Ingredients":"['3 lb. cornbread, cut into ¾\" pieces (14–16 cups)', '1½ lb. breakfast sausage, casings removed if needed', '1 cup unsalted butter (2 sticks), plus more for pan', '2 medium onions, chopped', '4 celery stalks, chopped', 'Kosher salt', '3 garlic cloves, finely chopped', '2 Thai chiles or 1 jalapeño (with seeds), chopped', '¾ cup corn nuts, finely ground in a food processor, blender, or mortar and pestle (about ½ cup)', '¾ cup dry white wine', '1 Tbsp. finely chopped sage', '2 tsp. finely chopped thyme', '3 large eggs', 'Freshly ground black pepper', '3½ cups turkey stock or low-sodium chicken broth']",
        "Instructions":"Preheat oven to 325°F. Divide cornbread evenly between 2 large rimmed baking sheets and bake, tossing occasionally, until dried out and lightly browned around the edges, 40–50 minutes. Let cool at least 10 minutes. Increase oven temperature to 350°F.\nMeanwhile, cook sausage in a large skillet over medium-high heat, stirring and breaking up with a spoon, until lightly browned and cooked through, 6–8 minutes. Transfer to a plate.\nReduce heat to medium and melt butter in same skillet. Add onions and celery; season with salt. Cook, stirring occasionally, until softened but not browned, 8–10 minutes. Add garlic and chiles. Cook, stirring once, until very fragrant, about 1 minute. Add corn nuts and cook, stirring often, until very fragrant and vegetables are starting to brown around the edges, about 3 minutes. Add wine and cook, stirring occasionally, until almost completely evaporated, about 3 minutes. Add sage and thyme and toss to combine. Remove from heat.\nCombine cornbread, sausage, and vegetable mixture in a large bowl. Whisk eggs and stock in a medium bowl until very well combined. Pour over cornbread mixture and let sit, gently stirring every minute or so, until cornbread has absorbed all or virtually all of the liquid. Season with salt and pepper (about 1 Tbsp. Diamond Crystal or 1½ tsp. Morton kosher salt).\nLightly butter a 3-qt. or 13x9x2\" baking dish. Transfer stuffing to dish and tap dish lightly against counter to distribute and compact stuffing. Cover tightly with foil and bake until stuffing is very hot throughout and bubbles appear around sides, 40–45 minutes. Increase oven temperature to 425°F and remove foil. Continue to bake stuffing until top is lightly browned, 15–20 minutes longer.\nDo Ahead: Stuffing can be baked at 350°f 3 days ahead. Let cool, then chill. Reheat in a 350°F oven before increasing temperature to 425°F and removing foil.",
        "Image_Name":"cornbread-stuffing-with-sausage-and-corn-nuts"
    },
    {
        "Title":"Goat Butter Shortbread",
        "Ingredients":"['1 cup (8 ounces) cold goat butter, cubed', '½ cup granulated sugar', '¼ cup toasted wheat germ', '1 ¾ cups unbleached all-purpose flour', '¼ cup whole wheat flour', '½ teaspoon kosher salt', '½ teaspoon sea salt flakes']",
        "Instructions":"Put the butter and sugar into the bowl of a stand mixer and refrigerate until the butter is firm, approximately 30 minutes.\nMeanwhile, heat the oven to 350°F and spread the wheat germ onto a half sheet (13 by 18-inch) pan. Toast until slightly aromatic, approximately 3 minutes. Cool to room temperature.\nIn a bowl, whisk together the flours, salts, and toasted wheat germ. Remove the bowl from the refrigerator. Fit the mixer with the paddle attachment. Add the flour mixture to the butter and sugar and mix on low speed until the dough starts to resemble a coarse meal, 6 to 8 minutes. Increase the speed to medium and mix until the dough just starts to clump around the paddle or to the sides of the bowl, 2 to 3 minutes more. Remove the bowl from the stand mixer. With a plastic bench scraper, bring the dough completely together by hand.\nPlace the dough on a surface lightly dusted with flour. Roll the dough back and forth into a cylinder. Using your fingers, pat the dough into a rectangle. Put a sheet of parchment paper the same dimensions as a half sheet pan on the work surface and dust lightly with flour. Put the dough on top.\nUsing a rolling pin, begin rolling out the dough. If any cracks form in the dough, stop to push them together. To keep the dough from sticking to the parchment paper, dust the top lightly with flour, cover with another piece of parchment paper, and, sandwiching the dough between both sheets of parchment paper, flip the dough and paper over. Peel off the top layer of parchment paper and continue to roll. Roll the dough into a 10 by 12- or 14-inch rectangle approximately ¼ inch thick. If the surface is uneven, roll a pastry roller across the surface to even it out.\nEase the dough and parchment paper onto a half sheet pan. Cover with another piece of parchment paper and refrigerate until firm, at least 20 minutes. Heat the oven to 350°F. Line a couple of half sheet pans with parchment paper.\nLet the dough sit at room temperature for up to 10 minutes. Invert the dough onto a work surface and peel off the top sheet of parchment paper. Roll a dough docker over the dough or pierce it numerous times with a fork.\nUsing a 1 ¾ by 2 ½-inch (or comparable) cookie cutter, cut out the shortbread. Reroll the dough trimmings, chill, and cut out more cookies. If you don’t have a comparable cookie cutter, you can cut out the rectangles with a knife.\nEvenly space 12 to 16 shortbreads on the prepared pan. Place the pan in the oven, lower the temperature to 325°F, and bake for 10 minutes. Rotate the pan and bake until the cookies feel firm to the touch and are slightly brown around the edges, 6 to 8 minutes more. Let the cookies cool entirely on the sheet pan. Repeat with the remaining dough.\nThe cookies can be stored in an airtight container at room temperature for up to 1 week. Dough can be refrigerated for up to 1 week.",
        "Image_Name":"goat-butter-shortbread"
    },
    {
        "Title":"Sumac and Vanilla Shortbread",
        "Ingredients":"['240g (8 ½ oz) butter, at room temperature', \"120g (4 1⁄4 oz\/1 cup) confectioners' sugar\", '360g (12 ¾ oz\/2 ¾ cups) all-purpose flour', '1 vanilla pod, seeds scraped out', '½ tsp flaky sea salt', '2 tbsp sumac', '2 tbsp granulated sugar']",
        "Instructions":"Use a food processor or an electric mixer with a paddle attachment to work the butter, icing sugar, flour, vanilla seeds and salt until the mixture just forms a ball of dough. It takes a while to come together, so don’t lose faith. Once it has formed, turn the dough out onto the work surface. Divide into two pieces and shape each one into a log – I prefer to make it rectangular but it is tasty in any shape.\nMix the sumac and sugar on the work surface. Roll the log in the sumac-sugar to coat all over, then place in the fridge to set for at least 1 hour (or freeze it until you want to bake them).\nHeat your oven to 190°C\/170°C fan\/375°F\/gas mark 5. Line two baking trays with baking paper. Use a sharp knife to cut each log into 12–14 slices and place them flat on the trays.\nBake for 10–12 minutes until light golden, then remove from the oven. Leave to cool on the tray before eating.",
        "Image_Name":"sumac-and-vanilla-shortbread"
    },
    {
        "Title":"Whole Grain Shortbread with Einkorn and Rye Flour",
        "Ingredients":"['1 cup, plus 2 Tbsp. unsalted butter, very soft', '1\/2 tsp. salt', '1 cup, plus 1 Tbsp. einkorn flour', '3\/4 cup, plus 1 Tbsp. rye Flour', '1\/3 cup rice flour', '5 Tbsp. cornstarch', '1\/3 cup granulated sugar', '1\/4 cup Superfine or granulated sugar, for topping']",
        "Instructions":"Preheat the oven to 325°F. Butter a 6 by 10 in. baking dish.\nPlace the butter in a mixing bowl. The butter must be very soft—the consistency of mayonnaise or whipped cream. Add the salt to the butter and mix well. Sift the flours and cornstarch together into another bowl. Add the granulated sugar to the butter and mix just until combined. Add the flour mixture and mix just until a smooth dough forms.\nPat the dough evenly into the prepared baking dish. The dough should be no more than 2\/3 in. deep. Bake until the top and bottom are lightly browned, about 30 minutes. The middle of the shortbread should remain light. Let cool on a wire rack until warm to the touch.\nSprinkle the shortbread with the superfine sugar. Tilt the dish so that the sugar fully and evenly coats the surface and then tip out the excess sugar. With a very thin, sharp knife, cut the shortbread into rectangular fingers about 1\/2 in. wide and 2 in. long. If the cookies have become cold they will not slice well, so they must still be warm to the touch at this point. Chill thoroughly before removing from the baking dish.\nThe first cookie is difficult to remove, but the rest should come out easily with the aid of a small, thin offset spatula. The cookies will keep in an airtight container in a cool place for up to 2 weeks.\nSkip sprinkling the shortbread with sugar. Temper 8 oz. milk, dark, or white chocolate. Dip half of the cookie in the melted chocolate, letting excess chocolate drip back into the bowl, and let set. Alternatively, you can use melted, untempered chocolate, but refrigerate the cookies after dipping to set the chocolate.",
        "Image_Name":"whole-grain-shortbread-with-einkorn-and-rye-flour"
    },
    {
        "Title":"Parsnip and Butternut Squash with Flatbreads",
        "Ingredients":"['10 1\/2 oz. butternut squash, peeled and cut into rough 3\/4-inch cubes', '18 oz. parsnips, cut into rough 3\/4-inch cubes', '3 Tbsp. extra-virgin olive oil, plus extra for drizzling', '1 tsp. fennel seeds, ground', '1 tsp. cumin seeds, ground', '1 tsp. freshly ground black pepper', '3 1\/2 oz. sprouted lentils (store-bought or sprouted at home)', '3 1\/2 oz. arugula', '2 oz. full-fat Greek yogurt, to serve (optional)', '5 1\/2 oz. spelt flour, plus extra for dusting', '1\/3 cup tepid water', '1 Tbsp. olive oil', 'Generous pinch of salt and pepper', '1\/4 tsp. ground coriander']",
        "Instructions":"Preheat the oven to 400°F.\nPut the cubed butternut squash and parsnips in a baking tray, drizzle with the oil, and scatter the spices on top, tossing to thoroughly coat the vegetables in the spiced oil. Bake in the oven for 35 minutes, tossing them once halfway through and adding the sprouted lentils after 15 minutes, until the vegetables are golden.\nIn the meantime, make the flatbreads. Mix the flour with the water, oil, and spices in a bowl. Knead until the dough comes together and is smooth and not sticky, adding more water if necessary, then separate the dough into 4 small balls.\nDust the work surface with flour, and roll out the balls of dough using a floured rolling pin (or wine bottle) until you have breads about 8 inches in diameter.\nHeat a large, dry frying pan over high heat, then cook each flatbread for 1–2 minutes on each side until lightly browned.\nWhen the vegetables are cooked, remove the tray from the oven, and fold the arugula into the root vegetables. This will gently wilt the leaves. Build your flatbreads, drizzling with a little olive oil or yogurt on top if you like.",
        "Image_Name":"parsnip-and-butternut-squash-with-flatbreads"
    },
    {
        "Title":"Skillet Cornbread With Bacon Fat and Brown Sugar",
        "Ingredients":"['2 ½ cups fine white stone-ground cornmeal', '1 tablespoon baking powder', '1 ½ teaspoons salt', '3 large eggs', '1 ¾ cups buttermilk', '2 tablespoons packed brown sugar', '3 tablespoons rendered bacon fat or lard']",
        "Instructions":"Preheat the oven to 425°F.\nWhisk the cornmeal, baking powder, and salt in a large bowl. Whisk the eggs, buttermilk, and brown sugar in another bowl until smooth.\nWhisk the wet ingredients into the dry ingredients.\nHeat the bacon fat in a 12-inch cast-iron skillet until liquid. Swirl it around to coat the bottom and sides of the skillet, then pour the rest into the batter.\nWhisk the batter until smooth, then pour into the hot skillet. Immediately transfer to the oven.\nBake until golden brown and a toothpick inserted in the center comes out clean, about 25 minutes. Serve warm.",
        "Image_Name":"skillet-cornbread-with-bacon-fat-and-brown-sugar"
    },
    {
        "Title":"Loaded Halloumi Flatbreads",
        "Ingredients":"['250g (9oz) halloumi, cut into 12 fingers', '4 large flatbreads or wraps', '125g (4 1\/2 oz) hummus', '1 tbsp harissa', '1\/2 small red cabbage, shredded', '2 carrots, coarsely grated', '1 small red onion, grated', '4 medjool dates, stoned (pitted) and chopped', '400g (14oz) can chickpeas (garbanzo beans), rinsed and drained', 'A handful of cilantro, chopped', 'Juice of 1 orange', '2 tbsp olive oil', '1 red chile, diced', '1 tsp grated fresh root ginger', '1 tsp cumin seeds', '1 tsp black mustard seeds', '200g (7oz \/ 3\/4 cup) Greek yogurt', 'Sea salt and freshly ground black pepper']",
        "Instructions":"Make the crunchy salad: mix all the ingredients together in a bowl.\nMake the dressing: heat the oil in a small frying pan (skillet) over a low heat. Add the chile and ginger and cook for 2 minutes, then stir in the seeds. Cook for 1–2 minutes until fragrant. Put the yogurt in a clean bowl and stir in the chile, ginger and seed mixture. Season to taste. Gently toss the salad in the dressing.\nDry-fry the halloumi in a non-stick frying pan (skillet) over a medium heat for 2–3 minutes each side until golden brown and crispy on the outside and softened inside. Remove and drain on kitchen paper (paper towels).\nWarm the flatbreads on a griddle pan or in a low oven and spread them with the hummus. Top with the halloumi and crunchy salad, and dot with harissa. Serve immediately.",
        "Image_Name":"loaded-halloumi-flatbreads"
    },
    {
        "Title":"Chickpea Flatbreads with Burst Tomato Sauce",
        "Ingredients":"['1 cup chickpea flour', '10 Tbsp. extra-virgin olive oil, divided, plus more for serving', '1 1\/2 tsp. kosher salt, divided', '2 pints cherry tomatoes, halved if large', '2 garlic cloves, finely chopped', '1 (15-oz.) can chickpeas, drained, rinsed', '1 Tbsp. dried oregano', '1 tsp. sherry or red wine vinegar', '1\/4 tsp. smoked paprika (optional)', '2 Tbsp. cold unsalted butter, cut into pieces', '1 cup coarsely crumbled feta (about 5 oz.)', 'Baby greens, such as arugula, kale, or spinach, and lemon wedges (for serving)']",
        "Instructions":"Place a rack in top third of oven; preheat to 450°F. Whisk chickpea flour, 2 Tbsp. oil, 1 tsp. salt, and 1 cup water in a medium bowl or large measuring cup until combined. Let sit at least 10 minutes and up to 1 hour to let flour hydrate.\nHeat 2 Tbsp. oil in a 12\" cast-iron skillet over high until shimmering. Pour in exactly half (3\/4 cup) of the chickpea batter and tilt to evenly coat skillet. Transfer to oven and bake flatbread until edges are golden brown, 8–10 minutes. Using a large spatula, transfer flatbread to a wire rack. Repeat with remaining batter.\nMeanwhile, cook tomatoes, garlic, 1\/4 cup oil, and remaining 1\/2 tsp. salt in a large skillet over medium-high heat, stirring occasionally, until tomatoes begin to burst, 4–5 minutes. Stir in chickpeas, oregano, vinegar, and paprika (if using). Reduce heat to medium and continue to cook, stirring often, until tomatoes have burst more into a fully formed sauce, 3–4 minutes. Remove from heat and stir in butter.\nSlice flatbreads in half. Serve with tomato-chickpea mixture, feta, greens, and lemon wedges alongside for squeezing and oil for drizzling.",
        "Image_Name":"chickpea-flatbreads-with-burst-tomato-sauce"
    },
    {
        "Title":"Zebra-Striped Shortbread Cookies",
        "Ingredients":"['2 1\/3 cups all-purpose flour, divided', '1 1\/2 tsp. kosher salt, divided', '1\/3 cup Dutch-process cocoa powder', '1 1\/4 cups (2 1\/2 sticks) unsalted butter, room temperature', '2\/3 cup granulated sugar', '1\/4 cup powdered sugar', '1 large egg yolk', '1 tsp. vanilla extract or paste', '1 large egg, beaten to blend', '1\/4 cup sanding sugar (any color)']",
        "Instructions":"Whisk 1 1\/3 cups flour and 3\/4 tsp. salt in a medium bowl. Whisk cocoa powder, remaining 1 cup flour, and remaining 3\/4 tsp. salt in another medium bowl. These are the bases for your chocolate and vanilla doughs.\nBeat butter, granulated sugar, and powdered sugar in the bowl of a stand mixer on medium-high speed until light and fluffy, about 4 minutes. Add egg and vanilla and beat until smooth. Divide mixture between the 2 bowls of dry ingredients (about 1 cup in each). Scrape vanilla mixture back into stand mixer bowl (save the mixing bowl) and beat on low speed just until combined. Return to reserved bowl. Repeat process with chocolate mixture.\nArrange 2 large sheets of parchment paper on a work surface. Dollop one-quarter of chocolate dough in the center of each sheet and pat into rough 6x2\" rectangles. Dollop one-quarter of vanilla dough on top of each chocolate slab and pat into rectangles the same size and shape so that you have 2 layers each. Repeat entire process so you have 4 alternating layers. Tightly press stacked dough into cylinders about 1 1\/2\" wide and 8\" long, using the parchment to help you. Wrap logs in plastic wrap and chill until very firm, at least 2 hours.\nPlace racks in upper and lower thirds of oven; preheat to 350°F. Working one at a time, unwrap dough and brush with egg. Carefully sprinkle surface with sanding sugar and roll logs in sugar to coat well (really press dough into sugar so it sticks). Slice into rounds a generous 1\/4\" thick, rotating after every few cuts to keep slices round. Arrange cookies on parchment-lined baking sheets, spacing 2\" apart. Bake, rotating baking sheets top to bottom and front to back halfway through, until edges are just set, 12–14 minutes. Let cool on baking sheets.\nDough can be made 3 days ahead; keep chilled. Cookies can be baked 5 days ahead; store airtight at room temperature.",
        "Image_Name":"zebra-striped-shortbread-cookies"
    },
    {
        "Title":"Chocolate Shortbread Slice",
        "Ingredients":"['1\/3 cup (80ml) single (pouring\/light) cream', '400g dark chocolate, chopped', '100g unsalted butter, chopped', '175g store-bought plain shortbread biscuits\/cookies', 'Cocoa powder, for dusting']",
        "Instructions":"Line an 8cm x 20cm loaf tin with non-stick baking paper. Place the cream, chocolate and butter in a medium saucepan over low heat and stir until melted and smooth. Pour one-third of the chocolate mixture into the tin. Arrange half the shortbread in the tin. Pour half the remaining chocolate mixture over the shortbread. Repeat with the remaining shortbread and chocolate and smooth the top. Refrigerate for 3–4 hours or until set. Remove the slice from the tin and dust with cocoa. Slice, using a hot knife, to serve.",
        "Image_Name":"chocolate-shortbread-slice-bars"
    },
    {
        "Title":"Pistachio-Rose Shortbread Squares",
        "Ingredients":"['2 1\/4 cups all-purpose flour', '1\/4 tsp. baking powder', '1 tsp. kosher salt', '1 1\/2 cups powdered sugar', '1 cup (2 sticks) unsalted butter, softened', '1 large egg', '2 Tbsp. rose rooibos tea or other rooibos tea, crushed', '1 tsp. finely grated lemon zest', '1\/2 tsp. vanilla extract', '1\/2 cup raw pistachios, chopped', '1\/4 cup freeze-dried raspberries', '1\/4 cup pink or red sanding sugar']",
        "Instructions":"Whisk flour, baking powder, and salt in a medium bowl.\nUsing an electric mixer on medium-high speed, beat powdered sugar and butter in a large bowl until aerated and pale, about 3 minutes. (Alternatively, use a stand mixer fitted with the paddle attachment.) Scrape down sides of bowl, then beat 2 minutes more. Reduce mixer speed to medium, add egg, and beat until well incorporated. Add tea, lemon zest, and vanilla and beat, scraping down sides of bowl, until combined, about 30 seconds more.\nReduce mixer speed to low and beat in dry ingredients, followed by pistachios. Stir dough a few times with a spatula, making sure to get to bottom of bowl.\nTurn out dough onto a clean work surface and divide into quarters. Working one quarter at a time, place dough on a sheet of parchment paper and pat with your hands into a log, then pull the parchment up around the log and, using the parchment to help contain the dough, press it firmly against your work surface, rotating and squaring off edges until you have a long 1\"-thick rectangle. Wrap parchment-wrapped dough tightly in plastic wrap and chill at least 3 hours.\nPlace racks in upper and lower thirds of oven; preheat to 325°F. Line 2 rimmed baking sheets with parchment paper. Unwrap dough and let sit at room temperature 10–15 minutes.\nPulverize raspberries into a fine powder in a food processor or spice mill. Transfer to a plate and mix in sanding sugar.\nRoll dough in raspberry sugar, pressing with your hands to adhere. Using a thin, sharp knife, cut into 1\/3\"-thick slices, rotating rectangle a quarter turn after each slice to help maintain its shape. Arrange slices on prepared baking sheets, spacing 1\/2\" apart. Bake cookies, rotating pans top to bottom and front to back halfway through, until opaque and barely golden, 14–16 minutes. Transfer pans to wire racks and let cool.\nDough can be made 4 days ahead. Keep chilled. Cookies can be made 1 week ahead. Store in an airtight container at room",
        "Image_Name":"pistachio-rose-shortbread-squares"
    },
    {
        "Title":"Cornbread Stuffing with Sausage and Collard Greens",
        "Ingredients":"['Buttermilk Cornbread', '9 Tbsp. unsalted butter, divided, plus more for pan', '2 Tbsp. extra-virgin olive oil', '1 1\/2 lb. hot or sweet Italian sausage, casings removed', '1 large onion, finely chopped', '2 celery stalks, finely chopped', '6 garlic cloves, thinly sliced', '2 Tbsp. finely chopped rosemary', '1 Tbsp. kosher salt', '1\/2 tsp. crushed red pepper flakes', '2 bunches collard greens, stems and ribs removed, leaves torn or cut into 2\" pieces', '1 1\/2 cups heavy cream', '2 1\/2 cups low-sodium chicken broth, divided', '3 large eggs, beaten to blend']",
        "Instructions":"Place a rack in middle of oven; preheat oven to 300°F. Cut cornbread into 1\" cubes and divide between 2 large rimmed baking sheets. Toast, turning over halfway through, until outsides are dried out and some of the sides are golden brown, 45–55 minutes.\nIncrease oven temperature to 350°F. Lightly butter a 13x9\" baking dish. Heat oil in a large Dutch oven or other heavy pot over medium-high. Arrange sausage in a single layer in pot and cook, undisturbed, until browned underneath, about 4 minutes. Break up into bite-size pieces with a heatproof rubber spatula or wooden spoon and continue to cook, tossing occasionally, until just cooked through, about 3 minutes longer. Transfer sausage to a large bowl.\nReduce heat to medium-low and add 8 Tbsp. butter to same pot; swirl to melt and to coat bottom of pot. Add onion, celery, garlic, rosemary, salt, and red pepper flakes. Cook, stirring often, until vegetables are softened but not yet browned, about 5 minutes. Add collard greens and cook, tossing occasionally, until wilted, about 2 minutes. Add cream and 1 cup broth and bring mixture to a bare simmer. Cover pot and cook until greens are softened, 7–9 minutes.\nAdd vegetable mixture to bowl with sausage; mix in remaining 11\/2 cups broth, then eggs. Add cornbread and carefully toss once (don’t break up pieces). Let sit 5 minutes, then gently toss again. Let sit until almost all the liquid has been absorbed, about 5 minutes more. Transfer stuffing, still being gentle with it, to prepared baking dish. Dot surface with pieces of remaining 1 Tbsp. butter and cover with foil.\nBake stuffing until hot in the center when pierced with a paring knife, 20–25 minutes. Remove foil and continue to bake until surface is deep golden brown and there are some crispy bits of sausage and greens on top, 25–30 minutes more.\nCornbread croutons can be made 2 days ahead; store in an airtight container at room temperature. Stuffing can be assembled but not baked one day ahead; cover and chill. Bring to room temperature before baking.",
        "Image_Name":"cornbread-stuffing-with-sausage-and-collard-greens"
    },
    {
        "Title":"Buttermilk Cornbread",
        "Ingredients":"['Nonstick vegetable oil spray', '2 cups all-purpose flour', '2 cups medium-grind cornmeal', '1\/4 cup sugar', '1 Tbsp. baking powder', '2 1\/2 tsp. kosher salt', '3\/4 tsp. freshly ground black pepper', '4 large eggs', '2 cups buttermilk', '1\/2 cup (1 stick) unsalted butter, melted, slightly cooled']",
        "Instructions":"Preheat oven to 400°F. Lightly coat a 13x9\" baking dish with nonstick spray. Whisk flour, cornmeal, sugar, baking powder, salt, and pepper in a large bowl. Whisk eggs, buttermilk, and butter in a medium bowl. Make a well in the dry ingredients and pour in egg mixture; stir into dry ingredients with a wooden spoon until combined. Scrape batter into prepared pan and smooth top.\nBake cornbread, rotating dish halfway through, until a tester inserted into the center comes out clean, 20–25 minutes. Let cornbread cool slightly in dish, then cut crosswise into 4 large pieces. Transfer to a wire rack with a large spatula and let cool completely.\nCornbread can be baked 2 days ahead. Store tightly wrapped at room temperature.",
        "Image_Name":"buttermilk-cornbread"
    },
    {
        "Title":"Skillet Dressing with Cornbread and Biscuits",
        "Ingredients":"['1 1\/2 cups fine-grind white cornmeal', '1\/2 cup all-purpose flour', '1 Tbsp. sugar', '1 tsp. baking powder', '1 tsp. baking soda', '1 tsp. kosher salt', '1\/2 tsp. freshly ground black pepper', '1 large egg', '2 cups buttermilk', '1\/4 cup grapeseed, vegetable, or other neutral oil', '2 Tbsp. unsalted butter', '2 Tbsp. unsalted butter, plus more for pan', '1 large onion, finely chopped', '3 large celery stalks, finely chopped', '2 1\/4 tsp. kosher salt, divided', '4 biscuits (about 12 oz. total), such as Fluffy Cathead Biscuits', '2 Tbsp. ground dried sage', '1 tsp. freshly ground black pepper', '3 large eggs', '3 1\/2 cups turkey stock or low-sodium chicken or vegetable broth', '1\/4 cup apple cider vinegar']",
        "Instructions":"Place a large cast-iron skillet in oven; preheat to 425°F. Whisk cornmeal, flour, sugar, baking powder, baking soda, salt, and pepper in a large bowl to combine. Whisk egg, buttermilk, and oil in a medium bowl to combine. Create a well in dry ingredients. Pour buttermilk mixture into well and whisk until no dry spots remain.\nRemove cast-iron skillet from oven (be careful; pan will be very hot). Add butter to pan and swirl to coat. Pour batter into pan and spread evenly. Bake cornbread until edges are golden brown and top is golden, 20–25 minutes.\nImmediately turn cornbread out onto a wire rack so bottom stays crisp. Let cool slightly, then invert onto another wire rack and let cool completely.\nDo Ahead: Cornbread can be baked 5 days ahead. Store tightly wrapped at room temperature, or freeze up to 3 months.\nPreheat oven to 375°F. Butter a large cast-iron skillet; set aside. Melt remaining 2 Tbsp. butter in a large skillet over medium heat. Add onion, celery, and a pinch of salt and cook, stirring occasionally, until vegetables are softened and just starting to take on some color, about 10 minutes.\nMeanwhile, tear cornbread into roughly 1\" pieces and transfer to a large bowl. Tear biscuits into slightly smaller pieces and add to same bowl.\nScrape vegetable mixture into bowl with bread and add sage, pepper, and remaining 2 tsp. salt. Gently toss to combine. Whisk eggs, stock, and vinegar in a medium bowl to combine. Drizzle over cornbread mixture and gently toss again to incorporate. Spoon dressing into prepared pan and bake until set and browned and crisp across the top, 45–55 minutes.\nDo Ahead: Dressing can be baked 1 day ahead. Let cool, then cover with foil and chill. Reheat in a 350°F oven, covered, until warmed through, 25–30 minutes, before serving.",
        "Image_Name":"skillet-dressing-with-cornbread-and-biscuits"
    },
    {
        "Title":"Spicy Cornbread Stuffing with Chorizo and Sweet Potatoes",
        "Ingredients":"['3 lb. cornbread, cut into 1\" cubes (about 20 cups)', '2 lb. sweet potatoes, peeled, cut into 1\/2\" pieces (about 6 cups)', '2 Tbsp. kosher salt, divided, plus more', '3 Tbsp. extra-virgin olive oil, divided', '2 lb. fresh chorizo, torn into small pieces', '2 large onions, chopped', '2 celery stalks, chopped', '2 Fresno chiles or jalapeños, chopped (optional)', '6 garlic cloves, thinly sliced', '2 tsp. paprika', '3 tsp. freshly ground black pepper, divided', '2 bunches Tuscan kale, stemmed, torn into 2\" pieces (about 12 cups)', '1 cup hard cider or dry white wine', '1\/4 cup chopped sage', '6 large eggs, beaten to blend', '2 quarts homemade chicken stock or low-sodium chicken broth', '1\/4 cup apple cider vinegar', '3\/4 cup unsalted butter, melted, divided', 'A large roasting pan or large disposable aluminum roasting pan']",
        "Instructions":"Place racks in upper and lower thirds of oven; preheat to 350°F. Divide cornbread between 2 large rimmed baking sheets. Bake, tossing occasionally and rotating pans top to bottom halfway through, until beginning to brown in spots and dry out, 35–40 minutes. (Drying out the stuffing will help it absorb the eggs and stock without becoming mushy.) Let cool.\nMeanwhile, cook sweet potatoes in a large pot of boiling salted water until just beginning to soften but not fully cooked through, 7–9 minutes. Drain; transfer potatoes to a large bowl.\nHeat 2 Tbsp. oil in a large skillet over medium-high. Cook chorizo, breaking up with a wooden spoon, until lightly browned and slightly undercooked, about 5 minutes. Using a slotted spoon, transfer to bowl with sweet potatoes.\nHeat remaining 1 Tbsp. oil in same skillet over medium. Add onions, celery, chiles (if using), garlic, paprika, 1 Tbsp. salt, and 1 tsp. pepper and cook, stirring often, until vegetables are tender, about 15 minutes. Add kale in batches as it wilts, then cider and sage and cook, stirring occasionally, until liquid is almost completely evaporated, about 5 minutes. Transfer to sweet potato mixture and toss to combine.\nWhisk eggs, stock, and vinegar in a large bowl or pitcher; season with remaining 1 Tbsp. salt and 2 tsp. pepper.\nBrush large roasting pan with an even layer of melted butter. Spread one-third of cornbread pieces in pan. Top with half of sweet potato mixture and spread to evenly distribute. Drizzle one-third of egg mixture over. Repeat with another third of the cornbread, remaining sweet potato mixture, then another third of egg mixture. There will be a lot of liquid in the pan—don’t worry, it will become absorbed as the stuffing bakes. Top with remaining cornbread, then drizzle remaining egg mixture over. Brush top with remaining butter. Cover pan with foil and bake stuffing until heated through, about 45 minutes. Uncover and bake until surface is golden and crisp, 20–30 minutes longer.\nDo Ahead: Cornbread can be toasted 1 day ahead; store tightly wrapped at room temperature. Sweet potato, chorizo, and kale mixture can be cooked 1 day ahead; cover and chill.",
        "Image_Name":"spicy-cornbread-stuffing-with-chorizo-and-sweet-potatoes"
    },
    {
        "Title":"Flatbread Caprese",
        "Ingredients":"['2 cups all-purpose flour, plus more for kneading', '1\/2 teaspoon active dry yeast', '1 teaspoon sea salt, plus more as needed', '1\/4 teaspoon sugar', '1 cup warm water (105°F to 110°F)', 'Extra virgin olive oil', '4 ounces fresh mozzarella, cut into 1\/2-inch cubes', '1\/2 pint grape tomatoes, sliced into 1\/4-inch-thick rounds', 'Handful of fresh basil leaves']",
        "Instructions":"Combine the flour, yeast, salt, and sugar in a large bowl and whisk to blend. Stir in the water until it forms a rough dough.\nSprinkle some flour on a counter or cutting board. Turn the dough out onto the board and sprinkle a bit more flour on top. Knead until the dough becomes a smooth ball, 3 to 4 minutes, adding more flour as needed. Cover the dough with a clean kitchen towel and let it rest on the counter for 10 minutes.\nPreheat the oven to 425°F. Coat a baking sheet with cooking spray.\nRoll the dough into a 9x17-inch rectangle and transfer it to the prepared pan. Drizzle with a bit of olive oil and bake 18 to 20 minutes, until golden and crisp.\nMeanwhile, combine the mozzarella and tomatoes in a medium bowl. Slice the basil into ribbons and add them to the bowl, along with a drizzle of oil. Season with salt.\nTransfer the flatbread to a cutting board. Scatter the mozzarella mixture on top. Cut the flatbread lengthwise, then into triangles. Serve immediately.",
        "Image_Name":"flatbread-caprese-tomato-mozzarella-basil"
    },
    {
        "Title":"Classic Skillet Cornbread",
        "Ingredients":"['2 1\/2 cups coarse-grind cornmeal', '1 1\/4 teaspoons baking soda', '1 1\/4 teaspoons kosher salt', '1 large egg', '1 2\/3 cups buttermilk', '2 tablespoons bacon fat, lard, or unsalted butter', 'Hot Honey Butter (for serving)', 'A 10\"-diameter cast-iron skillet']",
        "Instructions":"Preheat oven to 375°F. Set dry skillet over low heat to heat while you make the batter. Whisk cornmeal, baking soda, and salt in a medium bowl. Make a well in the center and add egg and buttermilk, then whisk vigorously, starting in the center to incorporate egg and working your way out, until dry ingredients are incorporated and batter is smooth.\nIncrease heat to medium-high and add bacon fat to skillet. Swirl to coat bottom and sides of skillet. Whisk batter once more to reincorporate, then pour into skillet and smooth top (batter will sputter around edges).\nBake cornbread in oven until the edges are golden brown and the top is golden, cracked in places, and firm to the touch, 25–30 minutes. Let cool in pan at least 5 minutes before cutting into wedges. Serve with Hot Honey Butter.\nCornbread can be baked 8 hours ahead. Let cool; store tightly wrapped at room temperature.",
        "Image_Name":"classic-skillet-cornbread"
    },
    {
        "Title":"Gingerbread Brownies",
        "Ingredients":"['Nonstick vegetable oil spray', '2 1\/4 cups sugar', '1 1\/2 cups unsweetened cocoa powder', '1 teaspoon kosher salt', '1 cup (2 sticks) unsalted butter', '4 large eggs', '3 tablespoons molasses (not robust\/blackstrap)', '2 teaspoons vanilla extract', '1 cup all-purpose flour', '2 teaspoons ground cinnamon', '2 teaspoons ground ginger', '1 teaspoon baking powder', '1\/2 teaspoon ground cloves']",
        "Instructions":"Place a rack in center of oven; preheat to 350°F. Coat a 9x9\" baking pan with nonstick spray. Line pan with 2 overlapping layers of parchment, leaving a 2\" overhang on all sides. Coat parchment with nonstick spray.\nWhisk sugar, cocoa powder, and salt in a large bowl. Melt butter in a medium heatproof bowl in the microwave or in a medium pot over medium heat. Immediately add hot butter to sugar mixture and stir with a wooden spoon or rubber spatula until smooth. Add eggs one at a time, stirring vigorously with spoon or spatula after each addition, until batter is thick, shiny, and smooth. Stir in molasses and vanilla. Using a sifter or fine-mesh sieve, sift in flour, cinnamon, ginger, baking powder, and cloves. Stir until well incorporated, then beat vigorously for 40 strokes.\nTransfer batter to prepared pan; smooth top. Bake brownie until slightly puffed and top is firm to the touch, edges are set, center is moist but not uncooked, and a tester or paring knife inserted into the center comes out with moist crumbs (not runny batter) attached, 40–45 minutes.\nTransfer to a wire rack and let brownie cool completely in pan. Using parchment overhang, lift brownie out of pan and transfer to a cutting board. Cut into 16 squares.",
        "Image_Name":"gingerbread-brownies"
    },
    {
        "Title":"Blood Orange and Poppy Polenta Shortbread Cookies",
        "Ingredients":"['1 cup (2 sticks) unsalted butter, room temperature, plus more for pan', '2\/3 cup polenta (coarse cornmeal)', '1 teaspoon kosher salt', '1 1\/2 cups all-purpose flour, plus more for hands', '1\/2 cup granulated sugar', 'Finely grated zest of 1 lemon', 'Finely grated zest of 2 blood oranges', '2 teaspoons vanilla extract', '2 tablespoons poppy seeds, plus more for sprinkling', '1\/2 cup blood orange juice', '1 cup powdered sugar']",
        "Instructions":"Preheat oven to 350°F. Lightly butter an 8x8\" baking pan, preferably metal. Line with parchment paper, creating overhang on 2 sides. Lightly butter parchment. Whisk polenta, salt, and 1 1\/2 cups flour in a medium bowl to combine. Place granulated sugar and blood orange and lemon zests in a large bowl and rub together with your fingers until mixture is very fragrant and sugar starts to look a little moist, about 1 minute. Add 1 cup butter and beat with an electric mixer on medium speed until light and fluffy, about 3 minutes. Add vanilla and beat just to combine. Reduce speed to low and gradually add dry ingredients, mixing just until combined. Fold dough with a rubber spatula a few times to incorporate any dry bits in the bottom of the bowl. The dough will be wet and a bit sticky.\nUsing floured hands, gently press half of the dough into prepared pan in an even layer. Sprinkle 2 Tbsp. poppy seeds over dough; press gently to adhere. Scatter pieces of remaining dough over and press down into an even layer with floured hands. For a completely flat surface, use the bottom of a straight-sided measuring cup to smooth dough.\nBake shortbread until edges are golden brown and center is light golden, 25–30 minutes. Let cool in pan.\nMeanwhile, simmer blood orange juice in a small saucepan over medium heat, swirling often, until reduced to 2 Tbsp., 10–12 minutes. Pour into a small bowl and let cool.\nCarefully slide a small knife or offset spatula along sides of pan not lined with parchment paper, then use edges of paper to lift out shortbread onto a cutting board. Using a serrated knife, slice into quarters in one direction, then into eighths in the other direction (for larger bars, just cut in half first). Puzzle shortbread bars back into pan the same way they came out; set aside.\nAdd powdered sugar to bowl with reduced juice and whisk until smooth. The glaze should fall off the end of the whisk in a thick, glossy, smooth ribbon. If glaze is not pourable and gets stuck in the whisk, add in water a ½-teaspoonful at a time until you get the right consistency. Drizzle glaze over shortbread in pan and use an offset spatula to smooth all the way to the edges. Sprinkle with more poppy seeds and let shortbread sit until glaze is set, at least 1 hour.\nJust before serving, retrace cuts with a sharp knife and remove bars from pan.\nShortbread can be baked 3 days ahead. Once glaze is set, cover tightly and store at room temperature.",
        "Image_Name":"blood-orange-poppy-polenta-shortbread-cookies"
    },
    {
        "Title":"Soft Gingerbread Tiles with Rum Butter Glaze",
        "Ingredients":"['6 tbsp (85 g) unsalted butter, at room temperature', '1\/3 packed cup plus 2 tbsp (90 g) dark brown sugar', '1\/4 cup (100 g) blackstrap molasses', '1 large egg yolk', '1 3\/4 cups plus 2 tbsp (235 g) all-purpose flour, plus extra for pressing', '1 tbsp Dutch-processed cocoa powder', '1\/2 tsp baking soda', '1 tsp ground ginger', '1\/2 tsp ground cinnamon', '1\/8 tsp ground cloves', '1\/4 tsp salt', '1\/4 tsp freshly ground black pepper', \"2\/3 cup (80 g) confectioners' sugar\", '1\/8 tsp ground cinnamon', '1 tbsp (15 g) unsalted butter, melted and warm', '1 tbsp dark rum (or lemon juice)', '1 tsp warm water']",
        "Instructions":"Place the butter, sugar and molasses in the bowl of an electric mixer with the paddle attachment in place. Beat on medium speed until smooth and incorporated. Add the egg yolk and continue to beat until fully combined.\nSift the flour, cocoa powder, baking soda, ginger, cinnamon, cloves, salt and pepper into a bowl. Turn the speed of the mixer to low, and add the dry ingredients to the butter and molasses. Once the mix comes together, tip the dough onto a lightly floured work surface and knead gently. Roll out the dough so that it is about 1\/4 inch\/ 0.5 cm thick. If the dough is very soft, you will need to chill it.\nPreheat the oven to 375°F\/190°C. Line two baking sheets with parchment paper and set aside.\nDip the cookie stamps in a small bowl of flour, shake off any excess and then press them firmly into the dough, one at a time, to create a deep imprint. How far you need to press to get an imprint will depend on your stamp; the patterns on some are more deeply cut than others. Bear in mind that the cookies rise a little when cooked, so any soft imprints will disappear. Using a round cookie cutter that is slightly larger than the pattern, cut out the pieces of imprinted gingerbread. Transfer the cookies to the lined baking sheets, spaced about 3\/4 inch\/2 cm apart. Reroll the dough and continue to stamp and cut cookies until all the dough is used up.\nBake for 9–10 minutes, rotating the sheets halfway through, until firm to the touch. They will continue to firm up as they cool, so don’t be tempted to bake them for any longer.\nTo make the rum butter glaze while the gingerbreads are in the oven, as the glaze needs to be brushed onto the cookies while they are still warm, sift the confectioners’ sugar and cinnamon into a small bowl. Add the melted butter, rum (or lemon juice) and water and mix with a spoon until smooth. The glaze will thicken slightly if it sits around, so stir through a little more warm water if you need to—it should be the consistency of runny honey.\nRemove the cookies from the oven, leave them to cool for 5 minutes, then brush or dab the glaze all over with a pastry brush. Transfer to a wire rack to cool completely.\nOnce the dough is made, it can be covered in plastic wrap and kept in the fridge for up to 2 days before baking.\nThese will keep for up to 5 days in an airtight container. The glaze will discolor and crack a little, but this will not affect how they taste.",
        "Image_Name":"soft-gingerbread-tiles-with-rum-butter-glaze"
    },
    {
        "Title":"Jammy Eggs and Feta Flatbreads with Herbs",
        "Ingredients":"['4 large eggs', '1\/4 cup feta', '2 tablespoons fresh lemon juice', '2 tablespoons extra-virgin olive oil', 'Kosher salt, freshly ground pepper', 'Palmful of chopped tender herbs (such as tarragon and\/or chives)', '2 warm flatbreads or slices of toast']",
        "Instructions":"Carefully lower eggs into a small saucepan of gently boiling water; cook 7 minutes. Transfer to a bowl of ice water and let sit until cool enough to handle; drain. Peel eggs; tear into large pieces.\nCoarsely mash feta in a small bowl with lemon juice and oil; season with salt and pepper. Gently fold in eggs.\nSpoon egg mixture over flatbreads and top with herbs.",
        "Image_Name":"jammy-eggs-and-feta-flatbreads-with-herbs"
    },
    {
        "Title":"Our Favorite Thanksgiving Stuffing with Sausage and Cornbread",
        "Ingredients":"['1\/2 cup (1 stick) unsalted butter, plus more for pan', '1\/2 pound good-quality day-old crusty country-style or peasant bread, torn into 3\/4\" pieces (about 5 cups)', '1\/2 pound day-old cornbread, broken into 3\/4\" pieces (about 5 cups)', '1 pound breakfast sausage links, casings removed, or ground breakfast sausage mix, broken up into 1\/2\" pieces', '2 1\/2 cups chopped onions (about 1 medium plus 1 large onion)', '3 medium celery stalks, sliced', '2 large eggs', '2 1\/2 cups low-sodium chicken broth', '1\/2 cup chopped parsley', '2 tablespoons chopped sage', '1 tablespoon chopped thyme', '2 teaspoons chopped rosemary', '2 teaspoons kosher salt', '1 teaspoon freshly ground black pepper', 'A 13x9x2\" or other 3-quart baking dish']",
        "Instructions":"Preheat oven to 300°F. Butter baking dish; set aside. Arrange bread and cornbread in a single layer on a rimmed baking sheet. Bake, tossing occasionally, until completely dried out, 35–50 minutes. Let cool on baking sheet, then transfer to a very large bowl.\nMeanwhile, heat a large skillet over medium-high. Break sausage into 1\/2\" pieces and cook, stirring and breaking up into smaller (about 1\/4\") pieces with a wooden spoon or spatula, until browned, 8–10 minutes. Transfer to bowl with bread but do not stir.\nHeat remaining 1 stick butter in same skillet over medium-high. Cook onions and celery, stirring often and scraping browned bits off bottom of pan, until just beginning to brown, about 10 minutes. Add to bowl with bread mixture and let cool.\nWhisk eggs, broth, parsley, sage, thyme, rosemary, salt, and pepper in a medium bowl. Add to bread mixture and fold gently until thoroughly combined.\nIncrease oven temperature to 350°F. Transfer mixture to prepared dish, cover with foil, and bake stuffing until an instant-read thermometer inserted into the center registers 160°F, 40–45 minutes. Uncover and continue to bake until set and top is browned and crisped, 45–50 minutes more.\nStuffing can be assembled, but not baked, 1 day ahead. Cover and chill. When ready to bake, bring to room temperature and bake according to recipe. Stuffing can be baked 1 day ahead. Let cool completely, then cover with foil and chill. Keep covered and bake in a 350°F oven until warmed through, 25–30 minutes. Uncover and bake until top is crisped, 7–10 minutes more.",
        "Image_Name":"our-favorite-thanksgiving-stuffing-with-sausage-and-cornbread"
    },
    {
        "Title":"10-Minute Chicken Flatbreads with Hummus and Yogurt",
        "Ingredients":"['1 pound boneless, skinless chicken thighs or breasts, thinly sliced crosswise', '1 teaspoon ground cumin', '1 teaspoon kosher salt', '1\/2 teaspoon freshly ground black pepper', '1 tablespoon olive oil, plus more for serving', '3 mini seedless cucumbers, sliced into 1\/4\" coins (about 8 ounces)', '1 large tomato, cut into 1\/2\" cubes (about 12 ounces)', '1 (10-ounce) container hummus', '1 cup plain unsweetened yogurt (either Greek or regular)', '1\/4 cup parsley leaves (optional)', '4 pitas', 'Lemon wedges and flaky sea salt (for serving)']",
        "Instructions":"Toss chicken with cumin, kosher salt, and pepper in a medium bowl. Heat 1 Tbsp. oil in a large skillet over high. Add chicken mixture and cook, stirring occasionally, until lightly browned and cooked through, about 5 minutes. Transfer to a serving bowl.\nMeanwhile, heat broiler. Divide cucumbers and tomato among small serving bowls. Spoon hummus and yogurt into separate serving bowls. Broil pitas just until warmed, about 2 minutes.\nServe chicken, cucumbers, tomato, hummus, yogurt, and parsley, if using, with lemon wedges, sea salt, and more oil alongside so everyone can assemble their own flatbreads as desired.",
        "Image_Name":"10-minute-chicken-flatbreads-with-hummus-and-yogurt"
    },
    {
        "Title":"Gingerbread Cupcakes with Lemony Frosting",
        "Ingredients":"['1 1\/4 cups all-purpose flour', '1 teaspoon baking powder', '1\/2 teaspoon baking soda', '3 teaspoons ground ginger', '1 teaspoon ground cinnamon', '1\/4 teaspoon ground cloves', '1\/4 teaspoon salt', '1\/2 cup vegetable oil', '1\/3 cup light molasses', '1\/2 cup maple syrup', '1\/4 cup soy milk', '2 tablespoons soy yogurt', '1 1\/2 teaspoons finely grated lemon zest', '1\/4 cup finely chopped crystallized ginger', '1\/4 cup nonhydrogenated margarine, softened', '1\/4 vegan cream cheese, softened', '2 cups confectioners’ sugar', '1 teaspoon vanilla extract', '1 tablespoon of finely grated lemon zest']",
        "Instructions":"Preheat oven to 350°F. Line a muffin pan with paper cupcake liners.\nSift the flour, baking powder, baking soda, ginger, cinnamon, cloves, and salt into a bowl and mix.\nWhisk the oil, molasses, maple syrup, soy milk, yogurt, and lemon zest in a separate large bowl. Add the flour mixture to the wet ingredients and mix just until smooth. Fold in the chopped crystallized ginger.\nFill cupcake liners two-thirds full. Bake for 19 to 22 minutes, until a knife or toothpick inserted into the center comes out clean. Transfer to a cooling rack and let cool completely before frosting.\nCream together margarine and cream cheese until just combined. Use a handheld mixer to whip while adding the confectioners’ sugar in 1\/2 cup batches. Mix until smooth and creamy, then in mix in the vanilla. Add the lemon zest. Keep tightly covered and refrigerated until ready to use.",
        "Image_Name":"gingerbread-cupcakes-with-lemony-frosting"
    },
    {
        "Title":"Babee’s Strawberry Shortbread Valentine’s Cookies",
        "Ingredients":"['6 cups sifted all-purpose flour', '1 teaspoon baking powder', '2 cups unsalted butter', '2 cups sifted confectioners’ sugar', '2 large egg yolks', '1\/2 cup orange juice', '1 teaspoon pure vanilla extract', '6 cups strawberry preserves']",
        "Instructions":"Preheat the oven to 350°F. Sift together the flour and baking powder, and set aside.\nIn the bowl of a stand mixer or in a bowl with a handheld electric mixer, cream together the butter and sugar until light and fluffy, approximately 3 to 5 minutes.\nAdd the egg yolks, orange juice, and vanilla extract, and mix slowly.\nAdd the flour mixture to the butter mixture, and mix slowly until a dough forms.\nRemove the dough from the mixer, and knead with your hands until it’s stretchy. Place the dough between two sheets of parchment paper and, using a rolling pin, roll flat.\nRemove the top sheet of parchment paper and cut the dough in half. Punch out the “solid” bottom halves of the cookies on one half of the dough. Punch out the “heart window” top halves of the cookies on the other half of the dough.\nArrange cookies on a cookie sheet lined with parchment paper and bake for 8 to 10 minutes. Remove before browned, and let cool completely.\nCarefully spread strawberry preserves on the solid bottom halves of the cookies, and place the heart window part of each cookie on top. Serve and enjoy!",
        "Image_Name":"strawberry-shortbread-valentines-cookies"
    },
    {
        "Title":"Spinach-Artichoke Flatbread Pizzas",
        "Ingredients":"['1 cup balsamic vinegar', '6 Flatout Light Italian Herb flatbreads', '3\/4 cup Prego Light Homestyle Alfredo sauce', '6 cups baby spinach', '3 cups grape tomatoes, halved', '1 (15-ounce) can quartered artichoke hearts, drained and chopped', '3\/4 cup shredded reduced-fat mozzarella cheese (I like Sargento)']",
        "Instructions":"Preheat the oven to 350˚F. Line 2 baking sheets with foil.\nIn a small saucepan, bring the balsamic vinegar to a boil over medium heat. Reduce the heat to medium-low and simmer until the balsamic vinegar starts to thicken and has reduced by half, 20 to 25 minutes.\nMeanwhile, lay out the flatbreads on the prepared baking sheets and coat with cooking spray. Bake for 5 to 6 minutes. Remove from the oven but leave the oven on.\nSpread 2 tablespoons Alfredo sauce evenly onto each flatbread. Top each with 1 cup spinach, 1\/2 cup grape tomatoes, 1\/4 cup artichokes, and 2 tablespoons mozzarella.\nReturn to the oven and bake until the cheese is melted, 7 to 9 minutes. Remove from the oven and drizzle the balsamic reduction evenly over each pizza.",
        "Image_Name":"spinach-artichoke-flatbread-pizzas"
    },
    {
        "Title":"Grapefruit-Vanilla Shortbread",
        "Ingredients":"['1\/2 cup (1 stick) unsalted butter, room temperature, cut into pieces, plus more for pan', '1 tablespoon finely grated grapefruit zest', '1 teaspoon vanilla extract', '1\/3 cup plus 1 cup powdered sugar', '1 cup all-purpose flour', '1\/2 teaspoon kosher salt, plus more', '2 tablespoons fresh grapefruit juice', 'Himalayan pink salt, dried hibiscus flowers, red sprinkles or sanding sugar, dried rose petals, and\/or cracked pink peppercorns (for serving; optional)', 'A 9-inch springform pan']",
        "Instructions":"Lightly butter pan. Pulse grapefruit zest, vanilla extract, 1\/2 cup butter, and 1\/3 cup powdered sugar in a food processor until smooth and homogenous. Add flour and 1\/2 tsp. kosher salt; pulse just to combine. Press dough evenly into prepared pan, smoothing top with a flat-bottomed glass or measuring cup. Chill until firm, about 1 hour.\nPreheat oven to 350°F. Prick shortbread all over with a fork 1\"–2\" apart, and bake until edges are golden and center is pale but firm to the touch, 15–18 minutes.\nRemove band from pan and immediately cut shortbread into 16 wedges. Let cool.\nWhisk grapefruit juice, a pinch of kosher salt, and remaining 1 cup powdered sugar in a small bowl until smooth. Spread a thin layer of icing over shortbreads with a small offset spatula, leaving a thin border of crust exposed. Top as desired. Let sit 10–15 minutes to allow glaze to set. Retrace cut marks.\nDough can be pressed into pan 1 day ahead. Cover and chill.",
        "Image_Name":"grapefruit-vanilla-shortbread"
    },
    {
        "Title":"Grape and Rosemary Flatbread",
        "Ingredients":"['1 (16-ounce) homemade or store-bought pizza dough', '1 tablespoon truffle oil', '2 teaspoons fresh rosemary, chopped', '2\/3 cup red grapes, halved', '1\/2 teaspoon finishing salt', '2 tablespoons crumbled feta cheese']",
        "Instructions":"Preheat the oven to 500˚F. Line a baking sheet with parchment paper and lightly dust with flour.\nTake the pizza dough out of refrigerator 30 minutes before using. With a sharp knife, cut the dough in half. Stretch the dough into two long rectangles (about 6x11 inches each) on the parchment paper. Brush with truffle oil. Sprinkle with rosemary, grapes, salt, and feta. Bake for 8 to 10 minutes. Remove from the oven and cut into slices.",
        "Image_Name":"grape-and-rosemary-flatbread"
    },
    {
        "Title":"Skillet Cornbread With Chives",
        "Ingredients":"['2 cups coarse-grind cornmeal', '2 tablespoons sugar (optional)', '1 teaspoon kosher salt', '1\/2 teaspoon baking powder', '1\/2 teaspoon baking soda', '1 large egg', '1 1\/2 cups buttermilk', '1 tablespoon lard or vegetable oil', '1\/2 cup (1 stick) unsalted butter, room temperature', '2 tablespoons finely chopped chives', 'Flaky sea salt (for serving)', 'A 10-inch cast-iron skillet']",
        "Instructions":"Place a rack in middle of oven and set skillet on rack; preheat to 450°F.\nMeanwhile, whisk cornmeal, sugar (if using), kosher salt, baking powder, and baking soda in a large bowl to combine. Whisk egg and buttermilk in a medium bowl; add to dry ingredients and mix to incorporate.\nCarefully remove skillet from oven, add lard, and swirl in pan to coat. Scrape batter into skillet (it should sizzle around edges on contact). Bake cornbread until top is golden brown and center is firm, 15–20 minutes. Let cool 15 minutes before serving.\nSpread butter over cornbread, top with chives, and sprinkle with sea salt.",
        "Image_Name":"skillet-cornbread-with-chives"
    },
    {
        "Title":"Apple Gingerbread Cake With Cream",
        "Ingredients":"['3 tablespoons plus 1\/2 cup unsalted butter, plus more for pan', '1 cup (packed) light brown sugar, divided', '1 pound lady apples, unpeeled, very thinly sliced, seeds removed, divided', '2 cups all-purpose flour', '1 1\/2 teaspoons baking powder', '1 1\/2 teaspoons kosher salt', '1 1\/2 teaspoons ground cinnamon', '1\/2 teaspoon ground cloves', '1\/2 teaspoon ground nutmeg', '1\/2 cup robust-flavored (dark) molasses', '1\/2 cup pure maple syrup', '2 large eggs, room temperature', '2 tablespoons finely grated peeled ginger', '1 1\/2 teaspoons baking soda', '1\/2 cup heavy cream, plus more for serving', 'A 10-inch springform pan']",
        "Instructions":"Preheat oven to 350°F. Butter pan and line bottom with a parchment round; butter parchment. Heat 1 Tbsp. butter, 1\/2 cup brown sugar, and 2 Tbsp. water in a large skillet over medium, stirring constantly, until butter is melted and sugar is dissolved. Cook, without stirring but swirling skillet often, until large bubbles that are slow to pop form, about 2 minutes. Pour caramel into prepared pan and tilt pan to evenly coat bottom.\nMelt 1 Tbsp. butter in same skillet over medium heat; add half of apples and toss to separate. Cook, tossing often, until apples are softened and almost translucent, about 4 minutes. Repeat process with another 1 Tbsp. butter and remaining apples. Let apples sit until cool enough to handle, then arrange over caramel in several overlapping layers. Set pan aside.\nWhisk flour, baking powder, salt, cinnamon, cloves, and nutmeg in a large bowl to combine; set aside. Heat molasses, maple syrup, remaining 1\/2 cup brown sugar, and remaining 1\/2 cup butter in a heatproof bowl set over a saucepan of barely simmering water, stirring constantly, until butter is melted and mixture is smooth. Whisk in eggs and ginger. Stir baking soda into 1\/4 cup very hot water in a small bowl until dissolved, then whisk into molasses mixture. Whisk molasses mixture into reserved dry ingredients and scrape batter over apples, spreading evenly. Evenly drizzle 1\/2 cup cream over batter.\nPlace cake on a foil-lined rimmed baking sheet and bake until center is firm to the touch and a cake tester inserted into the center comes out clean, 35–45 minutes. Transfer pan to a wire rack and let cake cool in pan 15 minutes. Run a paring knife around the sides of cake to loosen, then remove the sides of pan and invert cake onto rack. Carefully remove pan and peel away parchment (apples might stick, so work slowly). Let cool completely.\nSlice cake into wedges and serve drizzled with more cream.\nCake can be baked 1 day ahead. Store tightly covered at room temperature. To revive apples, reheat cake slightly in a microwave and brush top with maple syrup.",
        "Image_Name":"apple-gingerbread-cake-with-cream"
    },
    {
        "Title":"Plantain Flatbread With Poached Egg and Honey Drizzle",
        "Ingredients":"['1 medium green\/slightly yellow plantain, peeled and cut up', '3 or 4 eggs', 'Sea salt', 'Freshly ground black pepper', 'Honey', 'Garnish: Thinly sliced chives']",
        "Instructions":"Preheat the oven to 375ºF. Grease a 9x9-inch baking pan with coconut oil.\nIn a high-speed blender, combine the plantain, 2 of the eggs, and a pinch of salt and blend until smooth.\nPour this mixture into the baking pan and bake for 25 to 30 minutes, until set and a toothpick inserted into the center comes out clean (or lift up the sides to check for doneness).\nPoach 1 or 2 eggs (depending on how many you are serving). Serve the plantain flatbread topped with the poached egg(s).\nSprinkle with salt and pepper to taste, and a drizzle of honey. Garnish as desired.",
        "Image_Name":"plantain-flatbread-with-poached-egg-and-honey-drizzle"
    },
    {
        "Title":"Iron-Skillet Cornbread",
        "Ingredients":"['1 1\/4 cups all-purpose flour', '1 cup fine-grind cornmeal', '1 tablespoon baking powder', '1 1\/2 teaspoons kosher salt', '4 large eggs', '1 1\/2 cups canned creamed corn (from one 15-ounce can)', '1 (4.5-ounce) can mild green chiles, drained, chopped', '1 1\/2 ounces mild white cheddar, grated (about 1\/2 cup)', '1 1\/2 ounces Monterey Jack, grated (about 1\/2 cup)', '3\/4 cup unsalted butter (1 1\/2 sticks), room temperature', '2\/3 cup sugar', 'Nonstick vegetable oil spray', 'A 10-inch cast-iron skillet (measured from the rim)']",
        "Instructions":"Place rack in middle of oven. Set skillet on a rimmed baking sheet, place on rack, and preheat oven to 400°F. Whisk flour, cornmeal, baking powder, and salt in a small bowl to combine. Lightly beat eggs in a medium bowl to blend; whisk in creamed corn, chiles, cheddar, and Monterey Jack.\nMix butter and sugar in a large bowl with a wooden spoon just until butter absorbs sugar but butter is still in small pieces. Add egg mixture and mix until just combined. Mix in dry ingredients until barely incorporated.\nRemove skillet from oven and lightly coat with nonstick spray. Scrape in batter (it should sizzle on contact and stay slightly mounded in the center). Bake cornbread until top is golden brown and springs back when gently pressed, 35–45 minutes. Let cool 10 minutes before serving.",
        "Image_Name":"hillstone-iron-skillet-cornbread"
    },
    {
        "Title":"Flatbread with Smoked Trout, Radishes, and Herbs",
        "Ingredients":"['3 cups plain whole-milk yogurt', 'Vegetable oil (for grill)', '1\/2 Garlic-Herb Naan or 1 pound store-bought pizza dough, room temperature, halved', '2 (5-ounce packages) smoked trout, coarsely flaked', '4 radishes, trimmed, thinly sliced on a mandoline', '1\/4 cup coarsely chopped dill', '2 tablespoons sliced chives', 'Flaky sea salt', 'Freshly ground black pepper', 'Lemon wedges (for serving)', 'Cheesecloth']",
        "Instructions":"Line a fine-mesh sieve with cheesecloth and set over a medium bowl. Place yogurt in sieve, cover with plastic wrap, and let drain in refrigerator at least 1 day and up to 2 days if you want it slightly thicker. Discard excess liquid. (Or skip this step entirely and use 1 1\/2 cups store-bought labneh instead.)\nPrepare a grill for medium-high, indirect heat (for a charcoal grill, bank coals on one side of grill; for a gas grill, leave one or two burners off); lightly oil grate. Working with 1 piece of dough at a time, gently stretch to about a 10x8\" oval. Grill over direct heat, turning and rotating as needed, until bread is stiff and both sides are lightly charred, about 3 minutes total. Move to indirect heat to keep warm while you grill remaining piece of dough.\nTransfer both flatbreads to a work surface and spread drained yogurt over. Top with trout, radishes, dill, and chives. Sprinkle with salt and pepper and serve with lemon wedges for squeezing over.\nYogurt can be drained 1 week ahead. Cover and chill.",
        "Image_Name":"flatbread-with-smoked-trout-radishes-and-herbs"
    },
    {
        "Title":"3-Ingredient Brown-Butter Shortbread",
        "Ingredients":"['1 cup (2 sticks) unsalted butter', '1\/2 cup powdered sugar', '2 cups all-purpose flour, sifted', '1\/4 teaspoon kosher salt']",
        "Instructions":"Preheat oven to 300°F. Melt butter in a small skillet over medium heat and cook, stirring often, until milk solids begin to brown, about 6 minutes (do not burn). Strain through a fine-mesh sieve into a medium bowl. Chill until just firm, about 30 minutes.\nUsing an electric mixer on medium-high speed, beat brown butter and powdered sugar in a large bowl until pale and creamy, about 2 minutes. Reduce speed to low and gradually beat in flour and salt, scraping down sides of bowl as needed, just to blend (do not overwork dough).\nTransfer dough to a sheet of parchment. Form dough into a rectangle. Place second sheet of parchment over dough. Roll out dough to a 8x6\" rectangle about 1\/2\" thick.\nRemove top sheet of parchment. Transfer dough on parchment to a rimmed baking sheet. Using a fork, pierce dough all over, spacing 1\" apart. Bake shortbread, rotating halfway through, until golden brown and firm to the touch, 55–65 minutes.\nCut shortbread lengthwise into 1\" strips on baking sheet while still warm. Cut each strip crosswise into thirds. Let cool completely.\nCookies can be made 2 days ahead; cover and store at room temperature.",
        "Image_Name":"3-ingredient-brown-butter-shortbread"
    },
    {
        "Title":"3-Ingredient Flaky Flatbread",
        "Ingredients":"['2 cups plus 1 tablespoon all-purpose flour', '1 teaspoon kosher salt', '1\/2 teaspoon baking powder', 'Olive oil (for greasing)', '1 cup (2 sticks) unsalted butter, softened, divided']",
        "Instructions":"Whisk flour, salt, and baking powder in a large bowl. Make a well in the center and slowly add 2\/3 cup water, mixing with your hands or a wooden spoon, until a shaggy dough forms. Knead dough in bowl until smooth and elastic, about 4 minutes. Transfer dough to a clean work surface. Wipe out bowl and grease lightly with oil. Return dough to bowl, cover with a kitchen towel, and let rest 30 minutes.\nTurn out dough onto a clean work surface. Using a bench scraper or large knife, cut into 6 equal pieces. Shape into balls, cover, and let rest 15 minutes more.\nGrease a large cookie sheet or the underside of a rimmed baking sheet with 1 Tbsp. butter. Line another rimmed baking sheet with parchment.\nPlace 1 piece of dough on prepared cookie sheet. Pat down to a flat oval with your fingertips, then smear 2 Tbsp. butter over dough. Press and slide dough outward with your fingertips, stretching to a very thin oval, about 12x10\".\nStarting at 1 long end, roll dough over itself to create a long tube about 1\" wide; flatten slightly. Starting at 1 short end, roll into a coil like a jelly roll. Transfer to parchment-lined sheet; cover with a kitchen towel. Repeat with remaining dough. Freeze, covered, 15 minutes.\nWorking one at a time, turn coil on its side and flatten to a disc with your palm. Using a rolling pin, roll into a rough oval about 8x4\". Transfer to freezer. Repeat with remaining coils and freeze until ready to use.\nHeat 1 Tbsp. butter in a griddle or large nonstick skillet over medium-high. Add 2 pieces of dough, reduce heat to medium, and cook flatbread until bottom is golden brown with large bubbles forming underneath, about 3 minutes. Flip and continue to cook until second side is golden brown, about 1 minute more. Repeat with remaining dough, adding 1 Tbsp. butter before each batch.",
        "Image_Name":"3-ingredient-flaky-flatbread"
    },
    {
        "Title":"Flatbread with Fava Beans, Cucumbers, and Burrata",
        "Ingredients":"['2 cups shelled fava beans (from about 2 pounds pods)', 'Kosher salt', '2 tablespoons fresh lemon juice', '2 tablespoons olive oil, plus more for grill', 'Freshly ground black pepper', '2 Persian cucumbers, thinly sliced', '2 tablespoons unseasoned rice vinegar', '1\/2 Garlic-Herb Naan or 1 pound store-bought pizza dough, room temperature, halved', '2 (8-ounce) balls burrata or fresh mozzarella, drained', 'Basil leaves (for serving)', '1 teaspoon toasted sesame seeds', 'Flaky sea salt']",
        "Instructions":"Cook fava beans in a medium saucepan of boiling salted water until tender, about 4 minutes. Using a mesh sieve, transfer to a colander set in a bowl of ice water. Drain and peel. Combine lemon juice, 2 Tbsp. oil, and half of fava beans in a medium bowl and lightly mash with a fork. Stir in remaining fava beans; season with kosher salt and pepper.\nCombine cucumbers and vinegar in a medium bowl; season with kosher salt. Let sit until slightly softened, 10–12 minutes.\nPrepare a grill for medium-high, indirect heat (for a charcoal grill, bank coals on one side of grill; for a gas grill, leave one or two burners off); lightly oil grate. Working with 1 piece of dough at a time, gently stretch to about a 10x8\" oval. Grill over direct heat, turning and rotating as needed, until bread is stiff and both sides are lightly charred, about 3 minutes total. Move to indirect heat to keep warm while you grill the remaining piece of dough.\nTransfer flatbreads to a work surface. Tear burrata into pieces and divide between flatbreads; top with fava bean mixture, cucumbers, and basil. Sprinkle with sesame seeds, sea salt, and pepper.\nFava beans can be cooked 3 days ahead. Cover and chill.",
        "Image_Name":"flatbread-with-fava-beans-cucumbers-and-burrata"
    },
    {
        "Title":"Cornbread-Stuffed Roasted Squash",
        "Ingredients":"['4 cups (311 g) finely cubed Cornbread', '1\/2 cup (20 g) unsweetened dried cranberries', '2 tablespoons (18 g) dried currants', '2 acorn squash (1 pound \/454 g each)', '1\/2 medium white onion', '2 celery stalks', '1 large carrot', '2 teaspoons olive oil', '1 tablespoon chopped fresh sage leaves', '1 garlic clove, peeled', '1\/2 cup (120 ml) low-sodium vegetable broth', '2 tablespoons (14 g) chopped toasted pecans', '1 tablespoon fresh flat-leaf parsley leaves', '1\/2 teaspoon sea salt', '1\/4 teaspoon ground black pepper']",
        "Instructions":"1. Preheat the oven to 400°F (200°C).\n2. Spread the cornbread cubes over a rimmed baking sheet and bake for 30 minutes, stirring halfway through, until golden brown and toasted. Set aside to cool on a wire rack. Leave the oven on but reduce the temperature to 350°F (180°C). Line a baking sheet with foil or a silicone baking mat.\n3. Meanwhile, combine the cranberries and currants with 1 cup boiling water in a heatproof bowl and let sit for 30 minutes to rehydrate. Drain well.\n4. Halve each squash. Discard the seeds and membranes and place cut side down on the baking sheet. Roast for 30 minutes, or until the squash is just tender. Leave the oven on.\n5. Meanwhile, wet-chop the vegetables: Fill the Vitamix container with water up to the 5-cup (1.2-L) mark, add the onion, and secure the lid. Select Variable 8. Use the On\/Off switch to quickly pulse 3 times. Drain well and repeat the process with the celery (3 pulses) and carrot (4 pulses), draining thoroughly in a colander.\n6. Heat the olive oil in a large skillet over medium-high heat. Add the onion, celery, carrot, sage, and garlic and cook until the vegetables are softened and the onion is translucent, 3 to 5 minutes. Remove from the heat.\n7. Mix together the toasted cornbread, cranberry-currant mixture, sautéed vegetables, broth, pecans, parsley, salt, and pepper in a large bowl.\n8. Divide the stuffing among the squash halves. Place the squash in a large serving\/baking dish, stuffing side up, and bake for 30 minutes, or until the squash is tender and the stuffing is golden brown.",
        "Image_Name":"cornbread-stuffed-roasted-squash"
    },
    {
        "Title":"Artichoke, Spinach, and Prosciutto Flatbreads with Spicy Honey",
        "Ingredients":"['3 tablespoons olive oil', '4 garlic cloves, thinly sliced', '2 tablespoons finely chopped flat-leaf parsley', '1 (10-ounce) package frozen spinach, thawed', '1 (9-ounce) package frozen artichoke hearts, thawed', 'Kosher salt, freshly ground black pepper', '2 tablespoons finely grated lemon zest', 'Cornmeal (for pans)', '1 pound frozen pizza dough, thawed', 'All-purpose flour (for surface)', '1\/2 pound Parmesan cheese, grated on the large holes of a box grater (about 2 cups), divided', '3 tablespoons honey', '1 1\/2 teaspoons red pepper flakes', '2 ounces thinly sliced prosciutto']",
        "Instructions":"Position racks in middle and upper third of oven and preheat to 475ºF.\nHeat oil in large heavy skillet over medium. Add garlic and parsley and cook, stirring, 30 seconds. Add spinach and artichokes, toss to coat, and cook, covered, until artichokes are tender, 10–12 minutes. Uncover and simmer, stirring occasionally, until juices thicken, about 2 minutes. Season with 1\/2 tsp. salt and a pinch of black pepper. Remove from heat and stir in lemon zest.\nSprinkle 2 rimless baking sheets with cornmeal. Roll out half of the dough on floured surface to a 12x7\" oval. Transfer to baking sheet. Repeat with remaining dough.\nSprinkle each round with 1\/2 cup Parmesan, then top evenly with artichoke and spinach mixture. Top with remaining 1 cup Parmesan and season with a pinch of salt and black pepper. Bake, rotating sheets halfway through, until crust is golden brown, 20–22 minutes.\nMeanwhile, combine honey and red pepper flakes in a small bowl.\nRemove flatbreads from oven. Top with prosciutto and drizzle with spicy honey. Cut flatbreads into wedges and serve.",
        "Image_Name":"artichoke-spinach-and-prosciutto-flatbreads-with-spicy-honey"
    },
    {
        "Title":"Corn and Jalapeño Chili Flatbread",
        "Ingredients":"['1 (14-ounce) can creamed corn', '4 1\/2 ounces grated haloumi', '4 1\/2 ounces grated mozzarella', '1 tablespoon chopped pickled jalapeño peppers', '1 tablespoon finely grated lime zest', 'Sea salt and cracked black pepper', 'Cracked black pepper', '4–6 small pita breads, halved', 'Extra-virgin olive oil, for brushing']",
        "Instructions":"Preheat a grill pan or grill over high heat. Place the creamed corn, haloumi, mozzarella, jalapeños, lime zest, salt and pepper in a bowl and mix to combine. Spoon the mixture into the pita halves and press to fill to the edges. Brush the pitas with the oil and grill for 2–3 minutes on each side or until lightly charred and the cheese has melted. Cut into wedges to serve.",
        "Image_Name":"corn-and-jalapeno-chili-flatbread-56390076"
    },
    {
        "Title":"Falafel-Spiced Tomatoes and Chickpeas on Flatbread",
        "Ingredients":"['2 garlic cloves, finely chopped', '1 teaspoon sumac', '1\/2 teaspoon crushed red pepper flakes', '1\/2 teaspoon ground coriander', '1\/2 teaspoon ground cumin', '1 teaspoon kosher salt, plus more', '2 large heirloom tomatoes, any color, thinly sliced', '1 (15.5–ounce) can chickpeas, rinsed', '2 tablespoons red wine vinegar', 'Freshly ground black pepper', '1 small shallot, thinly sliced', '1\/2 cup parsley leaves with tender stems', '3 tablespoons olive oil', '1 Persian cucumber, peeled, chopped', '3\/4 cup plain yogurt', '1\/2 cup coarsely chopped fresh mint', '1\/2 cup coarsely chopped fresh parsley', 'Kosher salt, freshly ground pepper', 'Flatbread and assembly', '2 teaspoons kosher salt', '3\/4 teaspoon baking powder', '1\/2 teaspoon sugar', '2 cups all-purpose flour, plus more for surface', '1 cup plain yogurt', '4 tablespoons olive oil, plus more for drizzling', 'Freshly ground black pepper', 'Sumac, a tart, citrusy spice, can be found at Middle Eastern markets and specialty foods stores.']",
        "Instructions":"Combine garlic, sumac, red pepper flakes, coriander, cumin, and 1 teaspoon salt in a small bowl. Arrange tomato slices in a single layer on a rimmed baking sheet and sprinkle garlic mixture evenly over top. Let sit at room temperature at least 30 minutes and up to 1 hour.\nToss chickpeas and vinegar in a medium bowl; season with salt and pepper. Mash chickpeas with a fork until about half are smashed. Add shallot, parsley, and oil and toss to combine; season with salt and pepper. Set aside.\nCombine cucumber, yogurt, mint, and parsley in a medium bowl; season with hot sauce, salt, and pepper. Let sit at room temperature at least 15 minutes.\nYogurt sauce can be made 1 hour ahead. Cover and chill.\nWhisk salt, baking powder, sugar, and 2 cups flour in a large bowl. Add yogurt and stir to combine (the yogurt's acidity ensures a tender texture). Transfer dough to a lightly floured work surface and knead until mostly smooth, about 1 minute. Divide into 4 pieces, cover with plastic wrap, and let rest 15 minutes (this will make dough easier to roll).\nWorking one at a time, roll out each piece of dough into a round about 1\/8\" thick. (Don't stress: They don't need to be perfect.) Heat 1 tablespoon oil in a large skillet, preferably cast iron, over medium.\nWorking one at a time, cook rounds of dough until underside is golden brown and flatbread is beginning to puff, about 2 minutes. Flip and cook until other side is golden brown, about 1 minute longer; transfer to a plate. Repeat with remaining oil and rounds of dough. Let cool slightly.\nTop each flatbread with yogurt sauce, chickpea mixture, and tomatoes. Drizzle with more oil and season well with salt and pepper.",
        "Image_Name":"falafel-spiced-tomatoes-and-chickpeas-on-flatbread-56389870"
    },
    {
        "Title":"Red Wine–Marinated Hanger Steaks with Flatbreads",
        "Ingredients":"['1\/2 lemon, thinly sliced', '3 sprigs thyme', '2 Fresno chiles, halved', '6 garlic cloves, smashed', '3\/4 cup dry red wine', '1\/4 cup olive oil', '1\/2 teaspoon freshly ground black pepper', '1 1\/2 pounds hanger steak, center membrane removed, cut into 4 pieces', 'Vegetable oil (for grill)', '1 shallot, finely chopped', '3 garlic cloves, chopped', '1 Fresno chile, chopped', '6 tablespoons unsalted butter', 'Kosher salt, freshly ground pepper', '1 pound prepared pizza dough, room temperature, cut into 4 pieces', '2 tablespoons chopped fresh parsley steak']",
        "Instructions":"Combine lemon, thyme, chiles, garlic, wine, oil, and pepper in a large resealable plastic bag. Add steak, close bag, and turn to coat. Chill at least 4 hours.\nSteak can be marinated 2 days ahead. Keep chilled.\nPrepare campfire for medium-high heat. Bank coals on one side to create a two-zone fire; oil grate. (If cooking at home with a gas grill, leave one or two burners off.) Cook shallot, garlic, chile, and butter in a small saucepan over medium heat until shallots are softened; season with salt and pepper. Keep warm.\nRemove steak from marinade; season with salt. Grill over direct heat, turning occasionally, until cooked to desired doneness, 8–10 minutes for mediumrare. Transfer to a cutting board; let rest 10 minutes. Slice against the grain.\nMeanwhile, working one at a time, gently stretch each piece of dough into an oval (about 12x8\") and grill over direct heat, flipping and rotating as needed, until lightly charred and stiff, about 1 minute per side. Move to cooler part of grill to keep warm until ready to serve.\nSpoon shallot butter over flatbreads and top with parsley. Serve with steak.",
        "Image_Name":"red-wine-marinated-hanger-steaks-with-flatbreads-56389762"
    },
    {
        "Title":"Smoked Salmon Breakfast Salad with Crispbread",
        "Ingredients":"['2 baby beets or radishes, thinly sliced', '8 thin slices red onion (optional)', '6 cups mesclun', '2 tablespoons fresh lemon juice', '2 tablespoons olive oil', '1 tablespoon chopped capers', 'Kosher salt, freshly ground pepper', '0 freshly ground pepper', '3 ounces smoked salmon or gravlax', '3\/4 cup Neufchâtel or cream cheese', '4 Wasa crispbread or toasted pumpernickel slices', '1 lemon, cut into wedges']",
        "Instructions":"Toss beets, onion (if using), mesclun, lemon juice, oil, and capers in a large bowl; season with salt and pepper. Add salmon and gently toss to combine. Mound salad alongside crispbread spread with Neufchâtel and serve with lemon wedges for squeezing over.",
        "Image_Name":"#NAME?"
    },
    {
        "Title":"Lavender Shortbread with Fruits, Flowers, and Herbs",
        "Ingredients":"['3 large egg whites', '4 cups powdered sugar', '1\/2 teaspoons cream of tartar', '1\/3 cup rice flour', '1 1\/2 teaspoons kosher salt', '2 1\/2 cups all-purpose flour', '1 cup plus 6 tbsp unsalted butter, cut into pieces, room temperatur', '3\/4 cup granulated sugar', '1 teaspoon coarsely ground dried lavender', 'Freeze-dried and\/or dried fruits, dried edible flowers, fresh and\/or dried herbs (for decorating)', 'One 3 1\/8\"-diameter and one 1 1\/4\"-diameter fluted cutter']",
        "Instructions":"Using a wooden spoon or rubber spatula, stir egg whites, powdered sugar, and cream of tartar in a medium bowl until a thick paste forms with no dry spots. Ideally, glaze should sit at least 12 hours for sugar to fully hydrate, but it can be used as soon as cookies have cooled. Or, you can cover and chill up to 1 week. Bring to room temperature before using.\nWhisk rice flour, salt, and 2 1\/2 cups all-purpose flour in a medium bowl. Using an electric mixer on medium-high, beat butter, sugar, and lavender in a medium bowl until very pale and fluffy, about 5 minutes. Mix in dry ingredients on low until fully combined. Wrap in plastic and chill at least 2 hours and up to 2 days. Preheat oven to 350°. Roll out dough between 2 sheets of lightly floured parchment to 1\/8\" thick. Using large cutter, cut out 16 rounds, rerolling scraps. Using small cutter, punch out centers. Bake on parchment-lined baking sheets until edges are golden, 12-14 minutes. Let cool on a wire rack.\nWorking quickly, dip tops of cookies into glaze, letting excess drip off. Transfer to wire rack and decorate.",
        "Image_Name":"lavender-shortbread-with-fruits-flowers-and-herbs-51259280"
    },
    {
        "Title":"Black SesameBrown Sugar Shortbread",
        "Ingredients":"['1 cup (2 sticks) unsalted butter, room temperature', '1\/2 cup (packed) light brown sugar', '2 1\/4 cups all-purpose flour', '2 tbsp cornstarch', '1\/2 tsp salt', '2 tbsp plus 2 tsp black sesame seeds']",
        "Instructions":"Preheat oven to 325° with racks in center and upper third. Line 2 baking sheets with parchment paper.\nBeat butter and sugar until light and fluffy.\nWhisk together flour, cornstarch, salt, and sesame seeds. Add flour mixture to butter mixture, 1 cup at a time, beating after each addition until incorporated. Transfer mixture to a surface and knead into a smooth dough. Wrap in plastic and refrigerate for 20 minutes.\nTransfer chilled dough to a lightly floured surface; roll into a 1\/2\"-thick rectangle. Cut into 2\" squares, then cut each square into triangles. Transfer to prepared baking sheets.\nBake until edges are light golden brown, 20-22 minutes. Let cool.",
        "Image_Name":"black-sesame-brown-sugar-shortbread-51256860"
    },
    {
        "Title":"Cornbread, Chorizo, Cherry, and Pecan Stuffing",
        "Ingredients":"['3\/4 cup (1 1\/2 sticks) unsalted butter, cut into pieces, divided, plus more', '1\/4 cup white wine vinegar', '1\/2 cup dried tart cherries', '10 cups coarsely crumbled cornbread, preferably homemade, dried out overnight', '1\/3 cup coarsely chopped pecans', '1\/4 cup olive oil', '1 pound fresh chorizo, casings removed', '2 medium onions, chopped', '4 celery stalks, chopped', 'Kosher salt, freshly ground pepper', '2 garlic cloves, finely chopped', '2 tablespoons finely chopped fresh sage', '2 large eggs', '3 cups chicken stock or low-sodium chicken broth, divided', '1\/4 cup finely chopped fresh parsley']",
        "Instructions":"Preheat oven to 400°. Butter a shallow 3-quart baking dish and a sheet of foil. Bring vinegar and 2 tablespoons water to a boil in a small saucepan; remove from heat and add cherries. Let sit until cherries are plump, 15-20 minutes.\nMeanwhile, spread out cornbread on a rimmed baking sheet and toast until golden brown, 10–15 minutes. Let cool. Place in a very large bowl.\nDrain cherries, reserving soaking liquid, and add cherries to bowl with cornbread (do not mix).\nReduce oven temperature to 350°. Toast pecans on a clean rimmed baking sheet, tossing once, until fragrant and slightly darkened, 8–10 minutes. Let cool; add to bowl.\nMeanwhile, heat oil in a large skillet over medium-high. Cook chorizo, stirring occasionally and breaking into small pieces with a spoon, until browned and cooked through, 8–10 minutes. Transfer to bowl with a slotted spoon.\nAdd onions and celery to skillet, season with salt and pepper, and cook, stirring often, until onions are golden brown and soft, 10–12 minutes. Add garlic and sage; cook, stirring, until fragrant, about 2 minutes. Transfer to bowl.\nReduce heat to medium and cook reserved cherry soaking liquid in skillet, scraping up any browned bits, until almost all evaporated, about 1 minute. Add 1\/2 cup butter; cook, stirring, until melted. Drizzle over bread mixture.\nWhisk eggs and 2 cups stock in a medium bowl; pour over cornbread mixture. Add parsley, season with salt and pepper, and gently toss, adding more stock 1\/4-cupful at a time as needed (you may not use it all), until combined and cornbread is hydrated. Mix carefully to avoid breaking cornbread into crumbs. Transfer to prepared dish and dot with remaining 1\/4 cup butter.\nCover with buttered foil; bake until a paring knife inserted into the center comes out hot, 30–35 minutes. Increase oven temperature to 450°. Uncover and bake until top is golden brown and crisp, 20–25 minutes. Let sit 10 minutes before serving.\nDo ahead: Stuffing can be assembled 1 day ahead. Cover and chill.",
        "Image_Name":"cornbread-chorizo-cherry-and-pecan-stuffing-51255140"
    },
    {
        "Title":"Dutch Oven Cornbread with Fig Jam",
        "Ingredients":"['3\/4 cup (1 1\/2 sticks) unsalted butter', '1 1\/2 cups all-purpose flour', '1 1\/2 cups cornmeal', '1\/4 cup sugar', '2 teaspoon baking soda', '2 teaspoon kosher salt', '1\/2 teaspoon baking powder', '3 large eggs', '1 cup whole milk', '3\/4 cup fig jam']",
        "Instructions":"Preheat oven to 425°. Place butter in a 10\"-12\"-diameter Dutch oven, cover, and place in oven to heat pot and melt butter, 6-8 minutes (don't let butter burn). Swirl butter to coat bottom and partway up sides of pan; pour butter into a small bowl and set aside.\nMeanwhile, whisk flour, cornmeal, sugar, baking soda, salt, and baking powder in a large bowl. Whisk eggs and milk in a medium bowl; add to cornmeal mixture along with reserved melted butter and whisk to combine. Scrape batter into hot Dutch oven.\nCover and bake until cornbread has started to set around edges, 10-12 minutes. Dot surface with jam. Cover and bake until a tester inserted into the center comes out clean, 15-20 minutes longer. Let cool, uncovered, 15 minutes. To serve, cut cornbread into wedges.",
        "Image_Name":"dutch-oven-cornbread-with-fig-jam-51238440"
    },
    {
        "Title":"Gingerbread",
        "Ingredients":"['2 cups all-purpose flour', '1 1\/2 teaspoons ground ginger', '1 teaspoon baking soda', '1\/2 teaspoon cinnamon', 'Scant 1\/2 teaspoon salt', '1 stick unsalted butter, softened', '3\/4 cup packed dark brown sugar', '1 large egg', '1\/2 cup mild molasses (not robust or blackstrap)', '3\/4 cup well-shaken buttermilk', '1\/2 cup hot water', 'lightly sweetened whipped cream']",
        "Instructions":"Preheat oven to 350°F with rack in middle. Butter a 9-inch square baking pan.\nWhisk together flour, ginger, baking soda, cinnamon, and salt in a bowl. Beat butter and sugar with an electric mixer at medium speed until pale and fluffy. Beat in egg until blended, then beat in molasses and buttermilk. Mix in flour mixture on low speed until smooth, then add hot water and beat 1 minute (batter may look curdled.)\nSpread batter evenly in pan and bake until a wooded pick inserted into center comes out clean, 40 to 45 minutes. Cool in pan on a rack.",
        "Image_Name":"gingerbread-51210010"
    },
    {
        "Title":"Gingerbread Cookie Sandwiches",
        "Ingredients":"['3 1\/2 cups all-purpose flour', '1 1\/2 teaspoons baking soda', '1\/4 teaspoon kosher salt', '1 1\/2 teaspoons ground ginger', '1 teaspoon ground cinnamon', '1\/4 teaspoon ground cloves', '1\/4 teaspoon ground allspice', '1 cup unsalted butter, at room temperature', '1 cup (firmly packed) dark brown sugar', '1\/2 cup granulated sugar', '1 large egg', '1\/4 cup molasses', '1\/3 cup unsalted butter, at room temperature', '1\/2 teaspoon pure vanilla extract', '1\/8 teaspoon kosher salt', \"1 1\/2 cups confectioners' sugar\", '1 tablespoon milk, plus more as needed']",
        "Instructions":"1. In a large bowl, combine the flour, baking soda, salt, and spices; set aside. In the bowl of a stand mixer, beat the butter and sugars together until they appear light and fluffy. Add the egg and mix to combine. Add the molasses and mix to combine, scraping down the sides of the bowl once if needed.\n2. Working in three batches, add the dry ingredients, mixing between each addition until just incorporated. Remove the dough and turn it out onto a sheet of plastic wrap; form into a disk, wrap tightly and refrigerate until firm, at least 2 hours. (Dough can be made up to 1 day ahead.)\n3. Preheat the oven to 350°F. Remove the dough and cut it in half. Re-wrap one half and place back in the fridge; let the other sit at room temperature a few minutes to soften slightly. Lightly flour a work surface and your rolling pin, and roll out the dough to 1\/4-inch thick.\n4. Line a baking sheet with parchment paper. Using cookie cutters, cut out the gingerbread men, and transfer to the prepared sheets. (If the dough feels very soft, refrigerate the gingerbread men on the baking sheet for 15 minutes before placing in the oven to bake.) Bake until cookies appear firm and like they're just starting to crisp, 12 to 15 minutes. Remove and let cool on the sheet 5 minutes, then transfer to racks to cool completely.\n5. Meanwhile, make the sandwich filling. Beat together the butter, vanilla, and salt until fluffy. Add the confectioners' sugar in 2 batches and beat on low speed until incorporated. Add the milk and beat until the mixture is thick but spreadable, adding more milk in 1 teaspoon increments as needed. Spread some of the icing onto half of the cooled gingerbread men; sandwich each with another cookie.",
        "Image_Name":"gingerbread-cookie-sandwiches-51205820"
    },
    {
        "Title":"Rosemary and Toasted-Caraway Shortbread",
        "Ingredients":"['1 teaspoon caraway seeds', '1 cup (2 sticks) chilled unsalted butter, cut into 1\/2\" pieces', '1\/2 cup granulated sugar', '1\/4 cup powdered sugar', '1\/2 teaspoons kosher salt', '2 1\/2 cups all-purpose flour', '2 teaspoons finely chopped fresh rosemary, plus whole leaves', '1 large egg, beaten to blend', 'Coarse sanding sugar (for sprinkling)']",
        "Instructions":"Preheat oven to 350°F. Toast caraway seeds in a small dry skillet over medium-high heat, tossing occasionally, until fragrant, about 2 minutes. Coarsely chop; set aside.\nUsing an electric mixer on medium-high speed, beat butter, granulated sugar, powdered sugar, and salt until very light and fluffy, 7–10 minutes (beating air into butter makes for tender shortbread). Reduce speed to low and add flour, caraway, and 2 teaspoons chopped rosemary; mix just to combine. Dough will look shaggy and a little dry (it's not!).\nPress dough into two 8\"-diameter cake pans. Brush with egg, sprinkle with sanding sugar, and top with rosemary leaves.\nBake until shortbread is golden brown and sides pull away from pan, 20–25 minutes. Transfer pan to a wire rack; let cool in pan before turning out and cutting into wedges or bars.\nMAKE AHEAD: Shortbread dough can be made 1 month ahead; wrap tightly and freeze. Shortbread can be baked 1 week ahead; store wrapped tightly at room temperature.",
        "Image_Name":"rosemary-and-toasted-caraway-shortbread-51205390"
    },
    {
        "Title":"Cornbread with Caramelized Apples and Onions",
        "Ingredients":"['3\/4 cup plus 2 tablespoons unsalted butter', '1 medium onion, thinly sliced', '1 teaspoon kosher salt plus more', 'Freshly ground black pepper', '2 medium red- or pink-skinned apples (such as Pink Lady), thinly sliced', '5 tablespoons sugar, divided', '3 teaspoons fresh thyme leaves, divided', '1 1\/2 cups cornmeal', '1 cup all-purpose flour', '1 tablespoon baking powder', '2 large eggs', '1 1\/2 cups buttermilk']",
        "Instructions":"Preheat oven to 400°F. Melt butter in an 8\" cast-iron skillet over medium-high heat. Pour all but 2 tablespoons butter into a small bowl; set aside.\nAdd onion to butter in skillet; season with salt and pepper, and cook, stirring occasionally, until onion is softened and beginning to brown, about 4 minutes. Add apples, 2 tablespoons sugar, and 2 teaspoons thyme and cook, stirring often, until apples are softened, about 4 minutes. Transfer onion mixture to a medium bowl and reserve skillet.\nWhisk cornmeal, flour, baking powder, 1 teaspoon salt, and remaining 3 tablespoonss sugar in a large bowl. Gradually whisk in eggs, buttermilk, and 3\/4 cup reserved melted butter until smooth (no lumps should remain). Fold in half of onion mixture and scrape batter into reserved skillet. Top with remaining onion mixture and remaining 1 teaspoon thyme.\nBake cornbread until golden brown and a tester inserted into the center comes out clean, 30–40 minutes. Let cool slightly before serving.\nDO AHEAD: Cornbread can be made 6 hours ahead. Reheat before serving, if desired.",
        "Image_Name":"cornbread-with-caramelized-apples-and-onions-51198760"
    },
    {
        "Title":"Chocolate Shortbread Cookies",
        "Ingredients":"['1 1\/2 C flour', '1\/2 C unsweetened cocoa*', '1\/4 tsp coarse salt', '1\/2 pound (2 sticks) unsalted butter, room temperature', '1\/2 C granulated sugar', '1 tablespoon cacao nibs*', '*Use a high quality chocolate such as Scharfen Berger.']",
        "Instructions":"In a small bowl, sift flour and cocoa together. Add coarse salt and set aside.\nWith an electric mixer beat butter on medium speed for 3 to 5 minutes until fluffy. Add sugar and cacao nibs and continue to beat until very light in color, about 2 minutes more. Add the flour and cocoa mixture and combine on low speed, until flour is just incorporated and dough sticks together when squeezed with fingers.\nOn a sheet of wax paper, pat and form the dough into a log about 12 to 14 inches long and 1 to 1 1\/2 inches in diameter. If you want a square or rectangular cookie rather than round, flatten each side of the log as you roll it up in the wax paper. Chill until firm, at least 1 hour.\nPreheat oven to 325 degrees.\nLine a cookie sheet with parchment. Remove the wax paper from the dough and slice the log into 1\/4 inch thick slices. Lay cookies on lined baking sheets. Bake until firm, 17 to 20 minutes. Cool completely on wire racks. Can be stored in an airtight container for 3 to 4 weeks.",
        "Image_Name":"chocolate-shortbread-cookies-51192010"
    },
    {
        "Title":"Rose Water Shortbread Cookies",
        "Ingredients":"['1\/2 teaspoon ground cardamom', '1 1\/2 cups white rice flour plus more for rolling', '3\/4 cup powdered sugar', '1\/2 cup (1 stick) unsalted butter, room temperature', '1 large egg', '1 teaspoon rose water', '1 teaspoon poppy seeds', 'ingredient info: Rice flour is available at natural foods stores, and rose water at Middle Eastern markets. Both can be found at specialty foods stores and some supermarkets.']",
        "Instructions":"Whisk cardamom and 1 1\/2 cups flour in a medium bowl and set aside. Using an electric mixer, beat sugar and butter in a medium bowl until smooth. Add egg and rose water and beat to blend.\nReduce mixer to low speed; gradually mix in dry ingredients (dough will be stiff). Cover and chill at least 6 hours or overnight.\nPreheat oven to 300°. Scoop level tablespoonfuls of dough and, using lightly floured hands, roll into balls. Place on parchment-lined baking sheets, spacing about 1 1\/2\" apart. Using a fork or another utensil that can make a decorative pattern in dough, flatten balls to a 1\/4\" thickness. (Alternatively, flatten balls and make an indentation in the centers with your thumb.) Sprinkle cookies with poppy seeds.\nBake cookies until firm but still pale, 20- 25 minutes. Transfer to wire racks; let cool.\nDO AHEAD: Cookies can be baked 5 days ahead. Store airtight at room temperature.",
        "Image_Name":"rose-water-shortbread-cookies-51169140"
    },
    {
        "Title":"Pistachio Shortbread",
        "Ingredients":"['1 cup unsalted, shelled raw pistachios (about 4 1\/2 ounces)', '1 1\/4 cups all-purpose flour', '3\/4 cup sugar', '1\/2 cup (1 stick) chilled unsalted butter, cut into 1\/2\" pieces', '1 teaspoon kosher salt', '1\/4 teaspoons vanilla extract']",
        "Instructions":"Pulse pistachios in a food processor until finely ground but not a paste, about 30 seconds. Add flour, sugar, butter, salt, and vanilla; pulse until mixture is the consistency of cornmeal. With machine running, drizzle in 2 tablespoons ice water (a crumbly dough should form; do not overprocess).\nTransfer dough to a sheet of parchment paper and pat into a rectangle. Top with another sheet of parchment and roll out to a 12x8\" rectangle. Transfer dough (in parchment paper) to a baking sheet and chill until firm, about 1 hour.\nPlace racks in upper and lower thirds of oven; preheat to 350°F. Remove top sheet of parchment paper from dough and discard. Cut dough lengthwise into 8 equal strips, then each strip crosswise into quarters, forming 32 rectangles. Place rectangles on 2 parchment-lined baking sheets, spacing 1\" apart.\nBake shortbread until golden brown, rotating sheets halfway through, 18-20 minutes. Transfer to wire racks; let cool.\nDO AHEAD: Shortbread can be made 5 days ahead. Store airtight at room temperature.",
        "Image_Name":"pistachio-shortbread-51161410"
    },
    {
        "Title":"Shortbread",
        "Ingredients":"['1\/2 cup (1 stick) butter, softened', '3\/4 cup flour', '1\/4 cup cornstarch', '1\/4 cup sugar', 'Pinch salt', '1\/2 teaspoon vanilla', 'Green sanding or decorating sugar']",
        "Instructions":"1 Preheat the oven to 325°F and lightly grease an 8-inch round cake tin.\n2 Put the butter in a medium bowl and use a hand mixer to beat until smooth. Add the remaining ingredients and mix to combine. Press into the bottom of the prepared pan, smoothing the surface with your fingertips, and chill for 10 minutes in the refrigerator.\n3 Sprinkle generously with the green sugar and bake for 15 minutes, until just turning golden brown. While still warm, cut into 16 wedges with the tip of a paring knife. Let cool completely before removing from pan.",
        "Image_Name":"shortbread-51145200"
    },
    {
        "Title":"Lemon-Honey Tart with Salted Shortbread Crust",
        "Ingredients":"['Nonstick vegetable oil spray', '1 3\/4 cups all-purpose flour', '2 tablespoons cornstarch', '1 1\/4 teaspoons kosher salt', '3\/4 cup (1 1\/2 sticks) unsalted butter, room temperature, cut into 1\" pieces', '2\/3 cup powdered sugar', '1 Meyer lemon or thin-skinned regular lemon', '1 cup sugar', '3 tablespoons honey', '1 tablespoon finely grated lemon zest', '3 large eggs', '2 large egg yolks', '1\/4 cup all-purpose flour', '2 teaspoons cornstarch', '1\/4 teaspoon kosher salt', '2\/3 cup fresh lemon juice, preferably Meyer lemon', 'A 9\"-diameter springform pan']",
        "Instructions":"Coat springform pan with nonstick spray. Whisk flour, cornstarch, and salt in a small bowl; set aside. Place butter and powdered sugar in a food processor. Pulse until mixture is smooth. Add dry ingredients to food processor and pulse until mixture resembles medium-size pebbles (dough will not come together completely). Transfer dough to prepared pan. Using your fingers, press dough evenly onto bottom and 1 1\/2\" up sides of pan. DO AHEAD: Crust can be prepared 1 day ahead. Cover and chill.\nUsing a mandoline, slice lemon into paper-thin rounds. Remove seeds. (If using a regular lemon, blanch slices in boiling water for 4 minutes, drain, and let cool before proceeding). Mix sugar, honey, and lemon zest in a medium bowl. Add lemon slices and toss to coat. Let sit until lemon is softened and sugar is dissolved, 30-45 minutes. DO AHEAD: Lemon slice mixture can be made 1 day ahead. Cover and chill.\nPlace rack in upper third of oven; preheat to 325°F. Bake crust until center is firm to the touch and edges are beginning to turn golden brown, 30-35 minutes.\nWhen crust is almost done baking, whisk eggs and egg yolks in a medium bowl to blend. Whisk flour, cornstarch, and salt in a small bowl; add to egg mixture and whisk to combine. Whisk in lemon juice. Add lemon slice mixture; mix gently to combine.\nReduce oven temperature to 300°F. Pour filling into hot crust. Bake until filling is set and slightly puffed around edges, 25-30 minutes. Transfer pan to a wire rack; let cool completely. Chill for at least 4 hours, then unmold. Serve cold. DO AHEAD: Tart can be made 2 days ahead. Cover and keep chilled.",
        "Image_Name":"lemon-honey-tart-with-salted-shortbread-crust-51140700"
    },
    {
        "Title":"Cornbread, Sausage, and Pecan Dressing",
        "Ingredients":"['3\/4 cup (1 1\/2 sticks) unsalted butter plus more for baking dish', '1 pound day-old cornbread, broken into 1 1\/2\"-2\" pieces (9 cups)', '1 pound breakfast sausage links, casings removed', '2 1\/2 cups chopped yellow onions', '1 1\/2 cups 1\/4\" slices celery', '1\/4 cup apple cider vinegar', '3 cups low-sodium chicken broth, divided', '1 1\/4 cups chopped toasted pecans (optional)', '1\/2 cup chopped flat-leaf parsley', '2 tablespoons chopped fresh sage', '1 tablespoon chopped fresh rosemary', '1 tablespoon chopped fresh thyme', '2 teaspoons kosher salt', '1 teaspoon freshly ground black pepper', '2 large eggs']",
        "Instructions":"Arrange racks in upper and lower thirds of oven; preheat to 250°F. Butter a 13x9x2\" baking dish; set aside. Scatter cornbread in a single layer on 2 rimmed baking sheets. Bake, stirring often and rotating sheets halfway through, until dried out, about 1 hour. Let cool. Transfer to a very large mixing bowl.\nMeanwhile, cook sausage in a large skillet over medium-high heat, breaking up into 1\/2\"-1\" pieces with a wooden spoon, until browned, 8-10 minutes. Transfer to bowl with cornbread but do not stir.\nHeat 3\/4 cup butter in same skillet; add onions and celery and cook, stirring often, until softened and just beginning to brown, about 10 minutes. Add to cornbread in bowl.\nReturn skillet to heat. Add vinegar; cook, scraping up browned bits from bottom of pan, for 1 minute. Pour into bowl with cornbread. Gently fold in 1 1\/2 cups broth, pecans, if using, parsley, sage, rosemary, and thyme. Add salt and pepper. Let cool.\nPreheat oven to 350°F. Whisk 1 1\/2 cups broth and eggs in a small bowl. Fold gently into cornbread until thoroughly combined, taking care not to mash cornbread (mixture will look wet). Transfer to prepared dish, cover with foil, and bake until an instantread thermometer inserted into the center of dressing registers 160°F, about 40 minutes. DO AHEAD: Dressing can be made 1 day ahead. Uncover; let cool. Cover and chill.\nBake dressing, uncovered, until set and top is browned and crisp, 40-45 minutes longer (if chilled, add 10-15 minutes).",
        "Image_Name":"cornbread-sausage-and-pecan-dressing-51124200"
    },
    {
        "Title":"Cranberry Shortbread",
        "Ingredients":"['1 cup all-purpose flour', '3\/4 cup sugar, divided', '1\/4 teaspoon kosher salt', '1\/2 cup (1 stick) chilled unsalted butter, cut into 1\/2\" cubes', '1 10-ounce bag fresh (or frozen, thawed) cranberries', '1\/4 cup fresh grapefruit juice', '1 teaspoon grated grapefruit zest']",
        "Instructions":"Preheat oven to 350°F. Line an 8x8x2\" pan with parchment, leaving a 2\" overhang on 2 opposite sides. Whisk flour, 1\/4 cup sugar, and salt in a medium bowl. Using your fingertips, rub butter into dry ingredients until mixture resembles coarse meal.\nTransfer to prepared pan; press evenly onto bottom of pan (using the bottom of a flat measuring cup works well). Prick dough all over with a fork.\nBake shortbread until cooked through and pale golden, 25-30 minutes. Transfer to a wire rack. Let cool completely in pan. DO AHEAD: Shortbread can be made 3 days ahead. Cover pan tightly with plastic wrap and store at room temperature.\nBring remaining 1\/2 cup sugar, 1 1\/2 cups cranberries, and grapefruit juice to a simmer in a small saucepan and cook, stirring occasionally, until cranberries burst and mixture is syrupy, about 8 minutes. Stir in remaining cranberries and cook until skins begin to split, about 3 minutes. Let cool. DO AHEAD: Cranberry topping can be made 3 days ahead. Cover and chill.\nSpread cooled cranberry topping over shortbread. Scatter zest over. Using paper overhang, lift shortbread from pan and transfer to a cutting board. Cut shortbread.",
        "Image_Name":"cranberry-shortbread-51122650"
    },
    {
        "Title":"Grilled Flatbread",
        "Ingredients":"['2 1\/2 teaspoons active dry yeast', '4 3\/4 cups all-purpose flour plus more for dusting', '2 1\/4 cups whole wheat flour', '2 tablespoons kosher salt', '1\/2 cup sour cream', 'Vegetable oil (for brushing)', 'Ancho Chile Oil , Green Charmoula , and grated Cotija or Parmesan cheese', 'Puréed black beans, sliced avocado, radishes, and pico de gallo', 'Sliced plum tomatoes, fresh basil, olive oil, crema (or sour cream)']",
        "Instructions":"Dissolve yeast in 3 cups warm water in a large bowl. Add all-purpose and whole wheat flours; mix with your fingertips until a shaggy dough forms. Cover bowl with plastic wrap and let rest at room temperature for 20 minutes.\nSprinkle salt over dough, then add sour cream; knead until well incorporated and dough pulls away from sides of bowl and holds together in a loose, wet ball, about 5 minutes (dough will be very soft and wet; lightly moisten your hands to prevent sticking if needed). Cover bowl with plastic wrap and let dough rise at room temperature for 30 minutes.\nKnead dough an additional 4-5 times to deflate. Cover and chill for up to 2 days. (Dough will develop in flavor and continue to rise slowly in refrigerator.) Alternatively, let dough stand at room temperature until doubled in volume, 3-4 hours (the warmer and more humid your kitchen is, the faster it will rise). Chill for 1 hour before grilling to make it easier to handle.\nBuild a medium-hot fire in a charcoal grill, or heat a gas grill to high. Divide dough into 8 equal portions. Generously flour a work surface. Working with 1 or 2 portions at a time (depending on how many flatbreads will fit on your grill), roll out dough or press with your hands into a 1\/4\"-thick shape. (It doesn't have to be perfectly round.)\nBrush grill rack with oil. Grill flatbreads until lightly charred on one side and no longer sticking to grill, 2-3 minutes. Using tongs, turn flatbreads and grill until cooked through, 1-2 minutes longer. Add desired toppings and serve warm.",
        "Image_Name":"grilled-flatbread-51104630"
    },
    {
        "Title":"Simple Strawberry Dulce de Leche Shortbread Tart",
        "Ingredients":"['1 cup all-purpose flour', '1\/3 cup cornstarch', '1\/4 teaspoon baking powder', '1\/4 teaspoon salt', '3\/4 stick (6 tablespoons) unsalted butter, softened', '1\/3 cup granulated sugar', '2 large egg yolks', '1 teaspoon vanilla', '1 cup chilled heavy cream', '1\/2 cup sour cream', '3 tablespoons sugar', '1 teaspoon vanilla', '1\/2 cup homemade dulce de leche (or store-bought)', '1 pound strawberries, hulled and sliced']",
        "Instructions":"Heat oven to 350°F with rack in middle. Lightly butter a large baking sheet.\nWhisk together flour, cornstarch, baking powder, and salt in a small bowl.\nBeat together butter and sugar in a large bowl with an electric mixer on medium-high speed until light and fluffy, then beat in egg yolks and vanilla. Reduce speed to low and mix in flour mixture until combined.\nForm dough into a disk and roll out between 2 large sheets of parchment paper into an 11-inch round (about 1\/8 inch thick). Peel off and discard top piece of parchment. Slide round (still on bottom piece of parchment) onto baking sheet. (Butter on sheet will help keep parchment in place.)\nBake until round is firm to the touch and pale golden around edges, 12 to 16 minutes. Slide round on parchment onto a rack to cool completely.\nBeat cream with sour cream, sugar, and vanilla using an electric mixer until soft peaks form.\nCarefully slide cool tart from parchment onto a flat platter or cutting board. Gently spread dulce de leche onto crust (an offset spatula is helpful for this), taking care not to break crust. Spoon cream on top of dulce de leche and top with strawberries.\nServe immediately.",
        "Image_Name":"simple-strawberry-dulce-de-leche-shortbread-tart-395010"
    },
    {
        "Title":"Parmesan Shortbread with Fennel and Sea Salt",
        "Ingredients":"['1 cup (2 sticks) unsalted butter, room temperature', '1\/2 cup powdered sugar', '1 teaspoon freshly ground black pepper', '3\/4 teaspoon kosher salt', '2 cups all-purpose flour plus more', '1 cup finely grated Parmesan (about 2 ounces)', '1 tablespoon fennel seeds', '1 teaspoon Maldon sea salt or other coarse salt', '2 tablespoons extra-virgin olive oil']",
        "Instructions":"Using an electric mixer, beat butter in a medium bowl on low speed until smooth, 1-2 minutes. Add powdered sugar, pepper, and kosher salt. Reduce speed to medium and beat, occasionally scraping down sides of bowl, until light and fluffy, 4-5 minutes. Add flour and cheese. Reduce mixer speed to low and beat mixture just until dough comes together.\nWrap dough in plastic and flatten into a rectangle. Chill until firm, at least 2 hours. DO AHEAD: Dough can be made 5 days ahead. Keep chilled. Let stand at room temperature for 30 minutes before continuing.\nPlace fennel seeds in a resealable plastic freezer bag. Coarsely crush with a rolling pin or the bottom of a skillet. Alternatively, pulse in a spice mill until coarsely crushed. Transfer to a small bowl; stir in sea salt. Set fennel salt aside.\nArrange a rack in center of oven and preheat to 350°F. Line a baking sheet with parchment paper. Remove plastic wrap from dough. Roll out dough on a lightly floured surface to a 10x8\" rectangle about 1\/4\" thick. Cut in thirds crosswise, then cut each third crosswise into 6 rectangles. Arrange cookies on prepared baking sheet, spacing 1\" apart. Brush cookies generously with oil, then sprinkle with fennel salt.\nBake, rotating sheet halfway through, until cookies are golden brown (flecks of cheese will be slightly darker), 20-24 minutes. Let cool on sheets for at least 10 minutes. Serve warm or at room temperature. DO AHEAD: Can be made 2 days ahead. Store airtight at room temperature.",
        "Image_Name":"parmesan-shortbread-with-fennel-and-sea-salt-394673"
    },
    {
        "Title":"Gingerbread Cake",
        "Ingredients":"['Nonstick vegetable oil spray', '1 1\/2 cups all-purpose flour', '1 teaspoon ground ginger', '3\/4 teaspoon ground cinnamon', '3\/4 teaspoon kosher salt', '1\/2 teaspoon baking powder', '1\/2 teaspoon baking soda', '1\/2 cup (1 stick) unsalted butter, cut into 1\/2\" pieces', '1\/2 cup (packed) light brown sugar', '1\/2 cup mild-flavored (light) molasses', '1 large egg, beaten to blend', '2 teaspoons grated peeled ginger', '1 cup chilled heavy cream', '1 tablespoon powdered sugar', '1\/4 cup store-bought lemon curd', 'Finely grated lemon zest', 'An 8\" square metal cake pan']",
        "Instructions":"Preheat oven to 350°F. Coat pan with nonstick spray. Line bottom with parchment paper; spray paper. Whisk flour and next 5 ingredients in a medium bowl. Place butter in a large bowl. Pour 1\/2 cup boiling water over; whisk until melted. Whisk in sugar and next 3 ingredients. Add dry ingredients; whisk to blend. Transfer to prepared pan.\nBake until a tester inserted into center of cake comes out clean, about 25 minutes. Let cool in pan for 10 minutes. Invert onto a wire rack; let cool. Remove parchment.\nBeat cream and sugar in a medium bowl until firm peaks form. Fold in curd, leaving swirls. Spread over cake. Garnish with zest.",
        "Image_Name":"gingerbread-cake-368939"
    },
    {
        "Title":"Oyster-Cornbread Stuffing",
        "Ingredients":"['2 cups low-salt chicken broth', '1 sprig sage plus 1 tablespoon thinly sliced sage leaves', '1 sprig rosemary', '1 pound breakfast sausage, casings removed', '1\/4 cup (1\/2 stick) unsalted butter', '2 medium onions, finely chopped', '1 1\/2 cups finely chopped celery', '1\/4 cup finely chopped flat-leaf parsley', '2 tablespoons finely chopped fresh thyme', 'Kosher salt, freshly ground pepper', '4 dozen small shucked oysters in their liquor (about 1 cup liquor)', '4 large eggs, whisked', '12 cups savory (not sweet) cornbread cut into 3\/4\" cubes, stale or toasted in a 300° oven until dry']",
        "Instructions":"Preheat oven to 350°. Combine broth, sage sprig, and rosemary sprig in a small saucepan; bring to a boil. Remove pan from heat and let stock steep until ready to use.\nMeanwhile, heat a large skillet over medium heat and cook sausage, breaking it up with a spoon, until cooked through, 7-8 minutes. Using a slotted spoon, transfer sausage to a large bowl, leaving any rendered fat in pan.\nMelt butter in skillet; add onions and celery and cook until softened, about 10 minutes. Add onion mixture, sliced sage, parsley, and thyme to bowl with sausage. Mix well; season with salt and pepper. Add oysters with liquor, reserved broth (sprigs removed), and eggs; toss to combine. Add cornbread; toss until well blended and cornbread absorbs most of liquid.\nSpoon stuffing into a 3-quart baking dish. If any liquid remains in bowl, drizzle 1\/4 to 1\/2 cup over to moisten cornbread (amount varies depending on dryness of cornbread). Bake until browned and liquid is absorbed, 1 hour-1 hour 15 minutes, tenting with foil if top gets too dark.",
        "Image_Name":"oyster-cornbread-stuffing-368297"
    },
    {
        "Title":"Shortbread Cookies",
        "Ingredients":"['2 cups whole wheat flour', '1\/2 cup sugar', '1 1\/2 teaspoons baking powder', '10 1\/2 tablespoons salted butter, room temperature', '1 large egg, room temperature', '1 large egg yolk, room temperature', '3 tablespoons (about) raspberry jam']",
        "Instructions":"Preheat oven to 400°F. Whisk flour, sugar, and baking powder in a large bowl. Add butter; using your fingertips, rub in butter until coarse meal forms. Whisk egg and yolk in a bowl; add to flour mixture; stir just to blend.\nLine 2 baking sheets with parchment paper. Measure dough by 2 tablespoonfuls and roll into balls. Place on prepared sheets, spacing 2\" apart. Make an indentation in center of each ball; fill each with 1\/2 teaspoon jam.\nBake cookies until golden, 12-14 minutes. Transfer to a wire rack to cool.",
        "Image_Name":"shortbread-cookies-367140"
    },
    {
        "Title":"Zucchini Cornbread",
        "Ingredients":"['1\/2 cup (1 stick) unsalted butter plus more for pan', '2 large eggs, lightly beaten', '1\/2 cup buttermilk', '1 large zucchini (about 10 ounces)', '1 cup all-purpose flour', '1\/2 cup whole wheat flour', '1\/2 cup sugar', '1 teaspoon baking powder', '3\/4 teaspoon fine sea salt', '1\/2 teaspoon baking soda', '3\/4 cup medium-grind cornmeal']",
        "Instructions":"Position a rack in the middle of oven and preheat to 350°F. Butter a 9x5x3\" loaf pan.\nMelt 1\/2 cup butter in a small saucepan over medium-high heat. Continue cooking until butter solids at bottom of pan turn golden brown, about 3 minutes. Scrape butter into a medium bowl. Set aside and let cool. Whisk in eggs and buttermilk.\nTrim zucchini ends. Thinly slice five 1\/8\" rounds from 1 end of zucchini and reserve for garnish. Coarsely grate remaining zucchini. Add to bowl with butter mixture and stir until well blended.\nSift both flours, sugar, baking powder, salt, and baking soda into a large bowl. Whisk in cornmeal. Add zucchini mixture; fold just to blend (mixture will be very thick). Transfer batter to prepared pan and smooth top. Place reserved zucchini slices atop batter down center in a single layer.\nBake bread until golden and a tester inserted into center comes out clean, 55-65 minutes. Let cool in pan 10 minutes. Remove from pan; let cool completely on a wire rack. DO AHEAD: Can be made 1 day ahead. Store airtight at room temperature.",
        "Image_Name":"zucchini-cornbread-366395"
    },
    {
        "Title":"Lemon-Lime Basil Shortbread Cookies",
        "Ingredients":"['1 cup all-purpose flour', '1\/2 cup powdered sugar plus more for pressing cookies', '1\/2 cup (1 stick) chilled unsalted butter, cut into 1\/2\" cubes', '2 tablespoons sliced fresh basil leaves', '1 teaspoon finely grated lemon zest', '1 tablespoon fresh lemon juice', '1\/2 teaspoon finely grated lime zest', '1\/4 teaspoon kosher salt', 'Sanding sugar (optional)', 'Ingredient info: Decorative sanding sugar has large, crunchy crystals; available at specialty foods stores and beryls.com.']",
        "Instructions":"Preheat oven to 375°F. Place flour, 1\/2 cup powdered sugar, butter, basil, both zests, lemon juice, and salt in a food processor. Pulse until large, moist clumps form. Measure level tablespoonfuls of dough; roll between your palms to form balls. Place on a large baking sheet, spacing 2\" apart. Lightly dust the bottom of a flat measuring cup with powdered sugar and press cookies into 2\" rounds, dusting cup bottom with powdered sugar as needed to prevent sticking. Sprinkle tops of cookies with sanding sugar, if using.\nBake until edges are brown, about 20 minutes. Transfer to a wire rack; let cool.",
        "Image_Name":"lemon-lime-basil-shortbread-cookies-366434"
    },
    {
        "Title":"Grilled Flatbreads",
        "Ingredients":"['1 1\/4 ounce envelope active dry yeast', '1 tablespoon olive oil plus more for brushing', '5 cups (or more) all-purpose flour', '1 tablespoon kosher salt plus more for seasoning', '1 tablespoon (about) Tabil Spice Blend', 'Freshly ground black pepper']",
        "Instructions":"Pour 2 cups warm water (105°-115°) into the bowl of a stand mixer fitted with a paddle. Sprinkle yeast over. Let sit until yeast dissolves, about 10 minutes. Mix in 1 tablespoon oil. Add 5 cups flour and 1 tablespoon salt; beat until dough forms, about 1 minute.\nTransfer dough onto a floured work surface and knead until smooth, adding more flour by spoonfuls as needed for soft but still slightly sticky dough, about 5 minutes. Place dough in a large, lightly oiled bowl; turn to coat. Cover bowl with a kitchen towel and let dough rise in a warm place until doubled in volume, about 1 hour.\nTurn dough out onto a floured work surface. Divide into 8 equal pieces. Roll into balls; space 2\" apart. Cover with a kitchen towel; let rest 15 minutes.\nPrepare a grill to medium-high heat. Lightly brush 4 baking sheets with oil. Working with 1 dough ball at a time, roll out into 9\" round. Place 2 dough rounds on each prepared sheet. Brush lightly with oil; season with spice blend, salt, and pepper.\nBrush grill rack with oil. Working in batches, place flatbreads spice side down on rack. Brush with oil, season with salt and pepper, and grill until lightly charred in spots and cooked through, 1-1 1\/2 minutes per side. Transfer to a work surface. Cut into wedges.",
        "Image_Name":"grilled-flatbreads-365694"
    },
    {
        "Title":"Rum Raisin Shortbread",
        "Ingredients":"['1\/2 cup dark rum', '1 cup currants', '1 cup (2 sticks) unsalted butter, room temperature', \"3\/4 cup confectioners' sugar\", '1\/2 teaspoon finely grated orange zest', '1 teaspoon pure vanilla extract', '1 1\/2 cups all-purpose flour', '3\/4 cup finely shredded unsweetened coconut', '1 teaspoon coarse salt']",
        "Instructions":"Combine rum and currants in an airtight container; let sit at room temperature overnight. Drain; reserving 2 tablespoons rum.\nPut butter, confectioners' sugar, and zest in the bowl of an electric mixer fitted with the paddle attachment. Beat until creamy and smooth, about 2 minutes. Add vanilla and reserved rum. Beat well, scraping down the sides of the bowl as necessary. Reduce speed to low. Add flour, coconut, and salt, and beat for 3 minutes. Stir in currants by hand. Divide dough in half and form each into a log about 1\/2 inches in diameter; wrap in parchment, and refrigerate 1 hour (or up to 3 days).\nPreheat oven to 325°F. Remove dough from parchment; slice into 1\/4-inch-thick rounds.\nPlace on parchment paper–lined baking sheets, spacing about 1 inch apart. Bake until pale golden, about 20 minutes, rotating sheets halfway through. Transfer to wire racks to cool completely. Cookies can be stored in airtight containers at room temperature up to 1 week.",
        "Image_Name":"rum-raisin-shortbread-363335"
    },
    {
        "Title":"Lemongrass Bars with Coconut Shortbread Crust",
        "Ingredients":"['1 1\/2 cups all-purpose flour', '1 cup sweetened shredded coconut (about 3 ounces)', '1\/2 cup powdered sugar', '1\/2 cup plus 3 tablespoons unsalted butter, room temperature', '1 1\/4 cups sugar', '3 lemongrass stalks, bottom 4 inches only, tough outer layer removed, finely chopped (scant 1\/2 cup)', '5 tablespoons fresh lemon juice', '3 large eggs', '1\/4 cup all purpose flour', 'Powdered sugar']",
        "Instructions":"Preheat oven to 350°F. Butter 13 x 9 x 2- inch metal baking pan. Using electric mixer, beat flour, coconut, powdered sugar, and 1\/2 teaspoon salt in large bowl until well blended, 30 seconds. Add butter; beat on low speed until moist clumps form. Press dough onto bottom and 1\/2 inch up sides of pan. Bake crust until golden (edges will be darker), about 25 minutes.\nMeanwhile, place sugar and lemongrass in processor; pulse until lemongrass is finely ground, about 1 minute. Add lemon juice; process until well blended, about 30 seconds. Add eggs; process to blend, 10 to 15 seconds. Add flour and pinch of salt; pulse until smooth.\nReduce oven temperature to 325°F. Pour filling over hot crust; bake until filling is firm, 22 to 23 minutes. Cool in pan on rack.\nCut lemongrass bars lengthwise into 4 strips, then crosswise into 6 pieces. Dust bars with powdered sugar and serve.",
        "Image_Name":"lemongrass-bars-with-coconut-shortbread-crust-364029"
    },
    {
        "Title":"Coffee-Spice Shortbread with Crystallized Ginger",
        "Ingredients":"['2 3\/cups all purpose flour', '3\/4 cup (packed) dark brown sugar', '2 tablespoons plus 2 teaspoons ground coffee beans', '2 teaspoons ground ginger', '1 1\/2 teaspoons ground cinnamon', '1 teaspoon ground cardamom', '1\/2 teaspoon salt', '1 cup (2 sticks) chilled unsalted butter, cut into 1\/2-inch cubes', '1\/2 cup powdered sugar', '2 teaspoons (or more) water', '1 teaspoon vanilla extract', '6 tablespoons chopped crystallized ginger', '2 9-inch-diameter tart pans with removable bottom']",
        "Instructions":"Position 1 rack in top third and 1 rack in bottom third of oven and preheat to 325°F. Mix flour, brown sugar, ground coffee, ginger, cinnamon, cardamom, and salt in processor 5 seconds. Add butter; using on\/off turns, process until moist clumps begin to form. Gather dough into ball. Divide dough equally between two 9-inch- diameter tart pans with removable bottom. Press dough firmly and evenly onto bottom of each tart pan.\nBake shortbread 25 minutes. Reverse position of pans and continue to bake until shortbread is golden brown and firm around edges but center is still just slightly soft, about 20 minutes longer. Cool shortbread in pans 5 minutes. Remove pan sides. Cut warm shortbread in each pan into 12 wedges. Cool completely.\nMix powdered sugar, 2 teaspoons water, and vanilla in small bowl, adding more water by 1\/4 teaspoonfuls, if necessary, for spreadable glaze. Using offset spatula, spread glaze thinly over cookies, leaving 1\/2- inch border at edges. Sprinkle crystallized ginger over. Let stand until glaze is set, about 1 hour. Do ahead can be made 3 weeks ahead. Store airtight in freezer. Bring to room temperature before serving.",
        "Image_Name":"coffee-spice-shortbread-with-crystallized-ginger-362592"
    },
    {
        "Title":"Masa Cornbread Stuffing with Chiles",
        "Ingredients":"['1 cup (2 sticks) unsalted butter', '3 cups chopped white onions', '5 garlic cloves, minced', '18 ounces fresh Anaheim chiles (about 6 large), seeded, chopped (scant 4 cups)', '18 ounces fresh poblano chiles, seeded, chopped (about 3 cups)', '4 large fresh jalapeño chiles, seeded (if desired), chopped (about 1 cup)', '1 1\/2 tablespoons ground New Mexico chiles', '1 tablespoon coarse kosher salt', '3\/4 teaspoon freshly ground black pepper', '3\/4 teaspoon dried oregano', '3\/4 teaspoon ground cumin', '1 cup chopped fresh cilantro', '1 13 x 9-inch loaf Masa Cornbread , cut into 1-inch cubes (12 to 13 cups)', '6 ounces Monterey Jack cheese, cut into 1\/3-inch cubes (optional)', '4 large eggs', '1 cup low-salt chicken broth', 'Ingredient info: Look for Anaheim chiles (California chiles), poblano chiles (a.k.a. pasillas), and ground New Mexico chiles at some supermarkets and at Latin markets.']",
        "Instructions":"Melt butter in large skillet over medium-high heat. Add onions and garlic; sauté until tender, about 5 minutes. Add all chiles; sauté until beginning to soften, 12 to 14 minutes. Stir in ground chiles and next 4 ingredients. Transfer vegetable mixture to bowl. DO AHEAD: Can be made 1 day ahead. Cool, then cover and chill.\nPreheat oven to 375°F. Butter 15 x 10 x 2- inch glass baking dish. Stir cilantro into vegetable mixture. Place cornbread cubes in very large bowl; add vegetable mixture and toss gently. Toss in cheese, if using. Whisk eggs and broth in medium bowl, then pour over stuffing and toss gently to moisten. Transfer stuffing to prepared dish. Cover dish with buttered foil, buttered side down.\nBake stuffing until heated through, about 30 minutes. Remove foil; bake until top is golden, about 30 minutes longer.",
        "Image_Name":"masa-cornbread-stuffing-with-chiles-361732"
    },
    {
        "Title":"Brown Sugar Shortbread",
        "Ingredients":"['1 cup (2 sticks) unsalted butter, at room temperature', '1\/2 cup packed light brown sugar or muscovado sugar', '1 2\/3 cup all-purpose flour', '1\/3 cup cornstarch', 'Pinch of salt']",
        "Instructions":"1. Position a rack in the center of the oven and preheat to 350 degrees. Lightly butter a 9- to 9 1\/2 inch springform pan.\n2. Beat the butter in a medium bowl with an electric mixer set at high speed until smooth, about 1 minute. Add the sugar and beat until the mixture is light in color and texture, about 2 minutes. Using a wooden spoon, stir in the flour, cornstarch, and salt. Press the dough evenly into the pan. Using the tines of a fork, press around the perimeter of the dough. Prick the dough, reaching down to the bottom of the pan, into 10 equal wedges.\n3. Bake until lightly browned, about 30 minutes. Cool completely in the pan. Remove the sides of the pan. Cut the shortbread into wedges, following the perforations in the dough. (The shortbread can be stored in an airtight container for up to 5 day.)",
        "Image_Name":"brown-sugar-shortbread-361649"
    },
    {
        "Title":"Chocolate-Toffee Shortbread Fingers",
        "Ingredients":"['1\/2 cup toasted and cooled pecans, coarsely chopped', \"3\/4 cup Heath Bits 'O Brickle Toffee bits or Skor or Heath bars, coarsely chopped\", '1 bag (12 ounces) bittersweet or semisweet chocolate chips', '1 tablespoon vegetable oil', '4 packages (8.8-ounces each) Walkers Pure Butter Shortbread Fingers']",
        "Instructions":"1. Line a few baking sheets with parchment paper. Combine the nuts and toffee bits in a shallow bowl.\n2. Combine the chocolate and oil in a small microwave-safe bowl. Heat the chocolate in the microwave on high until melted, 30 seconds to 1 minute depending on the strength of your microwave. Stir until smooth. (Alternatively, place water to a depth of 1 inch in the bottom of a double boiler or a large saucepan and bring to a bare simmer. Place the chocolate chips and oil in the top of the double boiler or in a stainless steel bowl big enough to rest on top of the saucepan without touching the water. Heat, whisking occasionally, until the chocolate is melted.)\n3. Hold a cookie by one end and dip it into the chocolate, turning, to coat three quarters of the cookie; let the excess drip back into the bowl. Hold the cookie over the bowl of nuts and toffee bits and sprinkle some of the mixture onto the chocolate-coated top and sides of the cookie. Place the cookie on a prepared baking sheet. Repeat with the remaining cookies. Let the cookies rest until the chocolate is set, about 30 minutes.\nChocolate-Toffee Shortbread Fingers will keep, between layers of parchment paper, in an airtight container at room temperature for up to 1 week\nTo toast the pecans, place them in a single layer on an ungreased baking sheet and bake in a 350°F oven, shaking the pan occasionally, until fragrant, 5 to 10 minutes. Watch them closely to make sure they don't burn, and transfer the toasted nuts to a plate to let them cool.",
        "Image_Name":"chocolate-toffee-shortbread-fingers-361429"
    },
    {
        "Title":"Maple-Gingerbread Layer Cake with Salted Maple-Caramel Sauce",
        "Ingredients":"['3\/4 cup pecan halves, toasted', '1\/4 cup pure maple syrup (preferably Grade B)', 'Coarse kosher salt', '2 1\/2 cups all purpose flour', '1 1\/2 teaspoons Chinese five-spice powder', '1 teaspoon baking soda', '1\/2 teaspoon coarse kosher salt', '1\/3 cup chopped crystallized ginger (1 1\/2 to 2 ounces)', '1 cup maple sugar', '3\/4 cup (1 1\/2 sticks) unsalted butter, room temperature', '2 large eggs', '3\/4 cup hot water', '2\/3 cup mild-flavored (light) molasses', '1 1\/3 cups chilled crème fraîche', '1 1\/3 cups chilled heavy whipping cream', '1\/2 cup maple sugar', '6 tablespoons powdered sugar', 'Salted Maple-Caramel Sauce', 'Ingredient info: Chinese five-spice powder-a spice blend that usually contains ground fennel seeds, Sichuan peppercorns, cinnamon, star anise, and cloves-is available in the spice section of most supermarkets. Crème fraîche is sold at most supermarkets and at specialty foods stores.']",
        "Instructions":"Place large piece of foil on work surface. Combine nuts and maple syrup in heavy medium skillet (do not use nonstick) over medium-high heat and bring to boil, tossing to coat. Cook until syrup is dark amber and almost cooked away and thickly coats nuts, tossing often, 3 to 3 1\/2 minutes. Scrape nuts onto foil. Working quickly with 2 forks, separate nuts. Sprinkle with coarse salt. Cool until coating is crisp and hard, about 1 hour. DO AHEAD: Pecans can be made 1 day ahead. Store airtight at room temperature.\nPreheat oven to 350°F. Butter and flour two 9-inch-diameter cake pans with 1 1\/2-inch-high sides. Combine first 4 ingredients in processor; add ginger. Blend until ginger is finely ground, about 1 minute. Using mixer, beat maple sugar and butter in large bowl until fluffy. Beat in eggs 1 at a time (batter may look curdled). Stir 3\/4 cup hot water and molasses in small bowl. Beat dry ingredients into butter mixture in 4 additions alternately with molasses mixture in 3 additions.\nDivide batter between prepared pans (about 21\/2 cups each). Bake until tester inserted into center comes out clean, 30 to 32 minutes. Cool cakes in pans on racks.\nCombine crème fraîche, cream, and both sugars in large bowl. Using electric mixer, beat until very thick and stiff.\nCut around pan sides to loosen cake layers; turn out onto racks. Place 1 cake layer on platter. Spread with 1 1\/3 cups frosting. Drizzle with 3 tablespoons caramel sauce. Top with second cake layer. Spread remaining frosting smoothly over top and sides of cake. Drizzle top of cake with 3 tablespoons sauce. Cover with cake dome; chill at least 1 hour. DO AHEAD: Can be made 1 day ahead; keep chilled. Let stand at room temperature 30 minutes before continuing.\nCut pecans into pieces or leave whole. Press pecans into frosting on sides of cake. Cut cake into wedges. Spoon sauce over.",
        "Image_Name":"maple-gingerbread-layer-cake-with-salted-maple-caramel-sauce-361294"
    },
    {
        "Title":"Eggplant Marinara Flatbread",
        "Ingredients":"['4 tablespoons (about) olive oil, divided', '6 1\/3- to 1\/2-inch-thick eggplant rounds (3 to 4 inches in diameter; from 1 large)', '1 loaf ciabatta or pain rustique, cut horizontally in half, trimmed to 9-inch length', '1 1\/4 cups purchased fresh marinara sauce', '2 ounces soft fresh goat cheese', '1\/3 cup chopped fresh basil plus 6 whole leaves (for garnish)', '1 cup coarsely grated mozzarella cheese (about 4 ounces)']",
        "Instructions":"Preheat oven to 400°F. Heat 2 tablespoons oil in large skillet over medium-high heat. Sprinkle eggplant with salt and pepper. Place in skillet. Cover. Cook until tender, turning, 10 minutes. Transfer to plate. Brush cut side of bottom half of bread with rest of oil. Cook in skillet, cut side down, until golden, 1 minute.\nPlace bread, cut side up, on baking sheet. Spread with 3\/4 cup sauce. Crumble goat cheese over; sprinkle with chopped basil. Top with eggplant. Mound mozzarella on eggplant; spoon remaining sauce over.\nBake bread until topping is hot and crust is crisp, about 12 minutes. Cut into 6 pieces. Garnish with basil leaves",
        "Image_Name":"eggplant-marinara-flatbread-361229"
    },
    {
        "Title":"Flatbread with Arugula, Asparagus, and Fried Eggs",
        "Ingredients":"['1 cup (packed) fresh spinach (about 2 ounces)', '1 cup (packed) arugula leaves (about 2 ounces) plus additional (for garnish)', '1\/2 cup plus 2 tablespoons extra-virgin olive oil plus additional (for brushing)', '4 garlic cloves, coarsely chopped', '1 cup (or more) warm water (110°F to 115°F), divided', '1 tablespoon honey', '2 1\/4-ounce packets active dry yeast', '3 cups all purpose flour', '1\/4 teaspoon coarse kosher salt', 'Cornmeal (for sprinkling)', '8 ounces fingerling potatoes, cooked, cooled, cut crosswise into 1\/3-inch slices', '8 ounces asparagus; thin stalks cut into 1\/2-inch pieces, thick stalks cut into 1\/4- to 1\/3-inch pieces', '2 large ears of corn, husked, kernels cut from cobs', '2\/3 cup fresh peas or frozen peas, thawed', '3\/4 cup ricotta cheese (not drained)', '8 large eggs', 'Parmesan cheese shavings', 'Heavy-duty stand mixer with dough hook attachment']",
        "Instructions":"Place spinach in microwave-safe bowl. Sprinkle with water. Microwave until wilted, about 20 seconds. Drain, pressing on spinach to release liquid. Place spinach, 1 cup arugula, 1\/2 cup oil, and garlic in blender. Blend until coarse puree forms. Transfer pesto to small bowl. Season to taste with salt and pepper. DO AHEAD: Can be made 1 day ahead. Cover and chill.\nStir 1\/4 cup warm water and honey in small bowl. Stir in yeast. Let stand until foamy, about 10 minutes. Place flour and coarse salt in stand mixer fitted with dough hook attachment. Add 3\/4 cup warm water and yeast mixture. Mix on medium speed until dough comes together and pulls away from sides of bowl, adding more water by tablespoonfuls if too dry, about 2 to 3 minutes. Brush large bowl with oil. Form dough into ball. Place in bowl; turn to coat. Cover with plastic; place in warm draft-free area until doubled in volume, about 1 hour.\nPlace pizza stone or baking sheet in oven (if using rimmed baking sheet, invert sheet, rim side down). Preheat oven to 500°F. Knead dough in bowl. Cover and let rise again until doubled in volume, about 45 minutes. Divide dough into 4 equal portions. Form each portion into ball. Place on floured work surface; cover with plastic wrap and let rest 10 minutes.\nSprinkle rimless baking sheet with cornmeal. Working with 1 ball at a time, roll out dough on floured surface to 12x7-inch oval. Transfer to sheet. Spread 2 tablespoons pesto over dough, leaving 1\/2- inch plain border. Sprinkle 1\/4 of potatoes, 1\/4 of asparagus, 1\/4 of corn, and 1\/4 of peas over pesto. Spoon three 1-tablespoon dollops ricotta over vegetables. Slide pizza onto stone; bake until crust is golden brown on bottom and around edges, 10 to 12 minutes.\nMeanwhile, brush nonstick skillet with oil; heat over medium heat. Crack 2 eggs into skillet; cook just until whites are set but yolks are still runny, about 3 minutes.\nTransfer pizza to work surface. Place 2 fried eggs atop pizza. Scatter shaved Parmesan and arugula leaves over. Cut pizza into wedges and serve. Repeat with remaining dough, pesto, potatoes, asparagus, corn, peas, ricotta, and eggs.",
        "Image_Name":"flatbread-with-arugula-asparagus-and-fried-eggs-360754"
    },
    {
        "Title":"Our Favorite Sour Milk Cornbread",
        "Ingredients":"['1 1\/2 cups fine-ground white cornmeal', '1 teaspoon salt', '1 teaspoon Homemade Baking Powder (see note)', '1 3\/4 cups soured milk or buttermilk', '2 eggs, lightly beaten', '2 tablespoons unsalted butter']",
        "Instructions":"Preheat the oven to 450°\nMix the cornmeal, salt, and baking powder together in a bowl. Stir the milk into the beaten eggs, and pour over the dry ingredients in batches, stirring vigorously to make a smooth glossy batter.\nCut the butter into pieces and put it in a 10-inch cast-iron skillet or baking pan. Put the skillet in the preheated oven, and heat until the butter is melted and foaming. Remove from the oven, and swirl the butter all around the skillet to coat the bottom and sides thoroughly. Pour the remaining melted butter into the cornbread batter, and stir well until the butter is absorbed into the batter. Turn the batter into the heated skillet, and put in the oven to bake for 30-40 minutes, until cornbread is golden brown and crusty on top and pulls away from the sides of the skillet.\nRemove the skillet from the oven, and turn the cornbread out onto a plate. Allow to cool for 5 minutes before cutting into wedges. Serve the cornbread while it is hot.",
        "Image_Name":"our-favorite-sour-milk-cornbread-358343"
    },
    {
        "Title":"Chocolate Chipotle Shortbread",
        "Ingredients":"['1 cup all-purpose flour', '1\/4 cup unsweetened cocoa powder', '1\/2 teaspoon chipotle chile powder', '1\/2 teaspoon cinnamon', '1\/8 teaspoon salt', '1 stick unsalted butter, softened', '1\/3 cup superfine granulated sugar']",
        "Instructions":"Preheat oven to 350°F with rack in middle.\nWhisk together flour, cocoa powder, chile powder, cinnamon, and salt in a bowl.\nBeat together butter and sugar with an electric mixer at medium speed until pale and fluffy. At low speed, mix in flour mixture until well blended. Divide dough in half and pat out into 2 (7-inch) rounds (1\/4 inch thick). Arrange rounds 2 inches apart on an ungreased baking sheet. Cut each round into 8 wedges (do not separate wedges). Prick all over with a fork.\nBake until dry to the touch, 16 to 18 minutes. Recut shortbread while hot, then cool on sheet (shortbread will crisp as it cools).",
        "Image_Name":"chocolate-chipotle-shortbread-357999"
    },
    {
        "Title":"Gingerbread Pancakes with Butterscotch Apples",
        "Ingredients":"['2 tablespoons unsalted butter', '2 large Golden Delicious apples (about 1 pound), peeled and sliced', '1\/4 cup packed light brown sugar', '1 tablespoon fresh lemon juice', '1 1\/4 teaspoons ground cinnamon', '1\/2 teaspoon table salt', '1 1\/2 teaspoons vanilla extract', '3\/4 cup unbleached all purpose flour', '1\/4 cup granulated sugar', '1 1\/2 tablespoons ground ginger', '1\/2 teaspoon baking powder', '1 large egg', '3 tablespoons molasses', '3 tablespoons vegetable oil, plus more for cooking the pancakes']",
        "Instructions":"1. Preheat the oven to 200°F. Melt the butter in a large skillet over medium heat. Add the apples and cook, stirring occasionally, until tender, about 10 minutes. Stir in the brown sugar, 2 tablespoons water, the lemon juice, 1\/4 teaspoon cinnamon, and 1\/4 teaspoon salt. Cook until the mixture bubbles. Remove from the heat and stir in the vanilla; transfer to a serving dish and set aside.\n2. Meanwhile, in a small bowl stir together the flour, granulated sugar, ginger, remaining 1 teaspoon cinnamon, the baking powder, and remaining 1\/4 teaspoon salt in a small bowl. Combine 1\/4 cup water, the egg, molasses, and 3 tablespoons oil in a glass measuring cup; add to the flour mixture and stir with a fork until the mixture is just combined but not smooth. Add additional water if necessary to reach the consistency of pancake batter.\n3. Brush a nonstick skillet with a little oil; heat over medium-low heat. Add the gingerbread mixture to the skillet a generous tablespoonful at a time and spread to make a 2 1\/2-inch round; cook until lightly browned, about 3 minutes. Turn and brown on the other side, 3 to 4 minutes. Repeat until all the batter has been used. Keep the pancakes warm in the oven until all have been cooked.\n4. To serve, divide the pancakes among dessert plates and top each serving with some of the apples.",
        "Image_Name":"gingerbread-pancakes-with-butterscotch-apples-355874"
    },
    {
        "Title":"Cornbread Stuffing with Andouille, Fennel, and Bell Peppers",
        "Ingredients":"['1 1\/2 pounds purchased cornbread, cut into 1-inch cubes', '5 tablespoons butter, divided', '12 ounces fully cooked andouille sausages (about 4), halved lengthwise, then cut crosswise into 1\/2-inch-wide pieces', '1 medium fennel bulb, trimmed, cutinto 1\/2-inch cubes', '1 medium onion, cut into 1\/2-inch pieces', '1 medium red bell pepper, cut into 1\/2-inch pieces', '2 tablespoons chopped fresh thyme', '1\/4 teaspoon coarse kosher salt plus additional for sprinkling', '1\/8 teaspoon freshly ground black pepper plus additional for sprinkling', '2 cups low-salt chicken broth', '1 large egg']",
        "Instructions":"Position rack in center of oven; preheat to 350°F. Spread cornbread in single layer on large baking sheet. Bake until dry and lightly browned, 30 to 45 minutes. Let cool. DO AHEAD: Can be made 1 day ahead. Store in airtight container at room temperature.\nMelt 2 tablespoons butter in heavy large skillet over medium-high heat. Add sausage pieces; sauté until brown, about 4 minutes. Transfer sausage to large bowl.\nMelt remaining 3 tablespoons butter in same skillet over medium-high heat. Add fennel, onion, and bell pepper; sprinkle with coarse salt and pepper. Sautéuntil onion is golden, 10 to 12 minutes. Add to bowl with sausage.\nPreheat oven to 350°F. Add cornbread, thyme, 1\/4 teaspoon salt, and 1\/8 teaspoon pepper to vegetable-sausage mixture; mix gently. Whisk 2 cups broth and egg in medium bowl. Add broth mixture to cornbread mixture and toss. Transfer mixture to 13x9x2-inch glass baking dish.\nBake stuffing uncovered until crisp on top, about 1 hour. Let stand 15 minutes.",
        "Image_Name":"cornbread-stuffing-with-andouille-fennel-and-bell-peppers-355797"
    },
    {
        "Title":"Cornbread with Bacon Crust",
        "Ingredients":"['10 thick-cut bacon slices', '1 1\/2 cups medium-grind cornmeal', '1 1\/2 cups all purpose flour', '3 tablespoons golden brown sugar', '1 tablespoon baking powder', '1 teaspoon salt', '1 2\/3 cups whole milk', '3 large eggs', '3 tablespoons honey or agave syrup', '2 tablespoons unsalted butter, melted', '2 cups frozen corn kernels (unthawed)']",
        "Instructions":"Cook bacon in large skillet over medium heat until crisp. Drain on paper towels. Reserve 2 tablespoons drippings from skillet. Crumble bacon into small pieces.\nPreheat oven to 350°F. Coat 12-inch diameter ovenproof skillet with bacon drippings. Whisk cornmeal and next 4 ingredients in large bowl. Whisk milk, eggs, honey, and butter in medium bowl. Stir milk mixture into dry ingredients. Mix in corn.\nPlace prepared skillet in oven until very hot, about 10 minutes. Pour batter into skillet. Sprinkle bacon over. Bake cornbread until golden and tester inserted into center comes out clean, about 50 minutes. Cool in skillet at least 30 minutes. Serve cornbread directly from skillet. DO AHEAD: Can be made 8 hours ahead. If desired, rewarm uncovered in 350°F oven 10 to 15 minutes.",
        "Image_Name":"cornbread-with-bacon-crust-355804"
    },
    {
        "Title":"Thyme, Lemon, and Sea-Salt Shortbread",
        "Ingredients":"['1 3\/4 cups all-purpose flour', '1\/4 teaspoon salt', '1 tablespoon freshly grated lemon zest', '1 1\/2 teaspoons finely chopped fresh thyme', '1\/2 cup (1 stick) unsalted butter at room temperature', '1 large egg, lightly beaten', '2 large egg yolks', '2 teaspoons water', '1 tablespoon coarse sea salt']",
        "Instructions":"Stir the flour, salt, lemon peel, and thyme together in a medium bowl. With your fingertips, rub the butter into the dry ingredients until a coarse, crumbly mixture forms. Blend the lightly beaten egg, egg yolks, and water together. Reserve 1 tablespoon of the egg mixture for brushing.\nMake a well in the center of the flour. Add the remaining egg mixture and blend together with your hands without kneading the dough together; the dough will look a bit crumbly. Turn the dough out onto a lightly floured work surface. Knead the dough together once or twice, just until it sticks together. Press the dough into a 1-inch disc, wrap in plastic film, and refrigerate until firm, about 1\/2 hour.\nPreheat the oven to 350°F and line the bottom of a baking sheet with parchment paper or a nonstick baking mat. Remove the dough from the refrigerator, unwrap, and place it on a floured work surface. Press the dough into a 6-by-5-inch rectangle. With a rolling pin, roll the dough into a larger 10-by-7-inch rectangle, about 1\/4 inch thick. Cut the dough in half, forming two 5-by-7-inch pieces. Using a pizza wheel or sharp paring knife, cut into 1\/2-inch-wide strips. Carefully place the cookies on the prepared baking sheet leaving a little room between each cookie. Brush the tops with the reserved egg mixture and sprinkle a little coarse sea salt on top. Gently press the salt into the surface of each cookie so it does not fall off. Bake until lightly browned, about 20 minutes. Transfer to a cooling rack and serve warm or at room temperature. Store the cookies in an airtight container at room temperature for up to 1 week.",
        "Image_Name":"thyme-lemon-and-sea-salt-shortbread-355392"
    },
    {
        "Title":"Spiced Pear Flatbreads with Goat Cheese and Mustard Cream",
        "Ingredients":"['6 tablespoons heavy whipping cream', '3 tablespoons whole grain Dijon mustard', '1 1\/2 tablespoons Dijon mustard', '1 tablespoon fresh lemon juice', '1\/2 teaspoon honey or agave syrup', '2 1\/4 cups bread flour', '1 cup plus 7 tablespoons warm water (115°F to 120°F)', '3\/4 cup all purpose flour', '1\/3 cup whole wheat flour', '2 tablespoons olive oil', '2 teaspoons fine sea salt', '1\/2 teaspoon honey', '1\/4 teaspoon quick-rising active dry yeast', '2 firm but ripe Bosc pears, halved lengthwise, cored', 'Olive oil', \"Coarsely ground piment d'Espelette, Aleppo pepper, or cayenne pepper\", 'Fine sea salt', '5 cups baby arugula (about 4 ounces)', '8 ounces coarsely crumbled blue goat cheese (such as Bleuet or FireFly Farms Black and Blue)', 'pizza stone']",
        "Instructions":"Whisk all ingredients in small bowl. Season with salt and pepper. DO AHEAD: Can be made 1 day ahead. Cover; chill. Bring to room temperature before using.\nCombine all ingredients in bowl of heavy-duty mixer fitted with dough hook. Beat at low speed until dough forms and comes away from sides of bowl, about 2 minutes. Scrape dough off hook. Cover bowl with plastic wrap. Let dough rest 30 minutes.\nClean and reattach dough hook. Beat dough at medium speed 3 minutes. Scrape dough on hook into bowl. Cover bowl with plastic and towel. Let dough rise until light and slightly puffed, about 1 hour. Gently knead dough to deflate. Using floured hands, divide sticky dough into 4 equal pieces. Shape each into ball; place on plastic-lined baking sheet. Cover and chill at least 45 minutes. DO AHEAD: Can be made 8 hours ahead. Keep chilled. Bring to room temperature before using.\nCut pear halves vertically into very scant 1\/4-inch-thick slices. Brush both sides with oil, then sprinkle with Espelette pepper. Arrange on sheet of foil. If using pizza stone, place in oven. (Alternatively, place heavy large baking sheet, upside down, in oven.) Preheat oven to 500°F for at least 45 minutes.\nStretch and roll each dough ball to 9-inch round on lightly floured work surface. Place 1 dough round on floured pizza peel or rimless baking sheet. Brush dough with oil; sprinkle with sea salt and Espelette pepper. Scatter 1\/4 of arugula over. Drizzle lightly with oil. Top with pear slices and 1\/4 of cheese.\nSlide flatbread onto hot pizza stone or baking sheet. Bake until crust is golden brown and crisp and cheese is melted, rotating occasionally, 10 to 11 minutes. Repeat with remaining flatbreads. Transfer flatbreads to plates. Drizzle with mustard cream and serve.",
        "Image_Name":"spiced-pear-flatbreads-with-goat-cheese-and-mustard-cream-354834"
    },
    {
        "Title":"Gingerbread Bars",
        "Ingredients":"['2 cups all purpose flour', '2 teaspoons ground ginger', '1 teaspoon ground cinnamon', '1\/4 teaspoon ground nutmeg', '1\/4 teaspoon ground cloves', '1\/2 teaspoon baking soda', '1\/2 teaspoon salt', '10 tablespoons (1 1\/4 sticks) unsalted butter, room temperature', '3\/4 cup (packed) dark brown sugar', '7 1\/2 tablespoons sugar, divided', '2 large eggs', '1\/4 cup light (unsulfured) molasses']",
        "Instructions":"Preheat oven to 350°F. Butter and flour 15x10x1-inch baking sheet. Place 2 cups flour in medium bowl; transfer 2 tablespoons flour to small bowl and reserve. Add spices, baking soda, and salt to flour in medium bowl; whisk to blend. Using electric mixer, beat butter, brown sugar, and 6 tablespoons sugar in large bowl until fluffy. Beat in eggs, 1 at a time, then molasses. Add dry ingredients to butter mixture and beat to blend. Spread batter evenly in prepared pan. Sift reserved 2 tablespoons flour evenly over batter, then sprinkle evenly with remaining 1 1\/2 tablespoons sugar.\nBake gingerbread until golden brown and tester inserted into center comes out clean, about 22 minutes; cool completely in pan on rack. Cut gingerbread crosswise into 4 strips, then cut each strip into 6 pieces, forming 24 bars, each about 31\/2x13\/4 inches. DO AHEAD: _Can be made 2 days ahead._Store airtight at room temperature.",
        "Image_Name":"gingerbread-bars-353838"
    },
    {
        "Title":"Coconut-Lime Bars with Hazelnut Shortbread Crust",
        "Ingredients":"['1 cup hazelnuts, toasted , husked', '1\/4 cup sugar', '1 1\/4 cups all purpose flour', '1\/4 teaspoon salt', '13 tablespoons (1 1\/2 sticks plus 1 tablespoon) chilled unsalted butter, cut into 1\/2-inch cubes', '2 cups plus 2 tablespoons sugar', '5 large eggs', '3\/4 cup fresh lime juice (from about 8 large limes)', '1\/3 cup all purpose flour', '1 tablespoon finely grated lime peel', '3\/4 cup (packed) sweetened flaked coconut (about 3 ounces)']",
        "Instructions":"Position rack in center of oven and preheat to 350°F. Blend nuts and sugar in processor until nuts are finely ground. Add flour and salt; blend 5 seconds. Add butter and process until well blended. Press dough evenly onto bottom of 13 x 9 x 2-inch metal baking pan. Bake crust until golden brown, about 28 minutes; cool completely in pan on rack. Maintain oven temperature.\nWhisk sugar and eggs in large bowl until well blended, scraping down sides of bowl occasionally. Whisk in lime juice, then flour and lime peel. Pour filling over crust in pan.\nBake lime bars 25 minutes (filling will not be fully set). Sprinkle coconut evenly over. Bake until filling is completely set, about 10 minutes longer.\nCool bars in pan on rack. Chill uncovered until cold, at least 2 hours. DO AHEAD: Can be made 1 day ahead. Cover and keep chilled.\nCut around pan sides to loosen bars; cut into 24 pieces. Using small spatula, transfer bars to platter; serve chilled.",
        "Image_Name":"coconut-lime-bars-with-hazelnut-shortbread-crust-353820"
    },
    {
        "Title":"Broccoli Cheddar Cornbread",
        "Ingredients":"['1\/2 cup unsalted butter', '1 medium onion, chopped', '2 garlic cloves, minced', 'One 10-ounce package frozen chopped broccoli, thawed but not drained (or see headnote)', 'Two 8 1\/2-ounce boxes cornbread mix', '1\/2 cup whole milk', 'One 8-ounce container cottage cheese', '4 large eggs', '1 tablespoon salt', '1 cup plus 2 tablespoons grated sharp cheddar cheese, for topping']",
        "Instructions":"Preheat the oven to 375°F.\nHeat the butter in a 10-inch cast-iron skillet over medium high heat. Add the onion, and sauté until softened, 4 to 5 minutes. Add the garlic and broccoli to the skillet, and sauté for 2 minutes, until the garlic is fragrant and the broccoli has warmed through. In a medium bowl, stir together the cornbread mix, milk, cottage cheese, eggs, salt, and 1 cup of the cheddar cheese until smooth, then pour the batter into the skillet over the vegetables and stir to blend. Sprinkle the top of the batter with the remaining cheese. Bake the cornbread in the skillet for about 30 minutes, until it is lightly golden and a toothpick inserted in the center comes out clean. Cool for 5 to 10 minutes, then serve.",
        "Image_Name":"broccoli-cheddar-cornbread-353272"
    },
    {
        "Title":"Grilled Flatbreads with Caramelized Onions, Sausage, and Manchego Cheese",
        "Ingredients":"['2 tablespoons vegetable oil', '2 large red onions (1 1\/2 to 1 3\/4 pounds), halved, thinly sliced', '1\/2 cup dry red wine (such as Zinfandel)', '2 tablespoons balsamic vinegar', '1 teaspoon sugar', '3\/4 pound sweet Italian sausages (about 4 links), casings removed', 'Pizza Dough Rounds or 1 pound purchased fresh pizza dough', 'Nonstick olive oil spray', '2 cups (packed) coarsely shredded Manchego cheese,* divided']",
        "Instructions":"Heat vegetable oil in heavy large pot over medium-high heat. Add onions and sauté until soft and deep golden brown, stirring often, about 10 minutes. Stir in wine, vinegar, and sugar. Reduce heat to low and simmer until almost all liquid is absorbed, stirring often, 3 to 4 minutes. Season to taste with salt and pepper. Transfer to small bowl. Cool.\nHeat medium skillet over medium heat. Add sausage; sauté until cooked through and browned, breaking up with back of fork, 5 to 6 minutes. Transfer to small bowl. Cool. DO AHEAD: Onions and sausage can be made 1 day ahead. Cover separately; chill. Bring to room temperature before using.\nPrepare barbecue (medium-high heat). Lightly flour 2 rimless baking sheets. Divide purchased pizza dough in half (if using). Working with 1 dough round or dough half at a time, roll out on lightly floured surface to 12x8-inch oval. Transfer to baking sheets. Spray top of flatbreads with nonstick spray.\nInvert flatbreads, sprayed side down, onto grill. Cook until grill marks appear and sides of bread are dry, 3 to 5 minutes. Return to same baking sheets, grilled side down. Spray uncooked side with nonstick spray. Turn flatbreads over on baking sheets, grilled side up. Sprinkle 3\/4 cup cheese over each flatbread. Sprinkle onions, then sausage, over flatbreads, dividing equally. Sprinkle remaining 1\/2 cup cheese over, dividing equally. DO AHEAD: Can be made 2 hours ahead. Let stand at room temperature.\nTransfer flatbreads, topping side up, to grill. Cover and cook until crusts are crisp and cheese melts, 3 to 5 minutes. Transfer to work surface. Cut into rectangles and serve.\nA Spanish cheese made from sheep's milk; sold at some supermarkets and at specialty foods stores.",
        "Image_Name":"grilled-flatbreads-with-caramelized-onions-sausage-and-manchego-cheese-353389"
    },
    {
        "Title":"Wheat Biscuit Shortbread",
        "Ingredients":"['2 sticks unsalted butter, at room temperature', '2\/3 cup granulated sugar', '2 teaspoons vanilla extract', '1\/2 teaspoon fine salt', '1 1\/4 cups unbleached all-purpose flour', '1 cup white whole-wheat flour', '8 ounces semisweet chocolate']",
        "Instructions":"Arrange the racks in upper and lower thirds of the oven and preheat the oven to 325°F. Line 2 large cookie sheets and with parchment paper or silicone sheets.\nIn a large bowl, combine the butter, sugar, vanilla and salt at medium-low speed just until smooth. Add the flours and mix until just blended. Divide the dough in half and then shape, without over handling, into 2 disks.\nOn a lightly floured surface, roll 1 piece of dough out into a 13-inch, 1\/4-inch-thick square. Using a ruler and a fluted pastry wheel or a large knife, trim the edges and cut into 2- by 1-inch rectangles. Transfer the cookies to the baking sheets, spacing 1 1\/2 inches apart. Reroll the scraps and repeat with the remaining dough. Mark each cookie several times with tines of a fork and then chill the pans in the refrigerator for 10 minutes. Bake cookies for about 17 minutes, until golden and nearly firm in center. Let cool for 5 minutes on baking sheets and transfer to racks to cool completely.\nFinely chop semisweet chocolate. Place half of the chocolate in a heatproof bowl set over a saucepan with 1 inch of simmering water and stir until the chocolate is melted and smooth. Add the remaining chocolate to the bowl; remove the bowl from the pot and place on a folded towel. Stir occasionally until chocolate is smooth. Scrape the chocolate into a small bowl. Line a baking sheet with clean parchment or waxed paper. Dip the cookies halfway into the chocolate, let the excess drip off, and then place on the paper-lined sheet; let stand until set and dry, at least 1 hour.",
        "Image_Name":"wheat-biscuit-shortbread-243132"
    },
    {
        "Title":"Algerian Flatbread",
        "Ingredients":"['3 cups finely ground whole-wheat flour (preferably Indian atta or King Arthur whole-wheat)', '1 teaspoon salt', '1\/2 cup olive oil, divided', '1 1\/2 cups water', '1 teaspoon ground cumin', '1 teaspoon sweet paprika', '1 teaspoon turmeric']",
        "Instructions":"Stir together flour, salt, and 2 tablespoons oil in a large bowl. Slowly stir in water until a soft dough forms. If necessary, add more water 1 tablespoon at a time. Turn out dough onto a lightly floured surface and knead, dusting with just enough flour to keep dough from sticking, until smooth and elastic, about 15 minutes.\nForm dough into a ball and coat with 2 tablespoons oil in a bowl. Cover bowl with plastic wrap and let dough stand at warm room temperature 1 hour.\nStir together cumin, paprika, turmeric, and remaining 1\/4 cup oil in a small bowl.\nDivide dough into 12 equal pieces and, keeping remaining pieces covered with plastic wrap, flatten 1 piece of dough into a disk. Roll out disk as thinly as possible (into a 9-inch round) on a lightly floured surface with a 6-inch wooden dowel or a rolling pin. Spread 1 teaspoon spiced oil on dough with your fingertips, then roll up tightly into a long cylinder and coil into a tight spiral. Transfer to a large sheet of parchment paper, then loosely cover with plastic wrap.\nMake 11 more spirals in same manner.\nTape another sheet of parchment to a work surface and on it roll out 1 spiral of dough into a round approximately 6 inches in diameter. Heat a dry large cast-iron skillet or griddle over medium heat until hot, then cook flatbread, turning once, until puffed and browned in spots, 3 to 4 minutes total. Transfer to a plate and cover with a kitchen towel. Roll out and cook 11 more flatbreads, stacking them on plate.\nCape Mentelle Margaret River Chardonnay '05",
        "Image_Name":"algerian-flatbread-241505"
    },
    {
        "Title":"Flatbread with Shrimp and White Bean Hummus",
        "Ingredients":"['1 1\/4 cups warm water (105°F to 115°F)', '1 teaspoon active dry yeast', '1 teaspoon sugar', '3 cups all-purpose flour', '1 1\/2 teaspoons kosher salt', '2 tablespoons extra-virgin olive oil', '5 to 6 garlic cloves, unpeeled', '1 tablespoon extra-virgin olive oil', '1 1\/8 teaspoons kosher salt', '1 (15-ounce) can white beans, rinsed and drained', '2 tablespoons white vinegar', '2 teaspoons fresh lemon juice', '1 tablespoon tahini', '1 teaspoon fresh rosemary, finely chopped', '2 teaspoons unsalted butter', '2 medium Spanish onions, cut into medium dice', '1 1\/2 teaspoons sugar', '1\/4 teaspoon kosher salt', '1\/4 teaspoon freshly ground black pepper', '2 tablespoons extra-virgin olive oil', '4 leeks, white and light green parts only, washed and cut into medium dice', '1\/4 teaspoon kosher salt', '1\/4 teaspoon freshly ground black pepper', '1 tablespoon extra-virgin olive oil for brushing flatbread', '1 lemon, halved lengthwise and very thinly sliced', '1 pound small, sweet shrimp such as Caribbean Laughing Bird*, peeled and cooked', '6 ounces Grana Padano or Parmigiano-Reggiano cheese, finely grated (about 1 ½ cups)', '3\/4 teaspoon kosher salt', '1 1\/2 teaspoons fresh lemon juice', '3\/4 cup mixed micro greens, such as baby arugula', \"*Small and full of flavor, Caribbean Laughing Bird shrimp are sustainably raised off the coast of Belize. If they're unavailable, you can substitute rock shrimp, which are similar in flavor, though not as environmentally friendly. Alternatively, use any sweet shrimp, cut into pieces if large.\", 'stand mixer with paddle attachment and dough hook, pasta machine or rolling pin, pizza stone or heavy baking sheet, food processor']",
        "Instructions":"In bowl of stand mixer fitted with paddle attachment, stir together water, yeast, and sugar until dissolved, about 5 seconds. Let stand until foamy, about 5 minutes. In large bowl, whisk together flour and salt. Add to yeast mixture and mix on low speed until just combined, about 30 seconds. Add oil and mix on low speed until just combined, about 30 seconds. Switch to dough hook and mix on medium speed until dough is elastic and pulls away from sides, about 8 minutes. (Dough should feel firm and moist, but not sticky.)\nLightly oil large bowl. Gently shape dough into ball and transfer to bowl. Turn over several times to coat lightly with oil, then cover with plastic wrap and let rise in warm place (80°F to 85°F, see Chef's Notes) until doubled in size, about 1 hour.\nWhile dough is rising, position rack near bottom of oven and top with pizza stone or heavy baking sheet. Preheat oven to 450°F for 1 hour.\nSet smooth rollers of pasta machine on widest setting (see Chef's Notes). Divide dough into 6 equal parts. Cover 5 parts with plastic wrap. Shape remaining piece into rough rectangle and feed through rollers once to flatten into roughly 12-by 4-inch rectangle, approximately 1\/8-inch thick. Transfer flatbread to large baking sheet, dust with flour, and top with sheet of parchment paper. Roll out remaining flatbreads in same manner, stacking between layers of parchment paper. Cover with plastic wrap until ready to bake.\nTransfer 1 or more flatbreads to preheated pizza stone and bake in batches until slightly puffed but still pale, about 5 minutes. Transfer to wire rack to cool completely. Leave oven on. DO AHEAD: Flatbreads can be prepared ahead and frozen, wrapped tightly in parchment paper and plastic wrap, up to 6 months.\nTransfer garlic cloves to 6-inch square of foil, drizzle with 1 teaspoon olive oil, sprinkle with 1\/8 teaspoon salt, and wrap tightly. Bake until tender, about 45 minutes. Unwrap and let cool. DO AHEAD: Roasted garlic can be prepared ahead and refrigerated, in airtight container, up to 3 days.\nSqueeze garlic cloves from skin into food processor. Add white beans, remaining 2 teaspoons olive oil, vinegar, lemon juice, tahini, rosemary, and remaining 1 teaspoon salt and purée until smooth, about 2 minutes. DO AHEAD: Hummus can be prepared ahead and refrigerated in airtight container up to 3 days.\nIn large, heavy saucepan over moderately low heat, melt butter. Add onions and sauté, stirring occasionally, until slightly transparent and starting to soften, about 2 minutes. Add sugar and 4 teaspoons water and sauté, stirring occasionally, until golden brown, 12 minutes. Stir in salt and pepper, then transfer to medium bowl to cool. DO AHEAD: Onions can be prepared ahead and refrigerated, in airtight container, up to 3 days.\nIn large, heavy saucepan over moderate heat, heat olive oil. Add leeks and sauté, stirring occasionally, until soft and translucent, about 8 minutes. Stir in salt and pepper, then transfer to medium bowl to cool. DO AHEAD: Leeks can be prepared ahead and refrigerated, in airtight container, up to 3 days.\nPosition rack near bottom of oven and top with pizza stone or heavy baking sheet. Preheat oven to 450°F for 1 hour.\nBrush each flatbread with olive oil and spread with hummus. Scatter onions and leeks over and top with lemon slices and shrimp. Scatter with cheese, then sprinkle with salt and lemon juice.\nTransfer 1 or more flatbreads to preheated pizza stone and bake in batches until toppings are warmed through and cheese has melted, 6 to 8 minutes.\nTransfer flatbreads to large cutting board and top with micro greens. Using very sharp knife, cut into 6 thin slices and serve immediately.",
        "Image_Name":"flatbread-with-shrimp-and-white-bean-hummus-351889"
    },
    {
        "Title":"Flatbread with Fingerling Potatoes, Shitake Mushrooms, and Truffle Oil",
        "Ingredients":"['1 cup warm water (105 to115° F)', '1 1\/4 teaspoons active dry yeast', '1 teaspoon sugar', '1 tablespoon plus 1 teaspoon dry milk powder', '1 3\/4 cups all-purpose flour', '1\/2 teaspoon kosher salt', '4 (approximately 1-inch-wide and 3-inch-long) fingerling potatoes', '4 sprigs fresh thyme plus 2 teaspoons fresh thyme leaves', '1 clove garlic, peeled and smashed with back of knife', '2 1\/2 teaspoons kosher salt', '1 tablespoon canola oil', '1 tablespoon unsalted butter', '2 cups (4 ounces) fresh shiitake mushrooms, stemmed and thinly sliced', '1\/4 cup shallots, minced (from 2 medium shallots)', '3\/4 teaspoons freshly ground black pepper', '2 teaspoons extra-virgin olive oil', '1\/4 cup white truffle oil', '1\/2 cup crème fraîche', '2 tablespoons fresh chives, minced', 'stand mixer fitted with paddle attachment and dough hook, heavy baking sheet']",
        "Instructions":"In bowl of stand mixer fitted with paddle attachment, stir together water, yeast, and sugar until dissolved, about 5 seconds. Stir in milk powder until dissolved, about 5 seconds.\nIn large bowl, whisk together flour and salt. Add to yeast mixture and mix on low speed until just combined, about 30 seconds. Switch to dough hook and mix on medium speed until dough is elastic but still sticky, about 10 minutes.\nUsing vegetable oil, lightly oil large bowl. Gently shape dough into ball and transfer to bowl. Turn over several times to coat lightly with oil, then cover with plastic wrap and let rise in warm place (75°F to 80°F, see Chef's Notes) until doubled in size, about 1 ½ hours.\nUsing vegetable oil, liberally oil heavy baking sheet. Using hands, lift dough from bowl and gently turn over several times to remove excess air. Shape into ball and transfer to prepared baking sheet. Cover with plastic wrap and let rise in warm place (75°F to 80°F, see Chef's Notes) 30 minutes.\nUsing fingertips, press and spread dough to edges of baking sheet. (If dough tears, mend hole by pressing surrounding dough together Cover with plastic wrap and let rise in warm place (75°F to 80°F, see Chef's Notes) until puffy, about 1 1\/2 hours.\nPreheat oven to 475°F.\nIn medium saucepan over moderately high heat, combine potatoes, 4 sprigs thyme, garlic, salt, and enough water to cover by 1 inch. Bring to boil, then reduce heat to moderately low and simmer, uncovered, until potatoes are easily pierced with fork, about 20 minutes. Immediately drain, discarding thyme sprigs and garlic. When cool enough to handle, slice potatoes into 1\/4-inch-thick rounds and reserve. (Potatoes can be prepared ahead and refrigerated, covered, up to 24 hours.)\nIn medium sauté pan over moderately high heat, heat canola oil and butter until hot but not smoking. Add mushrooms and sauté 1 minute. Add shallots and sauté until light golden brown and soft, about 2 minutes. Stir in 1\/2 teaspoon salt and 1\/4 teaspoon pepper, then transfer to paper-towel-lined plate and reserve. (Mushrooms can be prepared ahead and refrigerated, covered, up to 24 hours.)\nArrange potato slices on flatbread, then brush with olive oil and sprinkle with thyme leaves. Spread mushroom mixture on top, then drizzle with 2 tablespoons white truffle oil and sprinkle with 1 teaspoon salt and 1\/2 teaspoon pepper. Bake, rotating pan 180 degrees halfway through, until crust is light golden brown, 20 to 22 minutes.\nWhile flatbread bakes, in small bowl, whisk together crème fraîche and remaining 2 tablespoons truffle oil.\nTransfer flatbread to large cutting board and let cool about 5 minutes. Drizzle with truffle oil–infused crème fraˆhe and sprinkle with chives. Using pizza wheel or very sharp knife, cut into slices and serve immediately.",
        "Image_Name":"flatbread-with-fingerling-potatoes-shitake-mushrooms-and-truffle-oil-351233"
    },
    {
        "Title":"Beet Salad with Cornbread Croutons and Country Ham",
        "Ingredients":"['3\/4 cup water', '6 tablespoons butter, melted', '6 large fresh thyme sprigs', '1 1\/2 teaspoons coarse kosher salt', '1 1\/2 teaspoons cracked black pepper', '1 bay leaf', '8 1 1\/2-inch-diameter baby beets (preferably assorted colors), trimmed', '1 cup medium-grind cornmeal', '1\/3 cup White Lily all purpose flour or cake flour', '11\/2 teaspoons coarse kosher salt', '1 teaspoon baking powder', '1\/4 teaspoon baking soda', '6 tablespoons (3\/4 stick) butter, divided', '1 cup buttermilk', '1 large egg', 'Peel from 1 orange (orange part only), cut into thin 2-inch-long strips', 'Peel from 1 lemon (yellow part only), cut into thin 2-inch-long strips', '1\/2 cup fresh orange juice', '1\/2 cup fresh grapefruit juice', '2 tablespoons sorghum syrup* or honey', '1\/4 cup fresh lemon juice', '2 teaspoons Dijon mustard', '6 tablespoons peanut oil', '3 small sweet onions (such as Vidalia or Maui; about 1 pound), cut crosswise into 1\/2-inch-thick slices', 'Olive oil', 'Coarse kosher salt', 'Nonstick vegetable oil spray', '3 ounces very thinly sliced country ham or prosciutto', '4 teaspoons minced plus 1 tablespoon chopped fresh Italian parsley', 'Fleur de sel**', 'Cracked black peppercorns', '1 5-ounce log soft fresh goat cheese, crumbled', 'Aged balsamic vinegar']",
        "Instructions":"Preheat oven to 350°F. Mix first 6 ingredients in 13x9x2-inch glass baking dish. Add beets and toss to coat. Cover with foil and roast until beets are tender, about 45 minutes. Cool; peel.\nPlace 9- or 10-inch-diameter cast-iron skillet in oven; preheat to 400°F. Whisk first 5 ingredients in medium bowl. Melt 4 tablespoons butter. Whisk melted butter, buttermilk, and egg in another medium bowl. Add wet ingredients to dry ingredients; whisk batter to blend. Place 2 tablespoons butter in hot skillet; swirl to coat. Add batter. Bake until top is golden and tester inserted into center comes out clean, 18 to 20 minutes. Cool in skillet. DO AHEAD: Can be made 1 day ahead. Cover; store at room temperature.\nAdd enough water to small saucepan to measure 11\/2 inches; bring to boil. Add orange peel. Blanch 1 minute; drain. Repeat blanching procedure with lemon peel; reserve lemon peel for serving. Return orange peel to same pan and add orange juice, grapefruit juice, and sorghum syrup. Bring to boil, reduce heat to medium-low, and simmer until reduced to generous 1\/3 cup, about 20 minutes. Whisk lemon juice and mustard in medium bowl; whisk in oil. Whisk in orange-grapefruit reduction. Season vinaigrette with salt and pepper. DO AHEAD: Can be made 4 hours ahead. Let stand at room temperature.\nPreheat broiler. Line small baking sheet with foil. Place onion slices with rings intact on sheet. Brush with oil; sprinkle with coarse salt. Broil onions until browned, watching closely to prevent burning, about 10 minutes. Turn and broil until browned, about 5 minutes longer.\nReduce oven temperature to 375°F. Cut cornbread into 1\/2-inch cubes. Spray rimmed baking sheet with nonstick spray. Spread cornbread in even layer on prepared sheet. Toast until golden brown around edges, turning occasionally, about 35 minutes.\nReduce oven temperature to 350°F. Line rimmed baking sheet with parchment paper. Arrange ham in single layer on prepared baking sheet. Top with another sheet of parchment paper, then another rimmed baking sheet to press ham. Roast until ham is crisp, 10 to 20 minutes, depending on thickness of ham. Remove top baking sheet and parchment paper. Cool. Break ham into bite-size pieces.\nWhisk 4 teaspoons minced parsley into vinaigrette. Mix in reserved lemon peel. Quarter beets. Toss with some of vinaigrette (if using assorted colors, toss in separate bowls). Sprinkle with fleur de sel and cracked black pepper. Separate onion rings. Divide rings among plates in single layer. Arrange beets in and around onion rings. Sprinkle goat cheese over. Scatter ham and croutons over. Sprinkle fleur de sel and 1 tablespoon chopped parsley over. Drizzle with some of remaining vinaigrette and aged balsamic vinegar.\nA syrup made from the cooked juice of sorghum cane; available at specialty foods stores and at muddypondsorghum.com.\n** A type of sea salt; available at some supermarkets and at specialty foods stores.",
        "Image_Name":"beet-salad-with-cornbread-croutons-and-country-ham-351043"
    },
    {
        "Title":"Cornbread Stuffing Muffins with Ham and Sage",
        "Ingredients":"['10 cups 1\/2-inch cubes Cornbread for Dressing', '4 cups 1\/2-inch cubes crustless firm white sandwich bread (from 6 to 7 slices)', '1\/2 cup (1 stick) butter', '2 cups thinly sliced leeks (white and pale green parts only; about 3)', '2 cups chopped celery', '1 1\/4 cups finely chopped smoked ham (about 7 ounces)', '1\/4 cup chopped fresh parsley', '4 teaspoons chopped fresh thyme', '4 teaspoons dried rubbed sage', '1 teaspoon coarse kosher salt', '1 teaspoon freshly ground black pepper', '4 large eggs, beaten to blend', '2 cups low-salt chicken broth']",
        "Instructions":"Preheat oven to 350°F. Generously butter twelve 1\/3-cup nonstick muffin cups. Divide cornbread cubes and white bread cubes between 2 rimmed baking sheets. Dry slightly in oven, about 5 minutes. Cool. Transfer to large bowl.\nMelt butter in large skillet over medium heat. Add leeks and celery; cook until soft, stirring often, about 10 minutes. Add ham; stir 1 minute. Add all herbs, 1 teaspoon coarse salt, and 1 teaspoon pepper; stir to blend. Add vegetable mixture to bread; toss. Add eggs and broth; toss. Let stand 5 minutes; toss again. Spoon about 1\/2 cup stuffing mixture into each muffin cup. Press to compact. Mound about 1\/2 cup remaining stuffing mixture over stuffing in each muffin cup, pressing to hold shape.\nBake muffins until golden, about 22 minutes. Cool in pan 15 minutes. Using small plastic knife, loosen muffins. Transfer to rack; cool.\nDO AHEAD: Can be made 1 day ahead. Cool, cover, and chill. Rewarm uncovered in microwave in 30-second intervals, or covered loosely with foil in 350°F oven, about 15 minutes.",
        "Image_Name":"cornbread-stuffing-muffins-with-ham-and-sage-240385"
    },
    {
        "Title":"Gingerbread Angels",
        "Ingredients":"['6 cups all purpose flour', '1 tablespoon ground ginger', '1 tablespoon ground cinnamon', '2 teaspoons baking soda', '1 teaspoon salt', '1\/2 cup coarsely chopped crystallized ginger (about 3 ounces)', '1 cup (2 sticks) unsalted butter, room temperature', '1 cup sugar', '1\/2 cup (packed) golden brown sugar', '2 large eggs', '1\/4 cup mild-flavored (light) molasses', '1\/4 cup fresh orange juice', '2 teaspoons finely grated orange peel', '1 egg white, beaten with 1 tablespoon water (for glaze; optional)', 'Raw sugar and\/or colored sugar (optional)']",
        "Instructions":"Whisk flour, ground ginger, cinnamon, soda, and salt in large bowl. Place crystallized ginger in mini processor; add 1 tablespoon flour mixture and blend until ginger is very finely chopped. Using electric mixer, beat butter in another large bowl until smooth. Add 1 cup sugar and 1\/2 cup brown sugar; beat until light and fluffy. Beat in eggs, 1 at a time. Beat in molasses, orange juice, and orange peel (batter may look curdled). Beat in crystallized ginger mixture. Blend in remaining flour-spice mixture. Gather dough together. Flatten into disk. Wrap in plastic; chill at least 4 hours.\nPosition 1 rack in top third and 1 rack in bottom third of oven; preheat to 350°F. Line 2 baking sheets with parchment. Divide dough into 4 portions; shape each into round. Chill 3 rounds. Roll out remaining dough round on floured work surface to generous 1\/8-inch thickness. Using floured angel-shaped cookie cutter, cut out cookies. Gather dough scraps and reroll to generous 1\/8-inch thickness; cut out more cookies. Using spatula, transfer cookies to sheets, spacing 1 inch apart. Brush cookies with glaze, then sprinkle with raw sugar and\/or colored sugar, if desired.\nBake cookies until golden, reversing sheets after 7 minutes, about 14 minutes total. Let stand 2 minutes; transfer to racks to cool. Repeat with remaining dough, cooling baking sheets between batches. DO AHEAD: Can be made 1 week ahead. Store between sheets of waxed paper in airtight container.",
        "Image_Name":"gingerbread-angels-350818"
    },
    {
        "Title":"Cinnamon Pecan Shortbread",
        "Ingredients":"['2 cups all purpose flour', '1\/4 cup sugar', '1\/4 cup (packed) golden brown sugar', '1\/4 cup cornstarch', '1 1\/4 teaspoons ground cinnamon', '1\/4 teaspoon salt', '1 cup (2 sticks) unsalted butter, cut into 1\/2-inch cubes, room temperature', '1 large egg white, beaten to blend with 1 tablespoon water (for glaze)', '1 1\/2 cups chopped toasted pecans for wedges, or 36 pecan halves for round cookies', 'Raw sugar*']",
        "Instructions":"Whisk first 6 ingredients in large bowl to blend. Add butter. Mash with back of fork until coarse meal forms. Using fingertips, work dough until smooth; shape into disk. Wrap in plastic and chill until firm but not hard, about 30 minutes.\nPosition rack in center of oven; preheat to 325°F. For wedges, shape dough into 2 disks. Place on 2 heavy baking sheets; cover with plastic. Flatten to 10-inch rounds. Remove plastic. Brush with glaze. Sprinkle with chopped pecans, then raw sugar; press to adhere. For round cookies, shape dough into 1-inch balls; arrange on 2 heavy baking sheets, spacing 2 inches apart. Cover smooth-bottomed glass with plastic. Using glass, press each dough ball to 2-inch round. Cut with scalloped cookie cutter, if desired. Brush with glaze; top with pecan half and sprinkle with raw sugar.\nBake cookies, 1 sheet at a time, until golden, about 30 minutes for large rounds and 22 minutes for small rounds. Cool large rounds on sheets 10 minutes, then cut each into 16 wedges. Cool all cookies completely on sheets. DO AHEAD: Can be made 3 days ahead. Store airtight at room temperature.\n*Also called turbinado or demerara sugar; available at most supermarkets and at natural food stores.",
        "Image_Name":"cinnamon-pecan-shortbread-350831"
    },
    {
        "Title":"Chocolate-Coffee Gingerbread with Hazelnut Poached Pears",
        "Ingredients":"['1 3\/4 cups (packed) raw sugar or (packed) golden brown sugar', '1 1\/2 cups water', '1\/3 cup Frangelico (hazelnut liqueur)', '5 small firm but ripe pears, peeled, halved lengthwise, cored', 'Nonstick vegetable oil spray', '2 cups all purpose flour', '2 teaspoons baking soda', '1 teaspoon coarse kosher salt', '1 teaspoon ground cinnamon', '1 teaspoon ground cloves', '1 teaspoon ground ginger', '1 cup sugar', '1 cup robust-flavored (dark) molasses', '1 cup mild-flavored olive oil', '3 large eggs', '1 cup freshly brewed coffee', '1 cup chopped bittersweet (60% cocoa) chocolate (5 to 6 ounces)', '1\/4 cup chopped crystallized ginger', '1 cup chilled whipping cream', '3 tablespoons powdered sugar', '1 teaspoon instant coffee crystals']",
        "Instructions":"Combine sugar, 1 1\/2 cups water, and Frangelico in heavy large wide saucepan. Stir over medium heat until sugar dissolves. Bring to boil. Add pears (liquid will not cover pears completely). Cover and simmer until pears are tender when pierced with knife, turning occasionally, about 12 minutes. Using slotted spoon, transfer pears to medium bowl. Boil cooking liquid in pan until syrupy and reduced to generous 3\/4 cup, about 5 minutes. Pour syrup over pears and cool slightly. DO AHEAD: Can be made 1 day ahead. Cover and chill.\nPreheat oven to 350°F. Generously butter 12-cup nonstick Bundt pan, then spray with nonstick spray. Dust pan lightly with flour. Whisk 2 cups flour and next 5 ingredients in medium bowl to blend. Combine sugar, molasses, olive oil, and eggs in large bowl; whisk until well blended. Add dry ingredients and stir to blend. Mix in hot coffee, then chocolate and crystallized ginger (most of chocolate will melt). Transfer batter to prepared pan.\nBake cake until tester inserted near center comes out clean and cake begins to pull away from sides of pan, 55 to 60 minutes. Transfer pan to rack; cool cake in pan 20 minutes. Turn cake out onto rack and cool at least 1 hour. DO AHEAD: Can be made 1 day ahead. Cool completely. Cover with cake dome or wrap in foil and store at room temperature. If desired, uncover cake and place on oven-proof platter and rewarm in 350°F oven for 15 minutes before serving.\nCombine all ingredients in large bowl. Using electric mixer, beat until peaks form. DO AHEAD: Can be made 4 hours ahead. Cover and chill.\nCut warm or room-temperature gingerbread into 10 slices and transfer 1 slice to each of 10 plates. Place 1 pear half alongside each. Drizzle with pear syrup and top with coffee whipped cream.",
        "Image_Name":"chocolate-coffee-gingerbread-with-hazelnut-poached-pears-350813"
    },
    {
        "Title":"Gingerbread Trifle With Candied Kumquats and Wine-Poached Cranberries",
        "Ingredients":"['2 1\/2 cups sugar', '1 1\/2 cups water', '3 cups sliced seeded kumquats', '2 cups fruity red wine (such as Syrah)', '2 cups sugar', '12 ounces fresh or frozen cranberries', '1 cup extra stout (such as Guinness)', '1 cup mild-flavored (light) molasses', '1 1\/2 teaspoons baking soda', '2 cups all purpose flour', '2 tablespoons ground ginger', '1 1\/2 teaspoons baking powder', '3\/4 teaspoon ground cinnamon', '1\/4 teaspoon ground cloves', '1\/4 teaspoon ground nutmeg', '1\/8 teaspoon ground cardamom', '3 large eggs', '1\/2 cup sugar', '1\/2 cup (packed) dark brown sugar', '3\/4 cup vegetable oil', '1 tablespoon minced peeled fresh ginger', '3 8-ounce containers mascarpone cheese* (3 cups)', '3 cups chilled heavy whipping cream', '1 1\/2 cups powdered sugar', '3 tablespoons Grand Marnier or other orange liqueur', '4 teaspoons finely grated orange peel']",
        "Instructions":"Stir sugar and 1 1\/2 cups water in large saucepan over medium heat until sugar dissolves. Increase heat and bring to boil. Add kumquats; reduce heat to medium-low and simmer until soft mixture to medium bowl. Cool. Cover and chill until cold. DO AHEAD: Can be made 5 days ahead. Keep chilled.\nBefore using, pour kumquat mixture through strainer; set kumquats aside for trifle. (Reserve syrup for another use.)\nStir wine and sugar in large saucepan over medium heat until sugar dissolves. Increase heat and boil wine mixture 5 minutes. Add cranberries and simmer until soft but still intact, about 5 minutes. Transfer mixture to medium bowl. Cool. Cover and chill until cold. DO AHEAD: Can be made 5 days ahead. Keep chilled.\nBefore using, pour cranberry mixture through strainer; set cranberries aside for trifle. (Reserve syrup for another use.)\nCombine stout and molasses in large saucepan. Bring to boil over medium-high heat, stirring occasionally. Remove from heat; stir in baking soda (mixture will foam up). Let stand until completely cool, about 1 hour.\nPosition 1 rack in top third and 1 rack in bottom third of oven and preheat to 350°F. Generously butter three 8-inch-diameter cake pans with 1 1\/2-inch-high sides. Dust pans with flour; tap out excess. Whisk 2 cups flour and next 6 ingredients in large bowl to blend. Whisk eggs and both sugars in medium bowl to blend. Whisk oil, then stout mixture into egg mixture. Gradually whisk stout-egg mixture into flour mixture. Stir in fresh ginger. Divide batter among prepared pans (about 12\/3 cups for each).\nPlace 2 cake pans on top rack and 1 cake pan on bottom rack of oven. Bake until tester inserted into center of cakes comes out clean, reversing position of pans halfway through baking, about 28 minutes total. Cool cakes in pans on rack 15 minutes. Invert cakes onto racks; cool completely. DO AHEAD: Can be made 1 day ahead. Wrap in plastic; store at room temperature.\nUsing electric mixer, beat mascarpone in large bowl until smooth. Add all remaining ingredients and beat until peaks form and mixture is smooth (do not overbeat or mixture may curdle). Cover and chill up to 2 hours.\nUsing serrated knife, cut each of 2 cakes in half horizontally for a total of 4 cake layers. (Reserve remaining cake for another use.) Trim 1 cake layer to 7-inch round. Place trimmed cake round in bottom of 7 3\/4-inch-diameter, 43\/4-inch-deep trifle dish. Scatter scant 1\/2 cup drained kumquats in single layer over cake. Top with 11\/3 cups mascarpone cream, spreading evenly to sides of dish. Sprinkle 1\/2 cup drained cranberries over. Repeat 2 more times with cake layer, kumquats, mascarpone cream, and cranberries. Top with fourth cake layer. Spread 1 1\/3 cups mascarpone cream over. Spoon remaining cream into pastry bag fitted with large star tip. Pipe rosettes of mascarpone cream around top edge of dish. Tent loosely with foil; chill at least 4 hours. DO AHEAD: Can be made 1 day ahead. Keep chilled. Cover and chill remaining kumquats and cranberries separately.\nScatter remaining kumquats and cranberries over center of trifle and serve.\nAn Italian cream cheese; sold at many supermarkets and at Italian markets.",
        "Image_Name":"gingerbread-trifle-with-candied-kumquats-and-wine-poached-cranberries-350790"
    },
    {
        "Title":"Dark Gingerbread Pear Cake",
        "Ingredients":"['1 1\/2 cups all-purpose flour', '1 teaspoon baking soda', '1\/2 teaspoon cinnamon', '1\/8 teaspoon ground allspice', '1\/4 teaspoon salt', '1 stick unsalted butter', '1\/4 cup water', '1\/2 cup packed dark brown sugar', '1\/2 cup molasses (not robust or blackstrap)', '3 large eggs', '1\/4 cup grated peeled ginger', '1 Bosc pear', 'Accompaniment: whipped cream']",
        "Instructions":"Preheat oven to 350°F with rack in middle. Butter and flour a 9-inch cake pan, knocking out excess.\nWhisk together flour, baking soda, cinnamon, allspice, and salt.\nMelt butter with water.\nBeat together brown sugar and molasses with an electric mixer until combined. Add eggs 1 at a time, beating well. Beat in flour mixture at low speed until just combined. Add butter mixture and ginger, beating just until smooth. Pour into cake pan.\nPeel pear and cut into 3\/4-inch pieces. Scatter over batter. Bake until a wooden pick inserted into center comes out clean, about 35 minutes. Cool slightly.",
        "Image_Name":"dark-gingerbread-pear-cake-350222"
    },
    {
        "Title":"Crisp Rosemary Flatbread",
        "Ingredients":"['1 3\/4 cups unbleached all-purpose flour', '1 tablespoon chopped rosemary plus 2 (6-inch) sprigs', '1 teaspoon baking powder', '3\/4 teaspoon salt', '1\/2 cup water', '1\/3 cup olive oil plus more for brushing', 'Flaky sea salt such as Maldon']",
        "Instructions":"Preheat oven to 450°F with a heavy baking sheet on rack in middle.\nStir together flour, chopped rosemary, baking powder, and salt in a medium bowl. Make a well in center, then add water and oil and gradually stir into flour with a wooden spoon until a dough forms. Knead dough gently on a work surface 4 or 5 times.\nDivide dough into 3 pieces and roll out 1 piece (keep remaining pieces covered with plastic wrap) on a sheet of parchment paper into a 10-inch round (shape can be rustic; dough should be thin).\nLightly brush top with additional oil and scatter small clusters of rosemary leaves on top, pressing in slightly. Sprinkle with sea salt. Slide round (still on parchment) onto preheated baking sheet and bake until pale golden and browned in spots, 8 to 10 minutes. Transfer flatbread (discard parchment) to a rack to cool, then make 2 more rounds (1 at a time) on fresh parchment (do not oil or salt until just before baking). Break into pieces.",
        "Image_Name":"crisp-rosemary-flatbread-242841"
    },
    {
        "Title":"Haunted Gingerbread House",
        "Ingredients":"['Royal icing or 1 (16-ounce) container vanilla frosting', 'Liquid food coloring in red, yellow, green, and blue', '1 undecorated gingerbread house*', 'Black licorice laces', 'Gummy spiders', 'Candy corn in assorted flavors', 'Green apple sour belts', 'Mellocreme pumpkins', 'Sugar candy bats (also called dextrose candy bats)', 'Marshmallow ghosts', '*Undecorated gingerbread houses can be purchased from Dylans Candy Bar or Amazon.com']",
        "Instructions":"Place 1\/2 cup icing in small bowl and tint purple (see Decorating Tips).\nPlace 1\/2 cup icing in small bowl and tint green (see Decorating tips).\nPlace 1\/4 cup icing in small bowl and tint orange (see Decorating tips).\nUsing small offset spatula or knife, spread purple icing in thin, even layer on roof.\nCut black licorice laces into shorter pieces, then arrange in crisscross pattern on right side of roof to create spiderweb. Gently press into icing to secure. Arrange gummy spiders on roof, gently pressing to secure. Arrange candy corn along seam where left and right sides of roof meet. Arrange candy corn in three vertical lines on left side of roof.\nUsing small offset spatula or knife, spread green icing in thin, even layer on base of house. Arrange green apple sour belts around base of house to form grass.\nUsing small offset spatula or knife, spread small dollop of orange icing on bottom of one Mellocreme pumpkin, then place in front of house. Repeat with additional pumpkins if desired.\nUsing small offset spatula or knife, spread white icing in thin, even layer across surface of door. Gently press sugar candy bats onto door. Place small dollop of white icing on 1 sugar bat and attach to left side of roof. Repeat as desired.\nUsing small offset spatula or knife, spread small dollop of white icing on marshmallow ghost then gently press it onto front of house.\nUsing small offset spatula or knife, spread thin line of orange icing along seam where roof meets front of house. Arrange candy corn along seam, gently pressing to secure.\nArrange candy corn along sides and back of house to form fence. If necessary, secure with additional icing.\nContinue adding candy as desired.",
        "Image_Name":"haunted-gingerbread-house-350143"
    },
    {
        "Title":"Pineapple Upside-Down Pumpkin Gingerbread",
        "Ingredients":"['Nonstick vegetable oil spray', '2\/3 cup (packed) golden brown sugar', '1\/2 cup (1 stick) unsalted butter', '2 tablespoons frozen pineapple juice concentrate, thawed', '1 teaspoon mild-flavored (light) molasses', '1 ripe pineapple, peeled', '2 cups all purpose flour', '2 teaspoons baking soda', '2 teaspoons baking powder', '1 1\/4 teaspoons ground cinnamon', '3\/4 teaspoon ground ginger', '1\/2 teaspoon salt', '1\/2 cup (1 stick) unsalted butter, room temperature', '1 cup sugar', '2 large eggs', '1\/2 cup mild-flavored (light) molasses', '1\/2 cup canned pure pumpkin', '1\/2 cup boiling water', 'Whipped cream']",
        "Instructions":"Preheat oven to 350°F. Spray 9x9x2-inch metal baking pan with nonstick spray. Combine sugar, butter, pineapple juice concentrate, and molasses in heavy small saucepan. Bring to boil over medium heat, whisking until sugar dissolves and syrup is smooth; boil 1 minute. Pour evenly into prepared pan.\nCut off one 1\/3-inch-thick round from pineapple; cut out core. Place round in syrup in pan. Stand pineapple on end. Cut lengthwise into 1\/3-inch-thick slices. Using 3 round cutters of different sizes, cut out rounds from pineapple slices, avoiding core. Arrange rounds close together in single layer in free-form design in syrup.\nWhisk first 6 ingredients in medium bowl. Beat butter in large bowl until fluffy. Add sugar and beat to blend. Beat in eggs, 1 at a time. Beat in molasses, then pumpkin. Beat in dry ingredients just until blended, occasionally scraping down sides of bowl. Beat in 1\/2 cup boiling water. Pour batter evenly into pan.\nBake cake until tester inserted into center comes out clean, about 50 minutes. Cool cake in pan 45 minutes. Place platter over pan and invert. Let stand 5 minutes. Gently lift off pan. Serve cake warm or at room temperature with whipped cream.",
        "Image_Name":"pineapple-upside-down-pumpkin-gingerbread-350121"
    },
    {
        "Title":"Cherry Almond Shortbread Cookies",
        "Ingredients":"['24 dried tart cherries (about 1 1\/2 ounces)', '1\/3 cup crème de cassis (black-currant liqueur)', '1\/2 cup raw almonds with skins, divided', '1\/2 cup all purpose flour', '1\/2 cup whole wheat flour', '1\/2 teaspoon salt', '1\/2 cup (1 stick) unsalted butter, room temperature', '1\/2 cup powdered sugar, sifted', '1 large egg, lightly beaten']",
        "Instructions":"Soak cherries in cassis in small bowl at least 4 hours or overnight. Drain; pat dry.\nGrind 3 tablespoons almonds in mini processor until finely ground. Finely chop remaining almonds.\nWhisk all purpose flour, whole wheat flour, and salt in medium bowl. Using electric mixer, beat butter and sugar in large bowl until creamy, about 2 minutes. Add ground almonds; beat until well blended, about 1 minute. Beat in flour mixture on low speed just to blend.\nScrape dough out onto sheet of parchment or waxed paper. Using paper as aid, form dough into 81\/2x13\/4-inch log. Brush dough all over with egg (except for ends). Scatter chopped almonds on sheet of plastic wrap. Roll log in almonds to coat. Wrap in plastic wrap and chill at least 2 hours. DO AHEAD: Dough can be made 2 days ahead. Keep refrigerated. Cover and chill cherries.\nPreheat oven to 350°F. Let dough stand at room temperature 10 minutes. Unwrap dough and cut into 3\/8-inch-thick slices. Place cookies on large ungreased baking sheet, spacing 1 inch apart. Place 1 cherry in center of each cookie.\nBake 10 minutes. Press cherries into cookies (cookies will have softened). Rotate baking sheet in oven and bake until cookies are lightly golden and slightly puffed, about 18 minutes longer. Cool cookies on sheet on rack 5 minutes. Transfer cookies to rack to cool completely. DO AHEAD: Cookies can be made 2 days ahead. Store airtight at room temperature.",
        "Image_Name":"cherry-almond-shortbread-cookies-350132"
    },
    {
        "Title":"Cornbread-Stuffed Cornish Game Hens with Corn Maque Choux",
        "Ingredients":"['3 tablespoons butter', '1 cup chopped onion', '1\/2 cup chopped celery', '1 1\/2 cups diced peeled cored Granny Smith or Golden Delicious apples', '2 teaspoons chopped fresh sage', '1\/2 teaspoon coarse kosher salt', '1\/2 teaspoon freshly ground black pepper', '4 cups 1\/2-inch cubes purchased cornbread or corn muffins (about 11 ounces)', '1 large egg, beaten to blend', '1\/2 cup (packed) coarsely grated sharp cheddar cheese (about 2 ounces)', '6 tablespoons (about) fresh apple cider or fresh apple juice', '4 1 1\/4- to 1 1\/2-pound Cornish game hens, rinsed, patted dry', '1 tablespoon chopped fresh sage', '2 teaspoons coarse kosher salt', '1 teaspoon freshly ground black pepper', '1 tablespoon olive oil', '4 bacon slices, each halved crosswise', 'Corn Maque Choux']",
        "Instructions":"Melt butter in heavy large skillet over medium-high heat. Add onion and celery; sauté until beginning to color, about 5 minutes. Add apples; sauté until beginning to soften, about 3 minutes. Mix in sage, 1\/2 teaspoon salt, and 1\/2 teaspoon pepper; transfer to large bowl. Let stand until almost cool, about 10 minutes.\nMix cornbread into vegetables. Add egg and toss to blend. Mix in cheese, then enough apple cider by tablespoonfuls to form stuffing that is moist but not wet.\nSprinkle cavity of each hen lightly with salt and pepper. Pack 1 cup stuffing into each (place any leftover stuffing into buttered ramekins and cover with foil). Skewer cavities closed with toothpicks or turkey lacers. Tuck wing tips under; tie legs together to hold shape. Mix sage, coarse salt, and pepper in small bowl; sprinkle over hens.\nPreheat oven to 400°F. Heat oil in large nonstick skillet over medium-high heat. Place 2 hens in skillet. Sauté until brown, turning often with wooden spoons (to prevent tearing skin), about 10 minutes. Transfer to rimmed baking sheet, breast side up. Repeat with remaining hens. Drape 2 bacon strip halves over breast of each hen. Using kitchen string, tie bacon strips in place. (Place any ramekins of stuffing on baking sheet with hens.)\nPlace hens (and extra stuffing) in oven. Roast hens until cooked through and juices run clear when thigh is pierced, about 45 minutes. (Roast stuffing 30 minutes.) Cut strings off hens. Transfer hens to plates. Spoon maque choux around hens and serve with extra stuffing.",
        "Image_Name":"cornbread-stuffed-cornish-game-hens-with-corn-maque-choux-350112"
    },
    {
        "Title":"Ground Coriander and Cilantro Flatbreads",
        "Ingredients":"['1 1\/2 cups (or more) unbleached all purpose flour', '2 1\/2 teaspoons ground coriander', '1 1\/2 teaspoons baking powder', '3\/4 teaspoon salt', '1\/2 teaspoon baking soda', '1\/3 cup chopped fresh cilantro', '3\/4 cup (or more) plain whole-milk yogurt', 'Olive oil (for frying)']",
        "Instructions":"Sift first 5 ingredients into medium bowl. Stir in cilantro. Add yogurt and stir with fork until small clumps form. Knead mixture in bowl just until dough holds together, adding more flour or yogurt by tablespoonfuls for soft and slightly sticky dough. Turn dough out onto floured surface. Knead just until smooth, about 1 minute. Divide dough into 8 equal pieces.\nRoll each piece into ball, then roll each dough piece out on floured surface to 4 1\/2-inch round. Brush large nonstick skillet generously with olive oil; heat over medium heat. Working in batches, add 3 dough rounds to skillet; cook until golden brown and puffed, adjusting heat to medium-high as needed to brown evenly, about 3 minutes per side. Transfer flatbreads to platter; serve warm.",
        "Image_Name":"ground-coriander-and-cilantro-flatbreads-242112"
    },
    {
        "Title":"Flatbread Stuffed with Cheese and Prosciutto (Torta al Testo )",
        "Ingredients":"['1\/4 ounce fresh (cake) yeast or 13\/4 teaspoons active dry yeast', '2\/3 cup warm water (105-115°F), divided', '9 ounce unbleached bread flour (about 1 3\/4 cups plus 2 tablespoons)', '3\/4 teaspoon salt', '1\/2 tablespoon olive oil', '1\/4 pound thinly sliced Italian Fontina, Gruyère, or Emmental cheese', '2 cups baby arugula', '6 thin prosciutto slices']",
        "Instructions":"Stir together yeast and 1\/3 cup warm water in a small bowl and let stand until foamy, about 5 minutes. (If mixture doesn't foam, start over with new yeast.)\nStir together flour and salt with a fork in a large bowl. Make a well in center and add yeast mixture and oil. Stir in flour, then stir in as much of remaining 1\/3 cup water as needed to form a firm, moist dough.\nTurn dough out onto a lightly floured surface and knead until smooth, shiny, and elastic, about 10 minutes.\nPut dough in cleaned large bowl and cover bowl. Let rise in a draft-free place at warm room temperature until doubled, about 1 hour.\nPunch down dough and divide into 2 pieces. Form each piece into a ball and let stand, covered, 10 minutes.\nRoll out each ball on a lightly floured surface with a rolling pin into an 8-inch round (about 1\/4 inch thick; if dough resists rolling out, let stand 1 to 2 minutes, then continue).\nPreheat oven to 400F with rack in middle.\nHeat a heavy medium skillet or griddle over medium-low heat until very hot, about 10 minutes. Cook rounds 1 at a time, flipping frequently to avoid scorching and to aid even cooking, until golden, about 6 minutes per round. Stack rounds and wrap in a kitchen towel (not terry cloth) to keep soft while cooling.\nWhen rounds are cool, separate into halves by cutting into bread all around edge and gently pulling rounds apart. Sandwich cheese, arugula, prosciutto, and salt and pepper to taste between halves.\nPut stuffed breads on a baking sheet and bake until crisp and cheese has melted, about 8 minutes. Cut into wedges and serve warm.",
        "Image_Name":"flatbread-stuffed-with-cheese-and-prosciutto-em-torta-al-testo-em-242030"
    },
    {
        "Title":"Texas Buttermilk Cornbread",
        "Ingredients":"['unsalted butter', '2 cups yellow cornmeal', '6 tablespoons all purpose flour', '1 tablespoon baking powder', '1\/2 teaspoon salt', '1\/8 teaspoon baking soda', '1 1\/3 cups buttermilk']",
        "Instructions":"Preheat oven to 400°F. Brush 8x8x2-inch glass baking dish with 2 tablespoons butter. Place dish in oven 10 minutes (butter may brown).\nMeanwhile, whisk cornmeal, flour, baking powder, salt, and baking soda in large bowl to blend. Add buttermilk and remaining 6 tablespoons melted butter. Stir batter just until evenly moistened (do not over mix).\nTransfer cornbread batter to hot dish and spread evenly. Bake cornbread until crusty on top and tester inserted into center comes out clean, about 25 minutes. Let cornbread cool at least 10 minutes. Serve warm.",
        "Image_Name":"texas-buttermilk-cornbread-241130"
    },
    {
        "Title":"Savory Parmesan Shortbread Rounds",
        "Ingredients":"['1 3\/4 cups all purpose flour', '3\/4 cup plus 2 tablespoons grated Parmesan cheese (about 2 1\/2 ounces)', '1 teaspoon coarse kosher salt', '1\/2 small garlic clove, minced', 'Pinch of cayenne pepper', '1 cup (2 sticks) chilled unsalted butter, cut into 1\/2-inch cubes']",
        "Instructions":"Preheat oven to 350°F. Line baking sheet with parchment paper. Mix flour, 3\/4 cup Parmesan cheese, salt, garlic, and cayenne pepper in processor. Add butter and, using on\/off turns, process until dough begins to come together. Gather dough into ball. Divide dough in half. Roll each half into 12-inch log, and cut each log into 1-inch pieces. Roll each piece into ball. Arrange dough balls on prepared baking sheet, spacing about 1 1\/2 inches apart. Press each ball into 2-inch-diameter round. Sprinkle remaining 2 tablespoons Parmesan cheese over.\nBake shortbread rounds until tops are dry and bottoms are golden brown, about 20 minutes. Transfer shortbread rounds to rack and cool completely. DO AHEAD: Shortbread rounds can be made 1 week ahead. Store rounds in airtight container at room temperature, or freeze up to 1 month.",
        "Image_Name":"savory-parmesan-shortbread-rounds-240758"
    },
    {
        "Title":"Cornbread Dressing with Roasted Fall Vegetables",
        "Ingredients":"['1 10-ounce bag pearl onions', '2 1\/2 cups 1\/2-inch-thick diagonal slices peeled carrots (about 3\/4 pound)', '2 1\/2 cups 1\/2-inch-thick diagonal slices peeled parsnips (about 3\/4 pound)', '2 cups 1\/2-inch cubes peeled rutabagas (about 3\/4 pound)', '2\/3 cup olive oil, divided', '1 pound crimini (baby bella) mushrooms, stemmed, caps halved', '6 large garlic cloves, peeled', '2 teaspoons dried thyme', '2 teaspoons dried crushed rosemary', '1 1\/2 teaspoons dried rubbed sage', '6 cups 1\/2-inch cubes Cornbread for Dressing', '3 large eggs, beaten to blend', '3 tablespoons unsalted butter, melted', '1 1\/2 cups low-salt chicken broth']",
        "Instructions":"Position 1 rack in top third and 1 rack in bottom third of oven; preheat to 425°F. Cook onions in small saucepan of boiling water 2 minutes; drain. Cool slightly; trim and peel. Place onions, carrots, parsnips, and rutabagas in single layer on large rimmed baking sheet. Drizzle 1\/3 cup oil over and sprinkle generously with salt and pepper; toss to coat. Place mushrooms and garlic on another rimmed baking sheet; drizzle with remaining 1\/3 cup oil, sprinkle with salt and pepper, and toss to coat. Roast root vegetables until tender and brown around edges, stirring every 15 minutes, about 1 hour. Roast mushrooms and garlic until tender, stirring once, about 30 minutes. Place root vegetables and mushrooms in large bowl. Place garlic in small bowl; mash with fork until pureed. Add pureed garlic, thyme, rosemary, and sage to vegetables; toss to coat. Season to taste with salt and pepper. DO AHEAD: Vegetable mixture can be made 1 day ahead. Cool vegetables, cover, and chill. Bring mixture to room temperature before continuing.\nPlace cornbread cubes on large rimmed baking sheet. Let bread cubes stand at room temperature to dry slightly, about 1 hour.\nPreheat oven to 375°F. Butter 13x9x2- inch oval baking dish. Add cornbread cubes to vegetables; toss to distribute evenly. Add eggs; toss to coat. Drizzle with melted butter; toss to coat. Add broth and stir to combine (mixture will be very moist). Transfer mixture to prepared dish.\nBake dressing uncovered until lightly browned and crisp around edges, about 45 minutes.",
        "Image_Name":"cornbread-dressing-with-roasted-fall-vegetables-240386"
    },
    {
        "Title":"Sage-Scented Shortbread",
        "Ingredients":"['2 cups all purpose flour', '1\/2 cup powdered sugar', '2 tablespoons thinly sliced fresh sage leaves or 2 teaspoons dried sage', '1 teaspoon coarse kosher salt', '1 cup (2 sticks) unsalted butter, cut into 1\/2-inch-thick pieces, room temperature']",
        "Instructions":"Blend first 4 ingredients in processor. Add butter; using on\/off turns, process until dough comes together. Divide in half. Shape each dough piece into log about 1 1\/2 inches in diameter. Chill until firm enough to slice, about 30 minutes.\nPosition 1 rack in top third and 1 rack in bottom third of oven; preheat to 350°F. Line 2 baking sheets with parchment. Cut each dough log into 1\/3- to 1\/2-inch-thick rounds; place on sheets. Bake 10 minutes. Reverse sheets so bottom sheet is on top rack of oven and top sheet is on bottom rack. Bake until cookies are golden, about 15 minutes longer. Cool on racks.",
        "Image_Name":"sage-scented-shortbread-240377"
    },
    {
        "Title":"Sage and Honey Skillet Cornbread",
        "Ingredients":"['1 cup cornmeal (preferably whole grain, medium grind)', '1 cup unbleached all purpose flour', '1 tablespoon baking powder', '1 teaspoon salt', '2 teaspoons chopped fresh sage plus 12 whole fresh sage leaves', '1 cup whole milk', '1\/2 cup honey', '1 large egg', '1\/2 cup (1 stick) unsalted butter']",
        "Instructions":"Preheat oven to 400°F. Heat heavy 10-inch-diameter ovenproof skillet (preferably cast-iron) in oven 10 minutes.\nWhisk first 4 ingredients and 2 teaspoons chopped sage in large bowl to blend. Whisk milk, honey, and egg in medium bowl to blend.\nRemove skillet from oven; add 1\/2 cup butter. Swirl until butter is melted. Pour all except 2 tablespoons butter into egg mixture. Add whole sage leaves to butter in skillet; toss to coat. Arrange leaves over bottom of skillet, spacing apart.\nAdd egg mixture to cornmeal mixture; stir until just combined (do not overmix; batter will be wet and runny). Pour batter over sage leaves in skillet. Bake until browned around edges and tester inserted into center comes out clean, about 22 minutes. Cool in skillet 10 minutes. Invert onto platter. If necessary, reposition sage leaves atop cornbread.",
        "Image_Name":"sage-and-honey-skillet-cornbread-240376"
    },
    {
        "Title":"Pistachio Shortbread",
        "Ingredients":"['1 1\/2 cups all purpose flour', '1\/2 cup plus 2 tablespoons powdered sugar', '1\/2 teaspoon salt', '3\/4 cup (1 1\/2 sticks) chilled unsalted butter, cut into 1\/2-inch cubes', '1\/2 cup natural unsalted pistachios, lightly toasted, chopped', '1 large egg yolk', '3\/4 teaspoon vanilla extract']",
        "Instructions":"Mix flour, powdered sugar, and salt in processor. Add butter, pistachios, egg yolk, and vanilla. Using on\/off turns, mix until moist ball forms. Transfer dough to work surface. Divide dough in half. Form each dough half into 8 x 1 1\/4-inch log (if dough is too soft, chill until firm, about 30 minutes). Wrap logs in plastic; refrigerate until firm, about 4 hours. DO AHEAD Can be made 5 days ahead; keep chilled.\nPreheat oven to 325°F. Slice logs into 1\/4-inch-thick rounds, rolling log after every few slices to retain round shape. Place rounds on ungreased baking sheets, spacing 1 inch apart. Bake shortbread until barely golden, about 18 minutes. Cool shortbread on baking sheets. DO AHEAD Shortbread can be made up to 4 days ahead. Store shortbread in airtight container at room temperature.",
        "Image_Name":"pistachio-shortbread-239079"
    },
    {
        "Title":"Fresh Strawberry Sorbet with Shortbread Cookies",
        "Ingredients":"['1 cup water', '1 cup sugar', '4 cups quartered hulled fresh strawberries (about 18 ounces) plus additional whole strawberries for garnish', '3 tablespoons fresh lime juice', 'Shortbread cookies']",
        "Instructions":"Combine 1 cup water and sugar in medium saucepan. Stir over medium-high heat until sugar dissolves and mixture comes to boil. Reduce heat and simmer 5 minutes. Transfer to bowl and chill until cold.\nPuree quartered strawberries in processor until smooth. Add lime juice and sugar syrup; process until blended. Chill mixture until cold, about 1 hour.\nTransfer strawberry mixture to ice cream maker and process according to manufacturer's instructions. Spoon sorbet into container; cover and freeze until firm, about 4 hours. DO AHEAD Can be made 3 days ahead. Keep frozen.\nScoop sorbet into individual glasses or bowls; garnish with strawberries. Serve Shortbread Cookies alongside.",
        "Image_Name":"fresh-strawberry-sorbet-with-shortbread-cookies-237921"
    },
    {
        "Title":"Shortbread Cookies",
        "Ingredients":"['1 cup all purpose flour', '1\/4 cup sugar', '1\/4 teaspoon salt', '1\/2 cup (1 stick) chilled unsalted butter, cut into 1\/2-inch cubes']",
        "Instructions":"Preheat oven to 300°F. Lightly butter 9-inch-diameter springform pan. Whisk flour, sugar, and salt in medium bowl to blend. Add 1\/2 cup butter and rub in with fingertips until mixture resembles coarse meal. Gather dough together and form into ball; flatten into disk. Roll out dough on lightly floured surface to 1\/2-inch-thick round. Transfer round to prepared pan. Using fingers, press dough evenly over bottom to edges of pan. Using tip of small sharp knife, score dough into 8 equal triangles, then pierce all over with fork. Bake until shortbread is cooked through and pale golden, about 45 minutes.\nUsing tip of sharp knife, cut warm shortbread into triangles along scored lines. Run knife around shortbread to loosen. Cool in pan at least 30 minutes. Release springform pan sides. Using spatula, carefully remove shortbread from pan (shortbread will be fragile). DO AHEAD Can be made 1 day ahead. Store shortbread airtight in single layer at room temperature.",
        "Image_Name":"shortbread-cookies-237919"
    },
    {
        "Title":"Cornbread Muffins with Maple Butter",
        "Ingredients":"['3\/4 cup (1 1\/2 sticks) unsalted butter, room temperature', '3 1\/2 tablespoons pure maple syrup (preferably grade B)', '1 cup yellow cornmeal', '1 cup unbleached all purpose flour', '1\/4 cup sugar', '1 tablespoon baking powder', '1\/4 teaspoon salt', '1 cup buttermilk', '1 large egg', '5 tablespoons unsalted butter, melted, cooled slightly']",
        "Instructions":"Using electric mixer, beat butter in medium bowl until creamy. Gradually beat in maple syrup until well blended and smooth. DO AHEAD Can be made 1 week ahead. Cover and refrigerate.\nPreheat oven to 375°F. Butter 12 regular (1\/3-cup) muffin cups. Sift cornmeal, flour, sugar, baking powder, and salt into medium bowl. Whisk buttermilk and egg in another medium bowl; whisk in melted butter. Add buttermilk mixture to dry ingredients; stir just until incorporated (do not overmix). Divide batter equally among prepared muffin cups. Bake muffins until tester inserted into center comes out clean, about 15 minutes (muffins will be pale). Cool on rack 10 minutes. Serve with maple butter.",
        "Image_Name":"cornbread-muffins-with-maple-butter-237892"
    },
    {
        "Title":"Real Gingerbread",
        "Ingredients":"['2 1\/4 cups all-purpose flour', '1 teaspoon baking soda', '1 teaspoon ground cinnamon', '1\/4 teaspoon ground allspice', '1\/2 teaspoon salt', '1 stick (1\/2 cup) unsalted butter, well softened', '2\/3 cup molasses (not blackstrap)', '2\/3 cup packed dark brown sugar', '2 large eggs', '3 tablespoons finely grated (with a rasp) peeled fresh ginger', '2\/3 cup hot water']",
        "Instructions":"Put oven rack in middle position and preheat oven to 350°F. Butter a 9-inch square baking pan.\nWhisk together flour, baking soda, spices, and salt in a bowl.\nBeat together butter, molasses, brown sugar, eggs, and ginger in a large bowl with an electric mixer at medium speed until combined. Reduce speed to low and mix in flour mixture until smooth, then add hot water and mix until combined (batter may appear curdled).\nPour batter into pan and bake until a wooden pick or skewer inserted in center of cake comes out clean, 35 to 40 minutes. Cool to warm in pan on a rack.",
        "Image_Name":"real-gingerbread-237680"
    },
    {
        "Title":"Caramelized-Onion Flatbreads with Crème Fraîche",
        "Ingredients":"['1\/4 cup plus 1 tablespoon warm water (105°F to 115°F)', '3\/4 teaspoon active dry yeast', '3\/4 cup plus 2 tablespoons all purpose flour', '3\/4 teaspoon nigella (kalonji) seeds', '1\/2 teaspoon salt', '1 tablespoon butter, room temperature', '2 tablespoons extra-virgin olive oil', '1 pound onions (about 2 medium), cut into 1\/3-inch-thick wedges through root ends', '2 teaspoons chopped fresh thyme', '1 teaspoon honey', '1 tablespoon Sherry wine vinegar', '1\/2 cup crème fraîche', '1 large egg', '1\/2 teaspoon salt', '1\/4 teaspoon ground black pepper', 'Semolina flour (pasta flour)* or cornmeal', '2 tablespoons chopped fresh chives']",
        "Instructions":"Whisk 1\/4 cup plus 1 tablespoon warm water and yeast in small bowl; let stand until yeast is dissolved, about 10 minutes.\nMix flour, nigella seeds, and salt in medium bowl. Add yeast mixture and stir with wooden spoon until mixture clumps together. Add butter; mix until incorporated. Turn dough out onto lightly floured work surface and knead until smooth and elastic, about 5 minutes. Divide dough into 6 equal pieces; roll each into ball. Place on baking sheet; cover with plastic wrap. (Can be prepared 1 day ahead. Keep covered and refrigerate.)\nHeat oil in large nonstick skillet over medium-high heat. Add onion wedges to skillet and cook without turning until beginning to brown, about 7 minutes. Carefully turn onions over; reduce heat to medium and continue to cook until onions are tender and brown, occasionally stirring gently, about 10 minutes. Add thyme and honey; cook 1 minute. Stir in vinegar. Seasonto taste with salt and pepper. Remove skillet from heat. Cool. (Can be prepared 1 day ahead. Cover and refrigerate.)\nLet dough rise in warm draft-free area until doubled, about 1 hour. Whisk crème fraîche and egg in small bowl to blend. Stir in 1\/2 teaspoon salt and 1\/4 teaspoon pepper.\nPreheat oven to 450°F. Sprinkle 2 rimmed baking sheets lightly with semolina flour. Roll out each dough ball to 5-inch round. Transfer 3 rounds to each prepared baking sheet. Let rest 10 minutes. Pierce dough rounds all over with fork. Spread 1 generous tablespoon crème fraîche mixture over each dough round, leaving 1\/4-inch plain border. Arrange onions evenly atop each; drizzle lightly with crème fraîche mixture (mixture may spill over edges of dough).\nBake flatbreads until crusts are puffed and golden, about 12 minutes. Transfer to plates; sprinkle with chives.\n*Available at some supermarkets, and at specialty foods stores and Italian markets.",
        "Image_Name":"caramelized-onion-flatbreads-with-creme-fraiche-233905"
    },
    {
        "Title":"Caramel Pudding Tart with Almond Shortbread Crust",
        "Ingredients":"['1\/2 cup slivered almonds, toasted, cooled', '1\/4 cup sugar', '1 cup all purpose flour', '1\/4 cup powdered sugar', '1\/4 teaspoon salt', '1\/2 cup (1 stick) chilled unsalted butter, cut into 1\/2-inch cubes', '1 large egg yolk', '2 1\/2 tablespoons cornstarch', '1\/4 teaspoon salt', '2 1\/4 cups whole milk, divided', '3 large egg yolks', '1 cup sugar', '1\/3 cup water', '3 tablespoons unsalted butter', '1\/2 teaspoon vanilla extract', '2\/3 cup sugar', '1\/3 cup water', '1 cup slivered almonds', '1\/2 cup chilled heavy whipping cream', '1\/2 tablespoon powdered sugar', '1\/8 teaspoon vanilla extract', 'Fleur de sel*', '*A type of sea salt; available at some supermarkets and at specialty foods stores.']",
        "Instructions":"Butter 9-inch-diameter tart pan with removable bottom. Combine almonds and 1\/4 cup sugar in processor; grind nuts finely. Add flour, powdered sugar, and salt; blend 5 seconds. Add butter and blend, using on\/off turns, until coarse meal forms. Add egg yolk and blend until moist clumps form, about 30 seconds. Knead dough into ball. Transfer 1\/4 cup dough to small bowl and reserve for another use. Press remaining dough evenly onto bottom and up sides of prepared pan. Pierce bottom all over with fork. Cover pan with foil and freeze crust at least 1 hour and up to 1 day.\nPreheat oven to 375°F. Bake crust uncovered until deep golden brown, checking often and pressing sides and bottom with back of fork during first 15 minutes when crust puffs or bubbles, about 20 minutes total. Cool completely.\nPlace cornstarch and salt in medium bowl. Gradually add 1\/4 cup milk, whisking until cornstarch dissolves. Whisk in egg yolks.\nStir sugar and 1\/3 cup water in heavy large saucepan over medium-high heat until sugar dissolves. Bring to boil, brushing down pan sides with wet pastry brush. Boil without stirring until syrup is deep amber, swirling pan occasionally, about 10 minutes. Add 2 cups milk (mixture will bubble). Whisk until caramel bits dissolve. Slowly whisk hot milk mixture into yolk mixture; return to same pan. Whisk until pudding thickens and boils, about 2 minutes. Remove from heat. Whisk in butter and vanilla. Transfer to crust. Chill uncovered until cold and just firm, at least 3 hours. Do ahead Can be made 1 day ahead.\nStir 2\/3 cup sugar and 1\/3 cup water in heavy medium skillet (do not use nonstick) over medium-high heat until sugar dissolves. Bring to boil, brushing down pan sides with wet pastry brush. Boil without stirring until syrup is medium amber color, about 7 minutes. Add almonds and stir to coat evenly with caramel. Immediately scrape coated almonds onto sheet of foil. Working quickly with 2 forks, separate almonds and spread out in single layer. Cool completely. Do ahead Let almonds stand at room temperature up to 6 hours or cover and chill up to 1 day. Break almonds into small clusters before using.\nPress bottom of pan up, releasing tart. Whisk cream, powdered sugar, and vanilla in bowl until peaks form; spread over tart. Sprinkle almond clusters with fleur de sel. Garnish tart with clusters.",
        "Image_Name":"caramel-pudding-tart-with-almond-shortbread-crust-236889"
    },
    {
        "Title":"Gingerbread Trees with Juniper Berry Glaze",
        "Ingredients":"['2 1\/4 cups unbleached all purpose flour', '1 teaspoon ground ginger', '1 teaspoon ground allspice', '1\/2 teaspoon ground cinnamon', '1\/2 teaspoon baking soda', '1\/2 teaspoon salt', '1 cup (2 sticks) unsalted butter, room temperature', '1\/2 cup (packed) golden brown sugar', '1\/4 cup mild-flavored (light) molasses', '3\/4 cup half and half', '1\/3 cup (1 ounce) juniper berries, lightly crushed', '1 pound powdered sugar', 'Assorted decorations (colored sugars, nonpareils, and dragées)']",
        "Instructions":"Whisk first 6 ingredients in medium bowl. Beat butter and sugar in large bowl until fluffy. Beat in molasses. Beat in dry ingredients. Gather dough; divide into 4 pieces. Shape into disks. Wrap; chill at least 2 hours and up to 2 days.\nPreheat oven to 350°F. Line 2 baking sheets with parchment. Roll out 1 dough disk to 1\/8-inch thickness. Using 3 1\/2-inch cutter, cut out cookies. Transfer to sheet. Gather scraps; chill.\nBake cookies until almost firm in center, 12 minutes. Cool on sheets 2 minutes, then cool on racks. Repeat, using all dough. Do ahead Store airtight at room temperature up to 3 days or freeze up to 2 weeks.\nBring first 2 ingredients to simmer. Cover; chill 5 hours. Strain. Place powdered sugar in bowl. Whisk in half and half by spoonfuls until glaze is spreadable. Frost cookies; decorate. Let stand until glaze sets. Do ahead Store between sheets of waxed paper in airtight container at room temperature up to 3 days.",
        "Image_Name":"gingerbread-trees-with-juniper-berry-glaze-236805"
    },
    {
        "Title":"Scottish Sharp-Cheddar Shortbread",
        "Ingredients":"['1\/2 cup (1 stick) unsalted butter, at room temperature', '1\/2 teaspoon salt', '1\/4 teaspoon freshly ground black pepper', 'Pinch of cayenne pepper', '8 ounces extra-sharp white Cheddar cheese, finely shredded', '1 cup unbleached all-purpose flour']",
        "Instructions":"Using electric mixer fitted with whisk attachment, beat together butter, salt, black pepper, and cayenne at low speed just until blended. Add Cheddar and flour and mix at low speed just until smooth (do not overmix). Shape dough into disk, wrap in plastic wrap or waxed paper, and chill 30 minutes.\nArrange racks in upper and lower thirds of oven and preheat to 350°F. Line 2 large baking sheets with parchment paper.\nOn lightly floured surface, roll out dough to 1\/4- to 1\/8-inch-thick round. Using 1 1\/2- to 2-inch round cutter, cut out rounds and arrange 1 1\/2 inches apart on baking sheets. Reroll scraps if desired (rerolled scraps will be tougher).\nBake shortbread until lightly golden and beginning to brown on edges, about 13 to 15 minutes. Cool on sheets 5 minutes, then transfer to racks to cool completely.",
        "Image_Name":"scottish-sharp-cheddar-shortbread-236735"
    },
    {
        "Title":"Norwegian Flatbreads",
        "Ingredients":"['4 medium-large russet potatoes (about 2 pounds), finely diced', '5 tablespoons unsalted butter, cut into 1\/2-inch slices', '1 3\/4 teaspoons kosher salt', '1\/2 cup heavy cream', '2 cups unbleached all-purpose flour', '1\/2 cup sugar', '1 teaspoon cinnamon', 'About 3 cups unbleached all-purpose flour', '4 tablespoons salted butter, melted']",
        "Instructions":"In medium saucepan over high heat, combine potatoes and cold water to cover. Cover and bring to boil, then reduce heat to low and simmer until tender, about 15 minutes. Drain well and force potatoes through ricer or food mill into large bowl. Stir in butter. Add salt and cream and stir until smooth. Add flour and stir until dough forms (do not overmix). Cover and chill at least 6 hours and up to 3 days.\nIn small bowl, whisk together sugar and cinnamon. Lightly oil 10-inch cast iron skillet and set over moderately low heat. Have ready rolling pin, pastry bench scraper, and thin metal spatula.\nTurn dough out onto well-floured work surface. Using pastry bench scraper, cut in half and return half to bowl. Cut other piece in half again; cut 1 piece into 8 small pieces and reserve other piece.\nPat 1 small piece to flatten. Dough may be very soft and sticky, depending on moisture content of potato — add some of 3 cups flour as needed to prevent sticking. Using scraper, flip dough over and pat again to flatten. Roll patty out to 7-inch circle.\nUsing pastry bench scraper, carefully transfer flatbread to hot skillet and cook until dough bubbles and is beginning to brown underneath, less than 1 minute. Using thin, flexible metal spatula, flip flatbread over and cook other side until lightly brown, about 1 minute. Transfer to plate and brush off any excess flour. Scrape any excess flour out of skillet.\nRepeat rolling and cooking with 8 small pieces of dough, then divide remaining piece of dough on counter into 8 pieces and roll and cook each piece. Repeat process with remaining dough in bowl to make 32 flatbreads.\nTo serve, brush warm lefse with melted butter, sprinkle with cinnamon-sugar, and roll up. Serve warm.",
        "Image_Name":"norwegian-flatbreads-236734"
    },
    {
        "Title":"Gingerbread Puddings with Candied Apples",
        "Ingredients":"['8 cups unsweetened apple cider or apple juice', '1 1\/2 pounds Granny Smith apples, peeled, cored, cut into 1\/3-inch cubes (about 4 1\/2 cups)', '3\/4 cup (packed) golden brown sugar', '1 3\/4 cups all purpose flour', '1 tablespoon ground ginger', '1 teaspoon baking soda', '1 teaspoon ground cinnamon', '1\/4 teaspoon salt', '1\/4 teaspoon ground cloves', '1\/4 teaspoon finely ground black pepper', '1\/2 cup (1 stick) unsalted butter, room temperature', '3\/4 cup (packed) golden brown sugar', '1 large egg', '3\/4 cup mild-flavored (light) molasses', '1\/2 cup boiling water', '3 cups whole milk', '2 4-inch-long pieces fresh ginger (about 4 ounces), peeled, thickly sliced', '1 tablespoon whole black peppercorns', '4 large eggs', '3\/4 cup sugar', '1 teaspoon vanilla extract', '1 teaspoon ground ginger', 'Pinch of salt', 'Ice cream or crème fraîche*', '*Available at some supermarkets and at specialty foods stores.']",
        "Instructions":"Combine all ingredients in large pot. Bring to boil over high heat, stirring until sugar dissolves. Reduce heat to medium and simmer until apples are soft and translucent and cider coats apples thickly, stirring occasionally, about 2 hours. Transfer to bowl and cool. DO AHEAD Can be made 1 week ahead. Cover and chill. Bring to room temperature before serving.\nPreheat oven to 350°F. Butter 9x9x2-inch metal baking pan. Whisk first 7 ingredients in medium bowl to blend. Using electric mixer, beat butter in large bowl until fluffy. Add brown sugar and egg and beat until blended. Beat in molasses, then flour mixture. Using rubber spatula, stir in 1\/2 cup boiling water. Transfer batter to prepared pan.\nBake gingerbread until tester inserted into center comes out clean, about 40 minutes. Transfer pan to rack and cool gingerbread completely in pan. DO AHEAD Can be made 1 day ahead. Cover pan with foil; let stand at room temperature.\nPreheat oven to 325°F. Combine milk, fresh ginger, and peppercorns in heavy medium saucepan; bring to simmer. Remove from heat. Whisk eggs, sugar, vanilla, ground ginger, and salt in medium bowl to blend. Gradually whisk hot milk mixture into egg mixture. Strain custard into medium bowl; discard solids in strainer.\nCut enough gingerbread into 1\/2-inch cubes to measure 5 1\/3 cups (reserve any remaining gingerbread for another use). Divide gingerbread cubes among eight 3\/4-cup custard cups or ramekins. Pour custard over gingerbread in each cup, dividing equally. Let stand 15 minutes to allow gingerbread to absorb some custard.\nPlace cups in roasting pan. Pour enough hot water into pan to come halfway up sides of cups. Cover pan with foil. Bake puddings until set, about 1 hour. Remove from water bath.\nServe puddings warm or at room temperature, topped with candied apple garnish and ice cream.",
        "Image_Name":"gingerbread-puddings-with-candied-apples-236546"
    },
    {
        "Title":"Roasted Beets and Carrots with Cumin Vinaigrette, Chickpea Purée, and Flatbread",
        "Ingredients":"['10 medium beets (red and golden), cleaned, trimmed', '5 tablespoons plus 1\/2 cup extra-virgin olive oil, divided', '1 teaspoon salt', '2\/3 cup water', '6 medium carrots with green tops', '2 teaspoons fresh thyme leaves', '1 1\/2 teaspoons cumin seeds', '3 tablespoons red wine vinegar', '1\/2 cup fresh Italian parsley leaves', '1\/4 cup thinly sliced shallots (about 1 large)', '4 teaspoons fresh lemon juice, divided', 'chickpea puree', '6 purchased flatbreads']",
        "Instructions":"Preheat oven to 400°F. Place beets in roasting pan; drizzle 2 tablespoons olive oil over. Sprinkle with 1 teaspoon salt; toss. Add 2\/3 cup water to pan; arrange golden beets on 1 side of pan and red beets on other side. Cover with foil. Roast until tender, about 45 minutes.\nMeanwhile, trim green tops from carrots to 1 inch. Peel carrots and cut into thirds crosswise, then quarter lengthwise. Place carrots on rimmed baking sheet. Drizzle with 3 tablespoons olive oil and sprinkle with thyme, salt, and pepper; toss to coat. Roast until carrots are tender and beginning to brown, stirring occasionally, about 20 minutes. Cool carrots and beets.\nUsing fingers, rub peel off beets. Cut each beet into 6 wedges. Place golden beets in medium bowl and red beets in another medium bowl.\nStir cumin seeds in dry skillet over medium heat until lightly toasted, about 2 minutes. Transfer 3\/4 teaspoon cumin seeds to mortar or spice mill; grind finely. Place whole cumin seeds, ground cumin, and vinegar in small bowl; whisk in 1\/2 cup oil. Season vinaigrette with salt and pepper. Do ahead Beets, carrots, and vinaigrette can be made 1 day ahead. Cover separately; chill. Bring all to room temperature and rewhisk vinaigrette before continuing.\nAdd parsley, shallots, 2 teaspoons lemon juice, carrots, and 2\/3 of cumin vinaigrette to bowl with golden beets; toss to blend. Add remaining vinaigrette and 2 teaspoons lemon juice to bowl with red beets; toss to blend. Season both beet mixtures with salt and pepper.\nPlace generous dollop of chickpea puree and 1 flatbread on each of 6 plates. Spoon golden beet-carrot mixture alongside. Tuck red beets into golden beet mixture and serve.",
        "Image_Name":"roasted-beets-and-carrots-with-cumin-vinaigrette-chickpea-puree-and-flatbread-236172"
    },
    {
        "Title":"Cheesy Zucchini and Red Onion Flatbread",
        "Ingredients":"['Nonstick vegetable oil spray', '1 10-ounce tube refrigerated pizza dough', '3\/4 cup garlic-and-herb cheese spread (such as Alouette), divided', '3\/4 cup finely grated Parmesan cheese, divided', '3 tablespoons chopped fresh Italian parsley, divided', '1 small red onion', '1 7- to 8-inch-long zucchini (yellow or green), cut crosswise into 1\/8-inch-thick rounds, divided', 'Olive oil']",
        "Instructions":"Preheat oven to 400°F. Line baking sheet with parchment paper; spray with nonstick spray. Unroll dough onto parchment. Spread half of herb cheese over 1 long half of dough, leaving 1\/2-inch plain border. Sprinkle with half of Parmesan and 2 tablespoons parsley. Using parchment as aid, fold plain half of dough over filled half (do not seal edges). Spread remaining herb cheese over top; sprinkle with remaining Parmesan. Remove enough outer layers of onion to yield 2-inch-diameter core; cut into 1\/8-inch-thick rounds. Arrange 1 row of zucchini down 1 long side of dough. Arrange onion rounds in row alongside zucchini. Arrange 1 more row of zucchini alongside onion. Brush vegetables with oil; sprinkle with salt and pepper. Bake bread until puffed and deep brown at edges, about 24 minutes. Sprinkle with 1 tablespoon parsley.",
        "Image_Name":"cheesy-zucchini-and-red-onion-flatbread-235578"
    },
    {
        "Title":"Mixed-Nut Shortbread",
        "Ingredients":"['1 stick (1\/2 cup) unsalted butter, softened', '1\/3 cup plus 1 tablespoon sugar', '1\/2 teaspoon vanilla', '1 cup all-purpose flour', '3\/4 cup salted and roasted mixed cocktail nuts, coarsely chopped']",
        "Instructions":"Put oven rack in middle position and preheat oven to 375°F.\nStir together butter and 1\/3 cup sugar in a medium bowl with a wooden spoon until combined well. Stir in vanilla, then add flour and mix with your hands just until a dough forms.\nTransfer dough to a lightly greased baking sheet and spread evenly with your fingers to form an 8-inch square. Sprinkle nuts evenly over dough, pressing down to help them adhere.\nSprinkle remaining tablespoon sugar over nuts and bake until shortbread is deep golden, 20 to 25 minutes.\nCool on baking sheet on a rack, 10 minutes. Cut into 18 (roughly 3- by 1 1\/2-inch) bars.",
        "Image_Name":"mixed-nut-shortbread-235491"
    },
    {
        "Title":"Gingerbread Skeletons",
        "Ingredients":"['1\/2 cup sugar', '1\/2 cup butter', '1\/2 cup molasses', '1\/4 cup water', '2 1\/2 cups flour, sifted', '3\/4 teaspoon salt', '1\/4 teaspoon nutmeg', '1\/2 teaspoon baking soda', '3\/4 teaspoon ginger', '1\/8 teaspoon allspice', 'Animal and gingerbread people cookie cutters', '1 tube white decorating icing with small tip']",
        "Instructions":"1. In a large mixing bowl, cream the sugar and butter together. Add molasses and water.\n2. In a separate bowl, mix the flour, salt, nutmeg, baking soda, ginger, and allspice. Gradually add the dry mixture to the wet and blend until the dough holds together.\n3. Cover and chill for 2-3 hours.\n4. Preheat the oven to 375°F.\n5. Roll out dough 1\/4\" thick on a lightly floured surface.\n6. Cut into shapes with cookie cutters and transfer to cookie sheet.\n7. Bake for 10-12 minutes. Remove from the oven and let cool on baking sheets or cooling racks.\n8. Using the white decorating icing, decorate the cookies with \"bones\" so that they resemble skeletons.",
        "Image_Name":"gingerbread-skeletons-232938"
    },
    {
        "Title":"Grilled Sweetbreads",
        "Ingredients":"['1 lb sweetbreads', '1 gallon cold water', '1 cup distilled white vinegar', '2 tablespoons salt', '2 tablespoons extra-virgin olive oil', 'Accompaniment: chimichurri sauce', '4 (12-inch) wooden skewers, soaked in warm water 1 hour']",
        "Instructions":"Rinse sweetbreads well, then transfer to a 6-quart pot and add water, vinegar, and salt. Bring to a boil over high heat, then reduce heat and simmer gently 10 minutes. Drain sweetbreads in a colander, then transfer to a bowl of ice and cold water to cool.\nWhile sweetbreads are cooling, prepare grill for cooking over direct heat with medium-hot charcoal (moderately high heat for gas; see \"Grilling Procedure\").\nDrain sweetbreads, then pat dry gently and separate into roughly 1 1\/2-inch pieces (about 20) using your fingers. Toss sweetbread pieces with oil in a bowl, then thread onto skewers (about 5 pieces on each). Season with salt and pepper.\nGrill sweetbreads on lightly oiled grill rack (covered only if using a gas grill), turning occasionally, until golden brown, 5 to 7 minutes total. Transfer to a platter and let stand, loosely covered with foil, 5 minutes.",
        "Image_Name":"grilled-sweetbreads-234665"
    },
    {
        "Title":"Mango Gingerbread with Macadamia Streusel",
        "Ingredients":"['1\/3 cup finely chopped lightly salted dry-roasted macadamia nuts', '1\/4 cup sugar', '2 1\/2 tablespoons finely chopped crystallized ginger', '2 cups all purpose flour', '3\/4 cup (packed) golden brown sugar', '1 1\/2 tablespoons ground ginger', '2 teaspoons baking powder', '1 teaspoon baking soda', '1\/4 teaspoon salt', '1 pound ripe mangoes, peeled, pitted', '1\/2 cup buttermilk', '1\/4 cup canola oil', '2 large eggs']",
        "Instructions":"Stir all ingredients in small bowl to blend.\nPosition rack in center of oven and preheat to 350°F. Butter 9x9x2-inch metal baking pan. Whisk first 6 ingredients in medium bowl to blend. Coarsely puree mangoes in food processor. Transfer 1 cup mango puree to large bowl (reserve any remaining puree for another use). Add buttermilk, oil, and eggs to puree; whisk until blended. Add flour mixture; stir just until combined. Transfer half of batter (about 2 cups) to prepared pan. Sprinkle half of streusel over. Spoon remaining batter over, smooth evenly with spatula, then sprinkle with remaining streusel.\nBake bread until springy to touch and tester inserted into center comes out clean, about 45 minutes. Cool completely in pan on rack. (Can be made 8 hours ahead. Cover and store at room temperature.) Cut bread into 9 squares and serve.\nButtermilk and baking soda help give the gingerbread a tender texture.",
        "Image_Name":"mango-gingerbread-with-macadamia-streusel-233912"
    },
    {
        "Title":"Chocolate Almond Shortbread",
        "Ingredients":"['1\/2 cup blanched whole almonds (3 oz)', '1 cup all-purpose flour', '5 tablespoons superfine granulated sugar', '2 tablespoons unsweetened cocoa powder (preferably Dutch-process)', '1\/2 teaspoon cinnamon', '1\/4 teaspoon salt', '1 stick (1\/2 cup) unsalted butter, cut into small pieces', 'Confectioners sugar for dusting']",
        "Instructions":"Put oven rack in middle position and preheat oven to 375°F. Pulse almonds with flour, granulated sugar, cocoa, cinnamon, and salt in a food processor until very finely chopped. Add butter and pulse just until a dough forms.\nPress dough evenly into an ungreased 9-inch square baking pan with your fingers. Cut dough into 16 squares with a sharp knife, then cut squares diagonally to make a total of 32 triangles.\nBake until cookies are dry to the touch, 15 to 17 minutes. Transfer pan to a rack and run a thin knife around edge of pan to loosen cookies while hot. Recut hot cookies into triangles, then cool completely in pan. Dust with confectioners sugar just before serving.",
        "Image_Name":"chocolate-almond-shortbread-233816"
    },
    {
        "Title":"Apricot-Orange Shortbread Bars",
        "Ingredients":"['1 cup apricot preserves', '3 tablespoons orange liqueur (such as Grand Marnier)', '1 cup (2 sticks) unsalted butter, room temperature', '3\/4 cup sugar', '1 teaspoon almond extract', '2 cups all purpose flour', '1\/4 teaspoon salt', '1\/4 cup (packed) almond paste (from 7-ounce roll), crumbled', '1\/2 cup sliced almonds, divided']",
        "Instructions":"Preheat oven to 325°F. Butter 9x9x2-inch metal baking pan; line bottom and sides of pan with parchment paper, extending over sides. Butter parchment. Mix preserves and orange liqueur in small bowl; set aside.\nUsing electric mixer, beat 1 cup butter and sugar in large bowl until well blended. Beat in almond extract. Add flour and salt; beat just until blended. Transfer 1 cup of dough to another small bowl; add crumbled almond paste and mix with fingertips until small clumps form. Mix in 1\/4 cup sliced almonds; set aside for topping.\nPress remaining dough evenly onto bottom of prepared pan. Spread preserves mixture evenly over. Using fingertips, coarsely crumble topping over preserves, then sprinkle 1\/4 cup almonds over. Press topping lightly into preserves.\nBake shortbread until top and crust edges are golden brown, about 1 hour. Cool completely in pan on rack. Using parchment paper as aid, lift shortbread from pan. Cut shortbread into 4 equal strips, then cut each strip crosswise into 8 small bar cookies. (Can be prepared ahead. Store in single layer in airtight container at room temperature up to 4 days or freeze up to 2 weeks.)",
        "Image_Name":"apricot-orange-shortbread-bars-233425"
    },
    {
        "Title":"Gingerbread Truffles",
        "Ingredients":"['3\/4 cup whipping cream', '10 whole allspice', '10 whole cloves', '1 tablespoon mild-flavored (light) molasses', '1 1\/2 teaspoons grated peeled fresh ginger', '1\/2 teaspoon ground cinnamon', 'Pinch of salt', '7 ounces plus 12 ounces bittersweet (not unsweetened) or semisweet chocolate, chopped', '7 ounces plus 12 ounces high-quality white chocolate (such as Lindt or Perugina), chopped', '1\/2 cup chopped crystallized ginger plus additional for garnish']",
        "Instructions":"Bring first 7 ingredients just to boil in heavy medium saucepan; remove from heat and let steep 1 hour.\nCombine 7 ounces bittersweet chocolate and 7 ounces white chocolate in large metal bowl set over saucepan of simmering water; stir until chocolate is melted and smooth. Remove bowl from over water. Strain cream mixture into chocolate; stir to blend. Stir in 1\/2 cup chopped crystallized ginger. Chill filling until firm, at least 3 hours.\nLine baking sheet with parchment. Using 1-inch melon baller, scoop filling and roll between palms to form balls. Place on parchment. Chill truffles at least 2 hours.\nLine another sheet with parchment. Place 12 ounces bittersweet chocolate in medium metal bowl set over saucepan of simmering water; stir until chocolate is melted and smooth. Remove bowl from over water. Cool until thermometer inserted into chocolate registers 115°F. Quickly submerge 1 truffle in chocolate. Using fork, lift out truffle and tap fork against side of bowl so excess coating drips off. Using knife, slide truffle off fork and onto prepared sheet. Repeat with remaining truffles. Chill until set.\nLine another baking sheet with parchment. Place 12 ounces white chocolate in another medium metal bowl set over saucepan of simmering water; stir until melted and smooth. Remove bowl from over water. Cool until thermometer inserted into chocolate registers 100°F. Hold 1 truffle between thumb and index finger; dip halfway into white chocolate. Place on prepared sheet. Repeat with remaining truffles. If desired, press small pieces of crystallized ginger atop truffles. Chill until firm, about 30 minutes. (Can be made 1 week ahead. Cover; keep chilled.)",
        "Image_Name":"gingerbread-truffles-233424"
    },
    {
        "Title":"Chocolate-Dipped Shortbread",
        "Ingredients":"['2 sticks (1\/2 pound) unsalted butter, at room temperature', '2\/3 cup sugar', '2 teaspoons vanilla extract', '1\/2 teaspoon salt', '2 1\/4 cups all-purpose flour', '8 ounces high-quality semisweet chocolate, finely chopped']",
        "Instructions":"Arrange racks in upper and lower thirds of oven and preheat to 325°F. Line 2 large cookie sheets with parchment paper.\nIn electric mixer, beat butter, sugar, vanilla, and salt at medium speed just until smooth. Add flour and mix at low speed until combined. Divide dough in half and shape into 2 disks.\nOn lightly floured work surface, roll out 1 piece dough to 1\/4-inch-thick rectangle. Using fluted pastry wheel or large knife, cut into 2- by 1-inch rectangles. Transfer cookies to baking sheets, spacing 1 1\/2 inches apart. Repeat with remaining dough.\nPrick each cookie several times with tines of fork, then chill 10 minutes. Bake until edges are golden, about 15 minutes. Cool on pans 5 minutes, then transfer to racks and cool completely.\nTo decorate: Line baking sheet with clean parchment or wax paper. In medium heatproof bowl set over saucepan of simmering water, melt half chocolate. Add remaining chocolate, remove bowl from heat, and stir occasionally until smooth. Pour into small bowl.\nDip each cookie halfway into chocolate, let excess drip off, and place on baking sheet. Let stand until chocolate is set, about 1 hour. Store in airtight container at room temperature. (Do not refrigerate.)",
        "Image_Name":"chocolate-dipped-shortbread-233311"
    },
    {
        "Title":"Cornbread Stuffing with Ham, Chestnuts, and Sage",
        "Ingredients":"['Stone-Ground Cornbread', '6 tablespoons (3\/4 stick) butter, divided', '8 ounces ham steak, cut into 1\/2-inch dice (about 2 cups)', '2 cups chopped onions', '3 large celery stalks, chopped (about 1 3\/4 cups)', '2 tablespoons chopped fresh sage', '1 7.25-ounce jar steamed peeled chestnuts, coarsely crumbled', '1\/3 cup chopped fresh parsley', '1\/2 teaspoon salt', '1\/2 teaspoon ground black pepper', '1 1\/2 cups (or more) low-salt chicken broth', '2 large eggs', 'Nonstick vegetable oil spray']",
        "Instructions":"Preheat oven to 350°F. Coarsely crumble cornbread onto large rimmed baking sheet. Toast in oven until slightly dried, about 5 minutes. Remove from oven. Maintain oven temperature.\nButter 11x7x2-inch glass baking dish. Melt 1 tablespoon butter in heavy large skillet over medium-high heat. Add diced ham and sauté until browned, about 6 minutes. Transfer ham to large bowl. Melt 4 tablespoons butter in same skillet over medium-high heat. Add onions, celery, and sage; cover and cook until tender, stirring occasionally, about 10 minutes. Transfer vegetable mixture to bowl with ham. Stir in chestnuts, parsley, 1\/2 teaspoon salt, and 1\/2 teaspoon pepper. (Toasted cornbread and ham mixture can be prepared 1 day ahead. Cover and store cornbread at room temperature. Cool ham mixture slightly, then cover and refrigerate.)\nStir crumbled cornbread into ham mixture. Whisk 1 1\/2 cups chicken broth and eggs in medium bowl to blend. Mix into stuffing, adding more chicken broth by tablespoonfuls if dry. Transfer stuffing to prepared baking dish. Dot with remaining 1 tablespoon butter. Spray sheet of foil on 1 side with nonstick spray. Cover cornbread stuffing with foil, sprayed side down. Bake stuffing 40 minutes. Uncover and bake until top begins to brown, about 20 minutes longer.",
        "Image_Name":"cornbread-stuffing-with-ham-chestnuts-and-sage-233155"
    },
    {
        "Title":"Cornbread Casserole and Butternut Squash, Mushrooms, and Ancho Mole",
        "Ingredients":"['3 tablespoons extra-virgin olive oil', '2 1\/2 cups chopped onions', '1 1\/4 pounds assorted wild mushrooms (such as oyster, chanterelle, and portobello), coarsely chopped', '1 1\/2 tablespoons chopped fresh sage', '4 teaspoons chopped fresh thyme', '3 large garlic cloves, chopped', '2 1\/2 teaspoons ground cumin', '4 cups 1\/2-inch cubes seeded peeled butternut squash (about 2 1\/2 pounds)', '2 cups drained rinsed black beans (from two 15-ounce cans)', '2 cups diced tomatoes in juice (from two 14 1\/2-ounce cans)', '1\/2 cup water', '4 cups Masa Harina (corn tortilla mix)', '2\/3 cup yellow cornmeal', '2 1\/4 teaspoons salt', '3\/4 teaspoon baking powder', '4 1\/4 cups (or more) water', '10 tablespoons (1 1\/4 sticks) butter, melted, divided', '2 large eggs', '1 large egg yolk', '2 cups (packed) coarsely grated extra-sharp white cheddar cheese (about 8 ounces)', '3 tablespoons finely chopped fresh Italian parsley', 'Ancho Mole']",
        "Instructions":"Heat oil in large pot over medium-high heat. Add onions; sauté until golden, about 10 minutes. Add mushrooms; sauté until tender, about 10 minutes. Add sage, thyme, garlic, and cumin; stir 1 minute. Add squash, beans, tomatoes with juice, and 1\/2 cup water; bring to boil. Reduce heat to medium, cover, and simmer 8 minutes. Uncover and simmer until vegetables are tender and most of liquid has evaporated but mixture is still very moist, about 12 minutes. Season filling generously with salt and pepper. (Can be made 1 day ahead. Cool slightly. Cover; chill.)\nPreheat oven to 350°F. Butter 15x10x2-inch glass baking dish. Mix Masa Harina, cornmeal, salt, and baking powder in large bowl. Whisk 4 1\/4 cups water, 6 tablespoons melted butter, eggs, and egg yolk in another large bowl to blend. Stir egg mixture into Masa Harina mixture. Stir in cheese and parsley, adding more water by tablespoonfuls as needed to form thick moist dough.\nTransfer 4 cups dough to prepared baking dish. Place large piece of plastic wrap atop dough. Using plastic as aid, press dough evenly over bottom and 3\/4 of the way up sides of dish; peel off plastic. Spoon filling into dough in dish, spreading evenly. Spoon remaining dough in small dollops atop filling. Using offset spatula, gently spread dollops evenly over filling to cover. Press top and bottom dough together at edges to seal, enclosing filling. (Can be made 1 day ahead. Cover; chill.)\nBrush top of casserole with 4 tablespoons melted butter. Bake until dough is light golden and casserole is heated through, about 1 hour (or about 1 hour 15 minutes if chilled). Cool 10 minutes. Cut into squares; serve with Ancho Mole.",
        "Image_Name":"cornbread-casserole-and-butternut-squash-mushrooms-and-ancho-mole-233151"
    },
    {
        "Title":"Scarborough Fair Shortbread",
        "Ingredients":"['1 cup all-purpose flour', '1\/4 cup plus 1\/2 tablespoon superfine granulated sugar', '1\/8 teaspoon salt', '2 teaspoons finely chopped fresh flat-leaf parsley', '1\/2 teaspoon each finely chopped fresh sage, rosemary, and thyme', '1 stick (1\/2 cup) unsalted butter, softened', '1 egg white, lightly beaten', '16 small fresh parsley leaves', '16 very small fresh sage leaves (1\/2 inch)', '16 fresh rosemary leaves', '16 (1-inch) fresh thyme sprigs']",
        "Instructions":"Put oven rack in middle position and preheat oven to 375°F.\nStir together flour, 1\/4 cup sugar, salt, and chopped herbs in a bowl, then add butter and stir with a fork until mixture forms a dough. Divide dough in half and pat each half into a 6 1\/2- to 7-inch round on an ungreased baking sheet. Crimp edges of rounds and cut each into 8 wedges with a sharp knife. Lightly brush with egg white and arrange 1 leaf of each herb on each wedge. Brush herbs lightly with egg white and sprinkle with remaining 1\/2 tablespoon sugar. Prick each wedge once with a fork.\nBake until golden, 15 to 17 minutes. Recut wedges while shortbread is hot, then cool completely on sheet on a rack.",
        "Image_Name":"scarborough-fair-shortbread-232644"
    },
    {
        "Title":"Grilled Cornbread Salad with Red Onions, Arugula, and Red Wine Vinaigrette",
        "Ingredients":"['1\/4 cup red wine vinegar', '3 tablespoons minced shallots', '1 tablespoon Dijon mustard', '2\/3 cup olive oil', 'Nonstick vegetable oil spray', 'Buttermilk Cornbread with Monterey Jack Cheese', 'Olive oil', '2 small red onions, cut into 3\/4-inch-thick rounds', '1 12-ounce container cherry tomatoes, halved', '1 5-ounce package baby arugula', '2 cups (packed) torn fresh basil leaves', '1\/2 English hothouse cucumber, halved lengthwise, then thinly sliced crosswise', '1\/2 cup oil-cured black olives, pitted']",
        "Instructions":"Whisk vinegar, shallots, and mustard in small bowl to blend. Gradually whisk in oil. Season vinaigrette with salt and pepper. (Can be prepared 1 day ahead. Cover and refrigerate. Bring vinaigrette to room temperature and rewhisk before using.)\nSpray grill rack with nonstick spray. Prepare barbecue (medium-high heat). Cut cornbread into 4 squares; remove from pan. Cut each square into four 1-inch-wide strips. Brush cornbread strips lightly on all sides with oil. Grill bread just until grill marks appear, about 1 minute per side. Transfer bread to work surface; cool. Brush onion rounds with oil. Grill until tender and golden, turning once, about 6 minutes per side. Transfer to large bowl; cool.\nCut bread into 1-inch cubes. Separate onion rounds into rings; return onions to same bowl. (Grilled cornbread and onions can be prepared 4 hours ahead; let stand at room temperature.)\nAdd tomatoes, arugula, basil, cucumber, and olives to bowl with onion rings. Add vinaigrette and toss to coat, then add cornbread and toss gently; serve.",
        "Image_Name":"grilled-cornbread-salad-with-red-onions-arugula-and-red-wine-vinaigrette-232371"
    },
    {
        "Title":"Chocolate-Covered Gingerbread Kids",
        "Ingredients":"['1 3\/4 cups plus 2 tablespoons all purpose flour', '2 teaspoons ground ginger', '3\/4 teaspoon ground cinnamon', '1\/2 teaspoon baking powder', '1\/4 teaspoon baking soda', '1\/4 teaspoon ground nutmeg', '1\/4 teaspoon ground cloves', '6 tablespoons (packed) golden brown sugar', '1\/4 cup (1\/2 stick) unsalted butter, room temperature', '3 tablespoons mild-flavored (light) molasses', '1 large egg', '6 ounces semisweet chocolate, chopped', '2 teaspoons vegetable oil', 'Cinnamon decorating candies or chopped crystallized ginger']",
        "Instructions":"Position rack in center of oven and preheat to 325°F. Line 2 large baking sheets with parchment paper. Whisk first 7 ingredients in large bowl to blend. Stir brown sugar, butter, and molasses in medium saucepan over low heat until melted. Increase heat to medium-high and bring to boil, stirring constantly. Remove from heat. Let cool 10 minutes. Whisk egg in medium bowl to blend. Gradually whisk molasses mixture into egg. Using electric mixer, gradually beat molasses mixture into flour mixture until just blended.\nRoll dough out on lightly floured surface to 12x10-inch rectangle. Cut out gingerbread with cookie cutters. Transfer to baking sheets, spacing 1 inch apart. Gather scraps and roll out on lightly floured surface; cut out additional cookies. Repeat until all dough is used.\nBake cookies, 1 sheet at a time, until puffed and tops are firm, about 10 minutes. Cool on sheets 5 minutes. Transfer to rack; cool completely.\nPlace rack over rimmed baking sheet. Stir chocolate and oil in top of double boiler set over barely simmering water until melted. Holding bottom of 1 cookie, dip top into chocolate, allowing excess to drip off. Transfer cookies, chocolate-side up, to prepared rack. Repeat with remaining cookies and chocolate. Decorate cookies with candies or ginger. Chill cookies until chocolate is set, about 30 minutes. (Cookies can be made 3 days ahead. Store in single layer in airtight container in refrigerator.) Let cookies stand at room temperature 15 minutes before serving.",
        "Image_Name":"chocolate-covered-gingerbread-kids-231309"
    },
    {
        "Title":"Old-Fashioned Gingerbread with Molasses Whipped Cream",
        "Ingredients":"['1 cup plus 1 tablespoon sugar', '1\/2 cup (1 stick) unsalted butter, room temperature', '3\/4 cup plus 2 tablespoons mild-flavored (light) molasses', '2 large eggs', '2 cups all purpose flour', '2 teaspoons baking soda', '1 1\/4 teaspoons ground cinnamon', '3\/4 teaspoon ground ginger', '1\/2 teaspoon salt', '1 1\/2 cups chilled whipping cream, divided', '3\/4 cup boiling water']",
        "Instructions":"Preheat oven to 350°F. Butter and flour 9x9x2-inch metal baking pan. Using electric mixer, beat 1 cup sugar and butter in large bowl until blended. Beat in 3\/4 cup molasses, then eggs 1 at a time. Sift in flour, baking soda, cinnamon, ginger, and salt; beat until blended. Beat in 1\/4 cup cream, then 3\/4 cup boiling water. Transfer batter to prepared pan.\nBake cake until tester inserted into center comes out clean, about 45 minutes. Cool cake in pan on rack.\nBeat 1 1\/4 cups cream and 1 tablespoon sugar in medium bowl until peaks form. Fold in 2 tablespoons molasses just until streaks appear (do not overmix). Cut cake into slices; transfer to plates. Serve with molasses whipped cream.",
        "Image_Name":"old-fashioned-gingerbread-with-molasses-whipped-cream-231121"
    },
    {
        "Title":"Green Onion-Jalapeño Cornbread",
        "Ingredients":"['3\/4 cup all purpose flour', '3\/4 cup yellow cornmeal', '1\/4 cup sugar', '1 1\/2 teaspoons salt', '1 1\/2 teaspoons baking powder', '1 teaspoon baking soda', '1\/2 cup thinly sliced green onions', '2 teaspoons minced jalapeño chile with seeds', '1 1\/4 cups buttermilk', '2 large eggs', '1\/4 cup (1\/2 stick) unsalted butter, melted, cooled']",
        "Instructions":"Preheat oven to 350°F. Butter 13x9x2-inch metal baking pan. Whisk flour, cornmeal, sugar, salt, baking powder, and baking soda in large bowl to blend. Stir in green onions and jalapeño. Whisk buttermilk and eggs in medium bowl to blend, then whisk in melted butter. Add buttermilk mixture to dry ingredients and stir just until blended (do not overmix). Transfer batter to prepared pan (batter will come only about 3\/4 inch up sides of pan).\nBake cornbread until lightly browned on top and tester inserted into center comes out clean, about 25 minutes. Transfer pan to rack and cool cornbread completely in pan. (Cornbread can be prepared 1 day ahead. Cover tightly with foil and store at room temperature.)",
        "Image_Name":"green-onion-jalapeno-cornbread-231072"
    },
    {
        "Title":"Gingerbread Snowflakes",
        "Ingredients":"['2\/3 cup molasses (not robust)', '2\/3 cup packed dark brown sugar', '1 tablespoon ground ginger', '1 1\/2 teaspoons ground cinnamon', '1\/2 teaspoon ground allspice', '1\/2 teaspoon ground cloves', '2 teaspoons baking soda', '2 sticks (1 cup) unsalted butter, cut into tablespoon pieces', '1 large egg, lightly beaten', '3 3\/4 to 4 cups all-purpose flour', '1\/2 teaspoon salt', 'Decorating icing', '1 metal offset spatula', '1 pastry bag fitted with 1\/8- to 1\/4-inch plain tip', 'assorted 2- to 3-inch cookie cutters (preferably snowflake-shaped); a metal offset spatula; a pastry bag fitted with 1\/8- to 1\/4-inch plain tip (optional)']",
        "Instructions":"Bring molasses, brown sugar, and spices to a boil in a 4- to 5-quart heavy saucepan over moderate heat, stirring occasionally, and remove from heat. Stir in baking soda (mixture will foam up), then stir in butter 3 pieces at a time, letting each addition melt before adding next, until all butter is melted. Add egg and stir until combined, then stir in 3 3\/4 cups flour and salt.\nPreheat oven to 325°F.\nTransfer dough to a lightly floured surface and knead, dusting with as much of remaining 1\/4 cup flour as needed to prevent sticking, until soft and easy to handle, 30 seconds to 1 minute. Halve dough, then wrap 1 half in plastic wrap and keep at room temperature.\nRoll out remaining dough into a 14-inch round (1\/8 inch thick) on a lightly floured surface. Cut out as many cookies as possible with cutters and carefully transfer with offset spatula to 2 buttered large baking sheets, arranging them about 1 inch apart.\nBake cookies in upper and lower thirds of oven, switching position of sheets halfway through baking, until edges are slightly darker, 10 to 12 minutes total (watch carefully toward end of baking; cookies can burn easily). Transfer cookies to racks to cool completely. Make more cookies with remaining dough and scraps (reroll once).\nPut icing in pastry bag (if using) and pipe or spread decoratively onto cookies.",
        "Image_Name":"gingerbread-snowflakes-107445"
    },
    {
        "Title":"Cinnamon, Brown Sugar, and Walnut Shortbread Crescents",
        "Ingredients":"['2 cups all purpose flour', '1 teaspoon ground cinnamon', '1\/4 teaspoon (generous) salt', '1 cup (2 sticks) unsalted butter, room temperature', '2\/3 cup (packed) golden brown sugar', '1\/2 cup walnuts, toasted, finely chopped', '4 ounces bittersweet (not unsweetened) or semisweet chocolate, chopped']",
        "Instructions":"Whisk first 3 ingredients in medium bowl to blend. Using electric mixer, beat butter and brown sugar in large bowl to blend well. Add dry ingredients; beat just until dough forms clumps. Stir in nuts. Gather dough into ball; flatten into disk. Wrap in plastic; chill at least 2 hours and up to 1 day. Soften slightly at room temperature before rolling out, if necessary.\nLine 3 large baking sheets with parchment paper. Roll out dough on floured surface to 1\/8-inch thickness. Dip 3-inch-long crescent-shaped cookie cutter in flour to coat; cut out cookies. Arrange cookies 1 inch apart on prepared baking sheets. Gather dough scraps and reroll. Cut out additional cookies. Refrigerate cookies on sheets 20 minutes.\nMeanwhile, preheat oven to 300°F. Bake cookies 1 sheet at a time until pale golden and firm to touch, about 25 minutes. Transfer cookies to racks and cool.\nStir chocolate in top of double boiler over barely simmering water until smooth. Remove from over water. Cool chocolate 10 minutes. Place racks with cookies over rimmed baking sheets. Dip spoon into melted chocolate; wave back and forth over cookies to decorate with zigzag pattern. Chill cookies until chocolate is firm, about 20 minutes. (Can be made 5 days ahead. Store airtight between sheets of waxed paper at room temperature.)",
        "Image_Name":"cinnamon-brown-sugar-and-walnut-shortbread-crescents-108974"
    },
    {
        "Title":"Upside-Down Pear Gingerbread Cake",
        "Ingredients":"['2 1\/2 firm pears (preferably Bosc)', '1\/2 stick (1\/4 cup) unsalted butter', '3\/4 cup packed light brown sugar', '2 1\/2 cups all-purpose flour', '1 1\/2 teaspoons baking soda', '1 teaspoon ground cinnamon', '1 teaspoon ground ginger', '1\/2 teaspoon ground cloves', '1\/4 teaspoon salt', '1 cup molasses (preferably mild)', '1 cup boiling water', '1 stick (1\/2 cup) unsalted butter, softened', '1\/2 cup packed light brown sugar', '1 large egg, lightly beaten', 'Accompaniment: vanilla ice cream', 'a well-seasoned 10-inch cast-iron skillet or a 12-inch deep nonstick skillet (handle wrapped with a double layer of foil if not ovenproof)']",
        "Instructions":"Peel and core pears and cut each into 8 wedges.\nMelt butter in skillet over moderate heat until foam subsides. Reduce heat to low, then sprinkle brown sugar over bottom of skillet and cook, undisturbed, 3 minutes (not all sugar will be melted). Arrange pears decoratively over sugar and cook, undisturbed, 2 minutes. Remove from heat.\nPreheat oven to 350°F.\nWhisk together flour, baking soda, cinnamon, ginger, cloves, and salt in a bowl. Whisk together molasses and boiling water in a small bowl. Beat together butter, brown sugar, and egg in a large bowl with an electric mixer at medium speed until creamy, about 2 minutes, then alternately mix in flour mixture and molasses in 3 batches at low speed until smooth.\nPour batter over topping in skillet, spreading evenly and being careful not to disturb pears, and bake in middle of oven until a tester comes out clean, 40 to 50 minutes.\nCool cake in skillet on a rack 5 minutes. Run a thin knife around edge of skillet, then invert a large plate with a lip over skillet and, using pot holders to hold skillet and plate tightly together, invert cake onto plate. Replace any pears that stick to skillet. Serve warm or at room temperature.",
        "Image_Name":"upside-down-pear-gingerbread-cake-106181"
    }
]