[
  {
    "Title": "Cornbread Muffins With Whipped Sweet Corn",
    "Ingredients": "['3 tablespoons coconut oil, plus more for greasing', '6 pitted Medjool dates', 'Boiling water', '¾ cup medium-grind yellow cornmeal', '¾ cup flour', '2 tablespoons coconut palm sugar', '1 tablespoon baking powder', '½ teaspoon fine sea salt', '2 heaping tablespoons freshly ground golden flaxseeds', '1 cup unsweetened oat milk', '3 tablespoons vegan butter', '¼ cup finely diced white onion', '2 cups fresh corn kernels (from about 3 ears)', '2 teaspoons coconut palm sugar', '¼ teaspoon kosher salt, plus more as needed', '½ cup Cashew Cream', 'Fresh lemon juice', 'Freshly ground white pepper', 'Jalapeño Pepper Jelly, for serving']",
    "Instructions": "Make the muffins: Preheat the oven to 400°F. Generously coat nine wells of a standard muffin tin with coconut oil.\nPut the dates in a small heatproof bowl and cover with boiling water. Let soak for about 5 minutes. Drain the dates, reserving the soaking liquid, and transfer them to a food processor. Add 1 tablespoon of the reserved soaking liquid and process, scraping down the sides and adding more of the reserved soaking liquid if necessary, until mostly creamy but with a few chunks remaining.\nPlace the prepared muffin tin in the oven to heat for 5 minutes. Meanwhile, in a large bowl, sift together the cornmeal, flour, sugar, baking powder, and salt. Whisk until blended.\nPut the flaxseeds and 6 tablespoons water in a medium bowl and whisk until well blended. Whisk in the pureed dates and the coconut oil until smooth. Whisk in the oat milk until well combined. Add the oat milk mixture to the cornmeal mixture and stir until just combined.\nWhen the muffin tin is hot, remove it from the oven and immediately scrape the batter into the prepared muffin cups, distributing it evenly among them (they should be a little over three-quarters full).\nBake until the muffins are golden brown, 16 to 18 minutes. Let cool in the tin for about 10 minutes, then transfer to a wire rack to cool a bit more.\nMake the whipped sweet corn: While the muffins are cooling, in a large skillet, melt the butter over medium heat. Add the onion and sauté, stirring often, until soft, 3 to 5 minutes. Add the corn, sugar, and salt and cook, stirring often, until the corn is just tender, about 5 minutes.\nScrape the contents of the skillet into a food processor. Add the cashew cream and process until silky smooth, adding water as necessary to reach the desired consistency. Taste and season with lemon juice, salt, and white pepper. Transfer to a serving bowl. Serve the warm muffins slathered with whipped sweet corn and topped with pepper jelly.",
    "Image_Name": "cornbread-muffins-with-whipped-sweet-corn.jpg"
  },
  {
    "Title": "Flatbread With Avocado and Scallion Salsa",
    "Ingredients": "['1 ½ tsp. sugar', '1 (¼-oz.) envelope active dry yeast (about 2¼ tsp.)', '2½ cups (313 g) all-purpose flour', '½ cup whole-milk plain Greek yogurt', '2 Tbsp. extra-virgin olive oil', '2 tsp. kosher salt', '2 tsp. coriander seeds', '2 tsp. cumin seeds', '8 scallions', '4 Tbsp. plus 1 cup extra-virgin olive oil, divided, plus more for brushing', 'Kosher salt', '1 red or green chile (such as serrano or jalapeño), finely chopped', '1 cup finely chopped parsley', '1 lemon', '4 medium avocados, pits removed', 'Flaky sea salt (optional)', 'Special Equipment: A spice mill']",
    "Instructions": "Stir sugar into ¾ cup warm water in a large bowl. Sprinkle in yeast and let sit until foamy, about 10 minutes.\nAdd flour, yogurt, oil, and kosher salt to sugar mixture and mix until a shaggy dough forms (don’t worry about any dry or unincorporated bits). Cover bowl with a damp kitchen towel and let sit in a warm, dry spot until doubled in size, about 1 hour.\nWhile the dough is rising, toast coriander seeds and cumin seeds in a dry medium skillet over medium heat, shaking often, until fragrant and slightly darkened in color, about 3 minutes. Transfer to a spice mill. Let cool, then coarsely grind. Set spice mixture aside.\nPlace scallions and 1 Tbsp. oil in skillet, season with kosher salt, and cook, turning occasionally, until softened and deeply charred, about 4 minutes. Transfer to a cutting board; trim roots and discard. Finely chop scallions and place in a medium bowl. Add reserved spice mixture, chile, and parsley. Finely grate half of lemon zest into bowl, then cut lemon in half and squeeze in juice. Add 1 cup oil and stir well to combine. Season with kosher salt and let sit while you make the flatbreads.\nTurn out dough onto a lightly dusted surface and divide into 8 equal pieces. Form into balls and, working with 1 ball at a time, roll out into 6\" rounds about ¼\" thick.\nHeat 1 Tbsp. oil in a large skillet over medium-high. Working 1 at a time and adding remaining 2 Tbsp. oil as needed, cook flatbread until bubbles appear over the surface, about 1 minute. Flip and cook until cooked through, about 1 minute. Continue to cook, turning often, until browned in spots on both sides, about 1 minute longer. Transfer to a plate and wrap up in a clean kitchen towel to keep warm.\nTo serve, brush each flatbread with oil. Coarsely smash avocados onto flatbread and spoon salsa over. Sprinkle with sea salt if desired.",
    "Image_Name": "flatbread-with-avocado-and-scallion-salsa.jpg"
  },
  {
    "Title": "Goat Butter Shortbread",
    "Ingredients": "['1 cup (8 ounces) cold goat butter, cubed', '½ cup granulated sugar', '¼ cup toasted wheat germ', '1 ¾ cups unbleached all-purpose flour', '¼ cup whole wheat flour', '½ teaspoon kosher salt', '½ teaspoon sea salt flakes']",
    "Instructions": "Put the butter and sugar into the bowl of a stand mixer and refrigerate until the butter is firm, approximately 30 minutes.\nMeanwhile, heat the oven to 350°F and spread the wheat germ onto a half sheet (13 by 18-inch) pan. Toast until slightly aromatic, approximately 3 minutes. Cool to room temperature.\nIn a bowl, whisk together the flours, salts, and toasted wheat germ. Remove the bowl from the refrigerator. Fit the mixer with the paddle attachment. Add the flour mixture to the butter and sugar and mix on low speed until the dough starts to resemble a coarse meal, 6 to 8 minutes. Increase the speed to medium and mix until the dough just starts to clump around the paddle or to the sides of the bowl, 2 to 3 minutes more. Remove the bowl from the stand mixer. With a plastic bench scraper, bring the dough completely together by hand.\nPlace the dough on a surface lightly dusted with flour. Roll the dough back and forth into a cylinder. Using your fingers, pat the dough into a rectangle. Put a sheet of parchment paper the same dimensions as a half sheet pan on the work surface and dust lightly with flour. Put the dough on top.\nUsing a rolling pin, begin rolling out the dough. If any cracks form in the dough, stop to push them together. To keep the dough from sticking to the parchment paper, dust the top lightly with flour, cover with another piece of parchment paper, and, sandwiching the dough between both sheets of parchment paper, flip the dough and paper over. Peel off the top layer of parchment paper and continue to roll. Roll the dough into a 10 by 12- or 14-inch rectangle approximately ¼ inch thick. If the surface is uneven, roll a pastry roller across the surface to even it out.\nEase the dough and parchment paper onto a half sheet pan. Cover with another piece of parchment paper and refrigerate until firm, at least 20 minutes. Heat the oven to 350°F. Line a couple of half sheet pans with parchment paper.\nLet the dough sit at room temperature for up to 10 minutes. Invert the dough onto a work surface and peel off the top sheet of parchment paper. Roll a dough docker over the dough or pierce it numerous times with a fork.\nUsing a 1 ¾ by 2 ½-inch (or comparable) cookie cutter, cut out the shortbread. Reroll the dough trimmings, chill, and cut out more cookies. If you don’t have a comparable cookie cutter, you can cut out the rectangles with a knife.\nEvenly space 12 to 16 shortbreads on the prepared pan. Place the pan in the oven, lower the temperature to 325°F, and bake for 10 minutes. Rotate the pan and bake until the cookies feel firm to the touch and are slightly brown around the edges, 6 to 8 minutes more. Let the cookies cool entirely on the sheet pan. Repeat with the remaining dough.\nThe cookies can be stored in an airtight container at room temperature for up to 1 week. Dough can be refrigerated for up to 1 week.",
    "Image_Name": "goat-butter-shortbread.jpg"
  },
  {
    "Title": "Sumac and Vanilla Shortbread",
    "Ingredients": "['240g (8 ½ oz) butter, at room temperature', \"120g (4 1⁄4 oz/1 cup) confectioners' sugar\", '360g (12 ¾ oz/2 ¾ cups) all-purpose flour', '1 vanilla pod, seeds scraped out', '½ tsp flaky sea salt', '2 tbsp sumac', '2 tbsp granulated sugar']",
    "Instructions": "Use a food processor or an electric mixer with a paddle attachment to work the butter, icing sugar, flour, vanilla seeds and salt until the mixture just forms a ball of dough. It takes a while to come together, so don’t lose faith. Once it has formed, turn the dough out onto the work surface. Divide into two pieces and shape each one into a log – I prefer to make it rectangular but it is tasty in any shape.\nMix the sumac and sugar on the work surface. Roll the log in the sumac-sugar to coat all over, then place in the fridge to set for at least 1 hour (or freeze it until you want to bake them).\nHeat your oven to 190°C/170°C fan/375°F/gas mark 5. Line two baking trays with baking paper. Use a sharp knife to cut each log into 12–14 slices and place them flat on the trays.\nBake for 10–12 minutes until light golden, then remove from the oven. Leave to cool on the tray before eating.",
    "Image_Name": "sumac-and-vanilla-shortbread.jpg"
  },
  {
    "Title": "Skillet Cornbread With Bacon Fat and Brown Sugar",
    "Ingredients": "['2 ½ cups fine white stone-ground cornmeal', '1 tablespoon baking powder', '1 ½ teaspoons salt', '3 large eggs', '1 ¾ cups buttermilk', '2 tablespoons packed brown sugar', '3 tablespoons rendered bacon fat or lard']",
    "Instructions": "Preheat the oven to 425°F.\nWhisk the cornmeal, baking powder, and salt in a large bowl. Whisk the eggs, buttermilk, and brown sugar in another bowl until smooth.\nWhisk the wet ingredients into the dry ingredients.\nHeat the bacon fat in a 12-inch cast-iron skillet until liquid. Swirl it around to coat the bottom and sides of the skillet, then pour the rest into the batter.\nWhisk the batter until smooth, then pour into the hot skillet. Immediately transfer to the oven.\nBake until golden brown and a toothpick inserted in the center comes out clean, about 25 minutes. Serve warm.",
    "Image_Name": "skillet-cornbread-with-bacon-fat-and-brown-sugar.jpg"
  },
  {
    "Title": "Zebra-Striped Shortbread Cookies",
    "Ingredients": "['2 1/3 cups all-purpose flour, divided', '1 1/2 tsp. kosher salt, divided', '1/3 cup Dutch-process cocoa powder', '1 1/4 cups (2 1/2 sticks) unsalted butter, room temperature', '2/3 cup granulated sugar', '1/4 cup powdered sugar', '1 large egg yolk', '1 tsp. vanilla extract or paste', '1 large egg, beaten to blend', '1/4 cup sanding sugar (any color)']",
    "Instructions": "Whisk 1 1/3 cups flour and 3/4 tsp. salt in a medium bowl. Whisk cocoa powder, remaining 1 cup flour, and remaining 3/4 tsp. salt in another medium bowl. These are the bases for your chocolate and vanilla doughs.\nBeat butter, granulated sugar, and powdered sugar in the bowl of a stand mixer on medium-high speed until light and fluffy, about 4 minutes. Add egg and vanilla and beat until smooth. Divide mixture between the 2 bowls of dry ingredients (about 1 cup in each). Scrape vanilla mixture back into stand mixer bowl (save the mixing bowl) and beat on low speed just until combined. Return to reserved bowl. Repeat process with chocolate mixture.\nArrange 2 large sheets of parchment paper on a work surface. Dollop one-quarter of chocolate dough in the center of each sheet and pat into rough 6x2\" rectangles. Dollop one-quarter of vanilla dough on top of each chocolate slab and pat into rectangles the same size and shape so that you have 2 layers each. Repeat entire process so you have 4 alternating layers. Tightly press stacked dough into cylinders about 1 1/2\" wide and 8\" long, using the parchment to help you. Wrap logs in plastic wrap and chill until very firm, at least 2 hours.\nPlace racks in upper and lower thirds of oven; preheat to 350°F. Working one at a time, unwrap dough and brush with egg. Carefully sprinkle surface with sanding sugar and roll logs in sugar to coat well (really press dough into sugar so it sticks). Slice into rounds a generous 1/4\" thick, rotating after every few cuts to keep slices round. Arrange cookies on parchment-lined baking sheets, spacing 2\" apart. Bake, rotating baking sheets top to bottom and front to back halfway through, until edges are just set, 12–14 minutes. Let cool on baking sheets.\nDough can be made 3 days ahead; keep chilled. Cookies can be baked 5 days ahead; store airtight at room temperature.",
    "Image_Name": "zebra-striped-shortbread-cookies.jpg"
  },
  {
    "Title": "Chocolate Shortbread Slice",
    "Ingredients": "['1/3 cup (80ml) single (pouring/light) cream', '400g dark chocolate, chopped', '100g unsalted butter, chopped', '175g store-bought plain shortbread biscuits/cookies', 'Cocoa powder, for dusting']",
    "Instructions": "Line an 8cm x 20cm loaf tin with non-stick baking paper. Place the cream, chocolate and butter in a medium saucepan over low heat and stir until melted and smooth. Pour one-third of the chocolate mixture into the tin. Arrange half the shortbread in the tin. Pour half the remaining chocolate mixture over the shortbread. Repeat with the remaining shortbread and chocolate and smooth the top. Refrigerate for 3–4 hours or until set. Remove the slice from the tin and dust with cocoa. Slice, using a hot knife, to serve.",
    "Image_Name": "chocolate-shortbread-slice-bars.jpg"
  },
  {
    "Title": "Buttermilk Cornbread",
    "Ingredients": "['Nonstick vegetable oil spray', '2 cups all-purpose flour', '2 cups medium-grind cornmeal', '1/4 cup sugar', '1 Tbsp. baking powder', '2 1/2 tsp. kosher salt', '3/4 tsp. freshly ground black pepper', '4 large eggs', '2 cups buttermilk', '1/2 cup (1 stick) unsalted butter, melted, slightly cooled']",
    "Instructions": "Preheat oven to 400°F. Lightly coat a 13x9\" baking dish with nonstick spray. Whisk flour, cornmeal, sugar, baking powder, salt, and pepper in a large bowl. Whisk eggs, buttermilk, and butter in a medium bowl. Make a well in the dry ingredients and pour in egg mixture; stir into dry ingredients with a wooden spoon until combined. Scrape batter into prepared pan and smooth top.\nBake cornbread, rotating dish halfway through, until a tester inserted into the center comes out clean, 20–25 minutes. Let cornbread cool slightly in dish, then cut crosswise into 4 large pieces. Transfer to a wire rack with a large spatula and let cool completely.\nCornbread can be baked 2 days ahead. Store tightly wrapped at room temperature.",
    "Image_Name": "buttermilk-cornbread.jpg"
  },
  {
    "Title": "Flatbread Caprese",
    "Ingredients": "['2 cups all-purpose flour, plus more for kneading', '1/2 teaspoon active dry yeast', '1 teaspoon sea salt, plus more as needed', '1/4 teaspoon sugar', '1 cup warm water (105°F to 110°F)', 'Extra virgin olive oil', '4 ounces fresh mozzarella, cut into 1/2-inch cubes', '1/2 pint grape tomatoes, sliced into 1/4-inch-thick rounds', 'Handful of fresh basil leaves']",
    "Instructions": "Combine the flour, yeast, salt, and sugar in a large bowl and whisk to blend. Stir in the water until it forms a rough dough.\nSprinkle some flour on a counter or cutting board. Turn the dough out onto the board and sprinkle a bit more flour on top. Knead until the dough becomes a smooth ball, 3 to 4 minutes, adding more flour as needed. Cover the dough with a clean kitchen towel and let it rest on the counter for 10 minutes.\nPreheat the oven to 425°F. Coat a baking sheet with cooking spray.\nRoll the dough into a 9x17-inch rectangle and transfer it to the prepared pan. Drizzle with a bit of olive oil and bake 18 to 20 minutes, until golden and crisp.\nMeanwhile, combine the mozzarella and tomatoes in a medium bowl. Slice the basil into ribbons and add them to the bowl, along with a drizzle of oil. Season with salt.\nTransfer the flatbread to a cutting board. Scatter the mozzarella mixture on top. Cut the flatbread lengthwise, then into triangles. Serve immediately.",
    "Image_Name": "flatbread-caprese-tomato-mozzarella-basil.jpg"
  },
  {
    "Title": "Classic Skillet Cornbread",
    "Ingredients": "['2 1/2 cups coarse-grind cornmeal', '1 1/4 teaspoons baking soda', '1 1/4 teaspoons kosher salt', '1 large egg', '1 2/3 cups buttermilk', '2 tablespoons bacon fat, lard, or unsalted butter', 'Hot Honey Butter (for serving)', 'A 10\"-diameter cast-iron skillet']",
    "Instructions": "Preheat oven to 375°F. Set dry skillet over low heat to heat while you make the batter. Whisk cornmeal, baking soda, and salt in a medium bowl. Make a well in the center and add egg and buttermilk, then whisk vigorously, starting in the center to incorporate egg and working your way out, until dry ingredients are incorporated and batter is smooth.\nIncrease heat to medium-high and add bacon fat to skillet. Swirl to coat bottom and sides of skillet. Whisk batter once more to reincorporate, then pour into skillet and smooth top (batter will sputter around edges).\nBake cornbread in oven until the edges are golden brown and the top is golden, cracked in places, and firm to the touch, 25–30 minutes. Let cool in pan at least 5 minutes before cutting into wedges. Serve with Hot Honey Butter.\nCornbread can be baked 8 hours ahead. Let cool; store tightly wrapped at room temperature.",
    "Image_Name": "classic-skillet-cornbread.jpg"
  },
  {
    "Title": "Gingerbread Brownies",
    "Ingredients": "['Nonstick vegetable oil spray', '2 1/4 cups sugar', '1 1/2 cups unsweetened cocoa powder', '1 teaspoon kosher salt', '1 cup (2 sticks) unsalted butter', '4 large eggs', '3 tablespoons molasses (not robust/blackstrap)', '2 teaspoons vanilla extract', '1 cup all-purpose flour', '2 teaspoons ground cinnamon', '2 teaspoons ground ginger', '1 teaspoon baking powder', '1/2 teaspoon ground cloves']",
    "Instructions": "Place a rack in center of oven; preheat to 350°F. Coat a 9x9\" baking pan with nonstick spray. Line pan with 2 overlapping layers of parchment, leaving a 2\" overhang on all sides. Coat parchment with nonstick spray.\nWhisk sugar, cocoa powder, and salt in a large bowl. Melt butter in a medium heatproof bowl in the microwave or in a medium pot over medium heat. Immediately add hot butter to sugar mixture and stir with a wooden spoon or rubber spatula until smooth. Add eggs one at a time, stirring vigorously with spoon or spatula after each addition, until batter is thick, shiny, and smooth. Stir in molasses and vanilla. Using a sifter or fine-mesh sieve, sift in flour, cinnamon, ginger, baking powder, and cloves. Stir until well incorporated, then beat vigorously for 40 strokes.\nTransfer batter to prepared pan; smooth top. Bake brownie until slightly puffed and top is firm to the touch, edges are set, center is moist but not uncooked, and a tester or paring knife inserted into the center comes out with moist crumbs (not runny batter) attached, 40–45 minutes.\nTransfer to a wire rack and let brownie cool completely in pan. Using parchment overhang, lift brownie out of pan and transfer to a cutting board. Cut into 16 squares.",
    "Image_Name": "gingerbread-brownies.jpg"
  },
  {
    "Title": "Soft Gingerbread Tiles with Rum Butter Glaze",
    "Ingredients": "['6 tbsp (85 g) unsalted butter, at room temperature', '1/3 packed cup plus 2 tbsp (90 g) dark brown sugar', '1/4 cup (100 g) blackstrap molasses', '1 large egg yolk', '1 3/4 cups plus 2 tbsp (235 g) all-purpose flour, plus extra for pressing', '1 tbsp Dutch-processed cocoa powder', '1/2 tsp baking soda', '1 tsp ground ginger', '1/2 tsp ground cinnamon', '1/8 tsp ground cloves', '1/4 tsp salt', '1/4 tsp freshly ground black pepper', \"2/3 cup (80 g) confectioners' sugar\", '1/8 tsp ground cinnamon', '1 tbsp (15 g) unsalted butter, melted and warm', '1 tbsp dark rum (or lemon juice)', '1 tsp warm water']",
    "Instructions": "Place the butter, sugar and molasses in the bowl of an electric mixer with the paddle attachment in place. Beat on medium speed until smooth and incorporated. Add the egg yolk and continue to beat until fully combined.\nSift the flour, cocoa powder, baking soda, ginger, cinnamon, cloves, salt and pepper into a bowl. Turn the speed of the mixer to low, and add the dry ingredients to the butter and molasses. Once the mix comes together, tip the dough onto a lightly floured work surface and knead gently. Roll out the dough so that it is about 1/4 inch/ 0.5 cm thick. If the dough is very soft, you will need to chill it.\nPreheat the oven to 375°F/190°C. Line two baking sheets with parchment paper and set aside.\nDip the cookie stamps in a small bowl of flour, shake off any excess and then press them firmly into the dough, one at a time, to create a deep imprint. How far you need to press to get an imprint will depend on your stamp; the patterns on some are more deeply cut than others. Bear in mind that the cookies rise a little when cooked, so any soft imprints will disappear. Using a round cookie cutter that is slightly larger than the pattern, cut out the pieces of imprinted gingerbread. Transfer the cookies to the lined baking sheets, spaced about 3/4 inch/2 cm apart. Reroll the dough and continue to stamp and cut cookies until all the dough is used up.\nBake for 9–10 minutes, rotating the sheets halfway through, until firm to the touch. They will continue to firm up as they cool, so don’t be tempted to bake them for any longer.\nTo make the rum butter glaze while the gingerbreads are in the oven, as the glaze needs to be brushed onto the cookies while they are still warm, sift the confectioners’ sugar and cinnamon into a small bowl. Add the melted butter, rum (or lemon juice) and water and mix with a spoon until smooth. The glaze will thicken slightly if it sits around, so stir through a little more warm water if you need to—it should be the consistency of runny honey.\nRemove the cookies from the oven, leave them to cool for 5 minutes, then brush or dab the glaze all over with a pastry brush. Transfer to a wire rack to cool completely.\nOnce the dough is made, it can be covered in plastic wrap and kept in the fridge for up to 2 days before baking.\nThese will keep for up to 5 days in an airtight container. The glaze will discolor and crack a little, but this will not affect how they taste.",
    "Image_Name": "soft-gingerbread-tiles-with-rum-butter-glaze.jpg"
  },
  {
    "Title": "Our Favorite Thanksgiving Stuffing with Sausage and Cornbread",
    "Ingredients": "['1/2 cup (1 stick) unsalted butter, plus more for pan', '1/2 pound good-quality day-old crusty country-style or peasant bread, torn into 3/4\" pieces (about 5 cups)', '1/2 pound day-old cornbread, broken into 3/4\" pieces (about 5 cups)', '1 pound breakfast sausage links, casings removed, or ground breakfast sausage mix, broken up into 1/2\" pieces', '2 1/2 cups chopped onions (about 1 medium plus 1 large onion)', '3 medium celery stalks, sliced', '2 large eggs', '2 1/2 cups low-sodium chicken broth', '1/2 cup chopped parsley', '2 tablespoons chopped sage', '1 tablespoon chopped thyme', '2 teaspoons chopped rosemary', '2 teaspoons kosher salt', '1 teaspoon freshly ground black pepper', 'A 13x9x2\" or other 3-quart baking dish']",
    "Instructions": "Preheat oven to 300°F. Butter baking dish; set aside. Arrange bread and cornbread in a single layer on a rimmed baking sheet. Bake, tossing occasionally, until completely dried out, 35–50 minutes. Let cool on baking sheet, then transfer to a very large bowl.\nMeanwhile, heat a large skillet over medium-high. Break sausage into 1/2\" pieces and cook, stirring and breaking up into smaller (about 1/4\") pieces with a wooden spoon or spatula, until browned, 8–10 minutes. Transfer to bowl with bread but do not stir.\nHeat remaining 1 stick butter in same skillet over medium-high. Cook onions and celery, stirring often and scraping browned bits off bottom of pan, until just beginning to brown, about 10 minutes. Add to bowl with bread mixture and let cool.\nWhisk eggs, broth, parsley, sage, thyme, rosemary, salt, and pepper in a medium bowl. Add to bread mixture and fold gently until thoroughly combined.\nIncrease oven temperature to 350°F. Transfer mixture to prepared dish, cover with foil, and bake stuffing until an instant-read thermometer inserted into the center registers 160°F, 40–45 minutes. Uncover and continue to bake until set and top is browned and crisped, 45–50 minutes more.\nStuffing can be assembled, but not baked, 1 day ahead. Cover and chill. When ready to bake, bring to room temperature and bake according to recipe. Stuffing can be baked 1 day ahead. Let cool completely, then cover with foil and chill. Keep covered and bake in a 350°F oven until warmed through, 25–30 minutes. Uncover and bake until top is crisped, 7–10 minutes more.",
    "Image_Name": "our-favorite-thanksgiving-stuffing-with-sausage-and-cornbread.jpg"
  },
  {
    "Title": "Gingerbread Cupcakes with Lemony Frosting",
    "Ingredients": "['1 1/4 cups all-purpose flour', '1 teaspoon baking powder', '1/2 teaspoon baking soda', '3 teaspoons ground ginger', '1 teaspoon ground cinnamon', '1/4 teaspoon ground cloves', '1/4 teaspoon salt', '1/2 cup vegetable oil', '1/3 cup light molasses', '1/2 cup maple syrup', '1/4 cup soy milk', '2 tablespoons soy yogurt', '1 1/2 teaspoons finely grated lemon zest', '1/4 cup finely chopped crystallized ginger', '1/4 cup nonhydrogenated margarine, softened', '1/4 vegan cream cheese, softened', '2 cups confectioners’ sugar', '1 teaspoon vanilla extract', '1 tablespoon of finely grated lemon zest']",
    "Instructions": "Preheat oven to 350°F. Line a muffin pan with paper cupcake liners.\nSift the flour, baking powder, baking soda, ginger, cinnamon, cloves, and salt into a bowl and mix.\nWhisk the oil, molasses, maple syrup, soy milk, yogurt, and lemon zest in a separate large bowl. Add the flour mixture to the wet ingredients and mix just until smooth. Fold in the chopped crystallized ginger.\nFill cupcake liners two-thirds full. Bake for 19 to 22 minutes, until a knife or toothpick inserted into the center comes out clean. Transfer to a cooling rack and let cool completely before frosting.\nCream together margarine and cream cheese until just combined. Use a handheld mixer to whip while adding the confectioners’ sugar in 1/2 cup batches. Mix until smooth and creamy, then in mix in the vanilla. Add the lemon zest. Keep tightly covered and refrigerated until ready to use.",
    "Image_Name": "gingerbread-cupcakes-with-lemony-frosting.jpg"
  },
  {
    "Title": "Babee’s Strawberry Shortbread Valentine’s Cookies",
    "Ingredients": "['6 cups sifted all-purpose flour', '1 teaspoon baking powder', '2 cups unsalted butter', '2 cups sifted confectioners’ sugar', '2 large egg yolks', '1/2 cup orange juice', '1 teaspoon pure vanilla extract', '6 cups strawberry preserves']",
    "Instructions": "Preheat the oven to 350°F. Sift together the flour and baking powder, and set aside.\nIn the bowl of a stand mixer or in a bowl with a handheld electric mixer, cream together the butter and sugar until light and fluffy, approximately 3 to 5 minutes.\nAdd the egg yolks, orange juice, and vanilla extract, and mix slowly.\nAdd the flour mixture to the butter mixture, and mix slowly until a dough forms.\nRemove the dough from the mixer, and knead with your hands until it’s stretchy. Place the dough between two sheets of parchment paper and, using a rolling pin, roll flat.\nRemove the top sheet of parchment paper and cut the dough in half. Punch out the “solid” bottom halves of the cookies on one half of the dough. Punch out the “heart window” top halves of the cookies on the other half of the dough.\nArrange cookies on a cookie sheet lined with parchment paper and bake for 8 to 10 minutes. Remove before browned, and let cool completely.\nCarefully spread strawberry preserves on the solid bottom halves of the cookies, and place the heart window part of each cookie on top. Serve and enjoy!",
    "Image_Name": "strawberry-shortbread-valentines-cookies.jpg"
  },
  {
    "Title": "Spinach-Artichoke Flatbread Pizzas",
    "Ingredients": "['1 cup balsamic vinegar', '6 Flatout Light Italian Herb flatbreads', '3/4 cup Prego Light Homestyle Alfredo sauce', '6 cups baby spinach', '3 cups grape tomatoes, halved', '1 (15-ounce) can quartered artichoke hearts, drained and chopped', '3/4 cup shredded reduced-fat mozzarella cheese (I like Sargento)']",
    "Instructions": "Preheat the oven to 350˚F. Line 2 baking sheets with foil.\nIn a small saucepan, bring the balsamic vinegar to a boil over medium heat. Reduce the heat to medium-low and simmer until the balsamic vinegar starts to thicken and has reduced by half, 20 to 25 minutes.\nMeanwhile, lay out the flatbreads on the prepared baking sheets and coat with cooking spray. Bake for 5 to 6 minutes. Remove from the oven but leave the oven on.\nSpread 2 tablespoons Alfredo sauce evenly onto each flatbread. Top each with 1 cup spinach, 1/2 cup grape tomatoes, 1/4 cup artichokes, and 2 tablespoons mozzarella.\nReturn to the oven and bake until the cheese is melted, 7 to 9 minutes. Remove from the oven and drizzle the balsamic reduction evenly over each pizza.",
    "Image_Name": "spinach-artichoke-flatbread-pizzas.jpg"
  },
  {
    "Title": "Grape and Rosemary Flatbread",
    "Ingredients": "['1 (16-ounce) homemade or store-bought pizza dough', '1 tablespoon truffle oil', '2 teaspoons fresh rosemary, chopped', '2/3 cup red grapes, halved', '1/2 teaspoon finishing salt', '2 tablespoons crumbled feta cheese']",
    "Instructions": "Preheat the oven to 500˚F. Line a baking sheet with parchment paper and lightly dust with flour.\nTake the pizza dough out of refrigerator 30 minutes before using. With a sharp knife, cut the dough in half. Stretch the dough into two long rectangles (about 6x11 inches each) on the parchment paper. Brush with truffle oil. Sprinkle with rosemary, grapes, salt, and feta. Bake for 8 to 10 minutes. Remove from the oven and cut into slices.",
    "Image_Name": "grape-and-rosemary-flatbread.jpg"
  },
  {
    "Title": "Skillet Cornbread With Chives",
    "Ingredients": "['2 cups coarse-grind cornmeal', '2 tablespoons sugar (optional)', '1 teaspoon kosher salt', '1/2 teaspoon baking powder', '1/2 teaspoon baking soda', '1 large egg', '1 1/2 cups buttermilk', '1 tablespoon lard or vegetable oil', '1/2 cup (1 stick) unsalted butter, room temperature', '2 tablespoons finely chopped chives', 'Flaky sea salt (for serving)', 'A 10-inch cast-iron skillet']",
    "Instructions": "Place a rack in middle of oven and set skillet on rack; preheat to 450°F.\nMeanwhile, whisk cornmeal, sugar (if using), kosher salt, baking powder, and baking soda in a large bowl to combine. Whisk egg and buttermilk in a medium bowl; add to dry ingredients and mix to incorporate.\nCarefully remove skillet from oven, add lard, and swirl in pan to coat. Scrape batter into skillet (it should sizzle around edges on contact). Bake cornbread until top is golden brown and center is firm, 15–20 minutes. Let cool 15 minutes before serving.\nSpread butter over cornbread, top with chives, and sprinkle with sea salt.",
    "Image_Name": "skillet-cornbread-with-chives.jpg"
  },
  {
    "Title": "Apple Gingerbread Cake With Cream",
    "Ingredients": "['3 tablespoons plus 1/2 cup unsalted butter, plus more for pan', '1 cup (packed) light brown sugar, divided', '1 pound lady apples, unpeeled, very thinly sliced, seeds removed, divided', '2 cups all-purpose flour', '1 1/2 teaspoons baking powder', '1 1/2 teaspoons kosher salt', '1 1/2 teaspoons ground cinnamon', '1/2 teaspoon ground cloves', '1/2 teaspoon ground nutmeg', '1/2 cup robust-flavored (dark) molasses', '1/2 cup pure maple syrup', '2 large eggs, room temperature', '2 tablespoons finely grated peeled ginger', '1 1/2 teaspoons baking soda', '1/2 cup heavy cream, plus more for serving', 'A 10-inch springform pan']",
    "Instructions": "Preheat oven to 350°F. Butter pan and line bottom with a parchment round; butter parchment. Heat 1 Tbsp. butter, 1/2 cup brown sugar, and 2 Tbsp. water in a large skillet over medium, stirring constantly, until butter is melted and sugar is dissolved. Cook, without stirring but swirling skillet often, until large bubbles that are slow to pop form, about 2 minutes. Pour caramel into prepared pan and tilt pan to evenly coat bottom.\nMelt 1 Tbsp. butter in same skillet over medium heat; add half of apples and toss to separate. Cook, tossing often, until apples are softened and almost translucent, about 4 minutes. Repeat process with another 1 Tbsp. butter and remaining apples. Let apples sit until cool enough to handle, then arrange over caramel in several overlapping layers. Set pan aside.\nWhisk flour, baking powder, salt, cinnamon, cloves, and nutmeg in a large bowl to combine; set aside. Heat molasses, maple syrup, remaining 1/2 cup brown sugar, and remaining 1/2 cup butter in a heatproof bowl set over a saucepan of barely simmering water, stirring constantly, until butter is melted and mixture is smooth. Whisk in eggs and ginger. Stir baking soda into 1/4 cup very hot water in a small bowl until dissolved, then whisk into molasses mixture. Whisk molasses mixture into reserved dry ingredients and scrape batter over apples, spreading evenly. Evenly drizzle 1/2 cup cream over batter.\nPlace cake on a foil-lined rimmed baking sheet and bake until center is firm to the touch and a cake tester inserted into the center comes out clean, 35–45 minutes. Transfer pan to a wire rack and let cake cool in pan 15 minutes. Run a paring knife around the sides of cake to loosen, then remove the sides of pan and invert cake onto rack. Carefully remove pan and peel away parchment (apples might stick, so work slowly). Let cool completely.\nSlice cake into wedges and serve drizzled with more cream.\nCake can be baked 1 day ahead. Store tightly covered at room temperature. To revive apples, reheat cake slightly in a microwave and brush top with maple syrup.",
    "Image_Name": "apple-gingerbread-cake-with-cream.jpg"
  },
  {
    "Title": "Plantain Flatbread With Poached Egg and Honey Drizzle",
    "Ingredients": "['1 medium green/slightly yellow plantain, peeled and cut up', '3 or 4 eggs', 'Sea salt', 'Freshly ground black pepper', 'Honey', 'Garnish: Thinly sliced chives']",
    "Instructions": "Preheat the oven to 375ºF. Grease a 9x9-inch baking pan with coconut oil.\nIn a high-speed blender, combine the plantain, 2 of the eggs, and a pinch of salt and blend until smooth.\nPour this mixture into the baking pan and bake for 25 to 30 minutes, until set and a toothpick inserted into the center comes out clean (or lift up the sides to check for doneness).\nPoach 1 or 2 eggs (depending on how many you are serving). Serve the plantain flatbread topped with the poached egg(s).\nSprinkle with salt and pepper to taste, and a drizzle of honey. Garnish as desired.",
    "Image_Name": "plantain-flatbread-with-poached-egg-and-honey-drizzle.jpg"
  },
  {
    "Title": "Iron-Skillet Cornbread",
    "Ingredients": "['1 1/4 cups all-purpose flour', '1 cup fine-grind cornmeal', '1 tablespoon baking powder', '1 1/2 teaspoons kosher salt', '4 large eggs', '1 1/2 cups canned creamed corn (from one 15-ounce can)', '1 (4.5-ounce) can mild green chiles, drained, chopped', '1 1/2 ounces mild white cheddar, grated (about 1/2 cup)', '1 1/2 ounces Monterey Jack, grated (about 1/2 cup)', '3/4 cup unsalted butter (1 1/2 sticks), room temperature', '2/3 cup sugar', 'Nonstick vegetable oil spray', 'A 10-inch cast-iron skillet (measured from the rim)']",
    "Instructions": "Place rack in middle of oven. Set skillet on a rimmed baking sheet, place on rack, and preheat oven to 400°F. Whisk flour, cornmeal, baking powder, and salt in a small bowl to combine. Lightly beat eggs in a medium bowl to blend; whisk in creamed corn, chiles, cheddar, and Monterey Jack.\nMix butter and sugar in a large bowl with a wooden spoon just until butter absorbs sugar but butter is still in small pieces. Add egg mixture and mix until just combined. Mix in dry ingredients until barely incorporated.\nRemove skillet from oven and lightly coat with nonstick spray. Scrape in batter (it should sizzle on contact and stay slightly mounded in the center). Bake cornbread until top is golden brown and springs back when gently pressed, 35–45 minutes. Let cool 10 minutes before serving.",
    "Image_Name": "hillstone-iron-skillet-cornbread.jpg"
  },
  {
    "Title": "Flatbread with Smoked Trout, Radishes, and Herbs",
    "Ingredients": "['3 cups plain whole-milk yogurt', 'Vegetable oil (for grill)', '1/2 Garlic-Herb Naan or 1 pound store-bought pizza dough, room temperature, halved', '2 (5-ounce packages) smoked trout, coarsely flaked', '4 radishes, trimmed, thinly sliced on a mandoline', '1/4 cup coarsely chopped dill', '2 tablespoons sliced chives', 'Flaky sea salt', 'Freshly ground black pepper', 'Lemon wedges (for serving)', 'Cheesecloth']",
    "Instructions": "Line a fine-mesh sieve with cheesecloth and set over a medium bowl. Place yogurt in sieve, cover with plastic wrap, and let drain in refrigerator at least 1 day and up to 2 days if you want it slightly thicker. Discard excess liquid. (Or skip this step entirely and use 1 1/2 cups store-bought labneh instead.)\nPrepare a grill for medium-high, indirect heat (for a charcoal grill, bank coals on one side of grill; for a gas grill, leave one or two burners off); lightly oil grate. Working with 1 piece of dough at a time, gently stretch to about a 10x8\" oval. Grill over direct heat, turning and rotating as needed, until bread is stiff and both sides are lightly charred, about 3 minutes total. Move to indirect heat to keep warm while you grill remaining piece of dough.\nTransfer both flatbreads to a work surface and spread drained yogurt over. Top with trout, radishes, dill, and chives. Sprinkle with salt and pepper and serve with lemon wedges for squeezing over.\nYogurt can be drained 1 week ahead. Cover and chill.",
    "Image_Name": "flatbread-with-smoked-trout-radishes-and-herbs.jpg"
  },
  {
    "Title": "3-Ingredient Flaky Flatbread",
    "Ingredients": "['2 cups plus 1 tablespoon all-purpose flour', '1 teaspoon kosher salt', '1/2 teaspoon baking powder', 'Olive oil (for greasing)', '1 cup (2 sticks) unsalted butter, softened, divided']",
    "Instructions": "Whisk flour, salt, and baking powder in a large bowl. Make a well in the center and slowly add 2/3 cup water, mixing with your hands or a wooden spoon, until a shaggy dough forms. Knead dough in bowl until smooth and elastic, about 4 minutes. Transfer dough to a clean work surface. Wipe out bowl and grease lightly with oil. Return dough to bowl, cover with a kitchen towel, and let rest 30 minutes.\nTurn out dough onto a clean work surface. Using a bench scraper or large knife, cut into 6 equal pieces. Shape into balls, cover, and let rest 15 minutes more.\nGrease a large cookie sheet or the underside of a rimmed baking sheet with 1 Tbsp. butter. Line another rimmed baking sheet with parchment.\nPlace 1 piece of dough on prepared cookie sheet. Pat down to a flat oval with your fingertips, then smear 2 Tbsp. butter over dough. Press and slide dough outward with your fingertips, stretching to a very thin oval, about 12x10\".\nStarting at 1 long end, roll dough over itself to create a long tube about 1\" wide; flatten slightly. Starting at 1 short end, roll into a coil like a jelly roll. Transfer to parchment-lined sheet; cover with a kitchen towel. Repeat with remaining dough. Freeze, covered, 15 minutes.\nWorking one at a time, turn coil on its side and flatten to a disc with your palm. Using a rolling pin, roll into a rough oval about 8x4\". Transfer to freezer. Repeat with remaining coils and freeze until ready to use.\nHeat 1 Tbsp. butter in a griddle or large nonstick skillet over medium-high. Add 2 pieces of dough, reduce heat to medium, and cook flatbread until bottom is golden brown with large bubbles forming underneath, about 3 minutes. Flip and continue to cook until second side is golden brown, about 1 minute more. Repeat with remaining dough, adding 1 Tbsp. butter before each batch.",
    "Image_Name": "3-ingredient-flaky-flatbread.jpg"
  },
  {
    "Title": "Flatbread with Fava Beans, Cucumbers, and Burrata",
    "Ingredients": "['2 cups shelled fava beans (from about 2 pounds pods)', 'Kosher salt', '2 tablespoons fresh lemon juice', '2 tablespoons olive oil, plus more for grill', 'Freshly ground black pepper', '2 Persian cucumbers, thinly sliced', '2 tablespoons unseasoned rice vinegar', '1/2 Garlic-Herb Naan or 1 pound store-bought pizza dough, room temperature, halved', '2 (8-ounce) balls burrata or fresh mozzarella, drained', 'Basil leaves (for serving)', '1 teaspoon toasted sesame seeds', 'Flaky sea salt']",
    "Instructions": "Cook fava beans in a medium saucepan of boiling salted water until tender, about 4 minutes. Using a mesh sieve, transfer to a colander set in a bowl of ice water. Drain and peel. Combine lemon juice, 2 Tbsp. oil, and half of fava beans in a medium bowl and lightly mash with a fork. Stir in remaining fava beans; season with kosher salt and pepper.\nCombine cucumbers and vinegar in a medium bowl; season with kosher salt. Let sit until slightly softened, 10–12 minutes.\nPrepare a grill for medium-high, indirect heat (for a charcoal grill, bank coals on one side of grill; for a gas grill, leave one or two burners off); lightly oil grate. Working with 1 piece of dough at a time, gently stretch to about a 10x8\" oval. Grill over direct heat, turning and rotating as needed, until bread is stiff and both sides are lightly charred, about 3 minutes total. Move to indirect heat to keep warm while you grill the remaining piece of dough.\nTransfer flatbreads to a work surface. Tear burrata into pieces and divide between flatbreads; top with fava bean mixture, cucumbers, and basil. Sprinkle with sesame seeds, sea salt, and pepper.\nFava beans can be cooked 3 days ahead. Cover and chill.",
    "Image_Name": "flatbread-with-fava-beans-cucumbers-and-burrata.jpg"
  },
  {
    "Title": "Artichoke, Spinach, and Prosciutto Flatbreads with Spicy Honey",
    "Ingredients": "['3 tablespoons olive oil', '4 garlic cloves, thinly sliced', '2 tablespoons finely chopped flat-leaf parsley', '1 (10-ounce) package frozen spinach, thawed', '1 (9-ounce) package frozen artichoke hearts, thawed', 'Kosher salt, freshly ground black pepper', '2 tablespoons finely grated lemon zest', 'Cornmeal (for pans)', '1 pound frozen pizza dough, thawed', 'All-purpose flour (for surface)', '1/2 pound Parmesan cheese, grated on the large holes of a box grater (about 2 cups), divided', '3 tablespoons honey', '1 1/2 teaspoons red pepper flakes', '2 ounces thinly sliced prosciutto']",
    "Instructions": "Position racks in middle and upper third of oven and preheat to 475ºF.\nHeat oil in large heavy skillet over medium. Add garlic and parsley and cook, stirring, 30 seconds. Add spinach and artichokes, toss to coat, and cook, covered, until artichokes are tender, 10–12 minutes. Uncover and simmer, stirring occasionally, until juices thicken, about 2 minutes. Season with 1/2 tsp. salt and a pinch of black pepper. Remove from heat and stir in lemon zest.\nSprinkle 2 rimless baking sheets with cornmeal. Roll out half of the dough on floured surface to a 12x7\" oval. Transfer to baking sheet. Repeat with remaining dough.\nSprinkle each round with 1/2 cup Parmesan, then top evenly with artichoke and spinach mixture. Top with remaining 1 cup Parmesan and season with a pinch of salt and black pepper. Bake, rotating sheets halfway through, until crust is golden brown, 20–22 minutes.\nMeanwhile, combine honey and red pepper flakes in a small bowl.\nRemove flatbreads from oven. Top with prosciutto and drizzle with spicy honey. Cut flatbreads into wedges and serve.",
    "Image_Name": "artichoke-spinach-and-prosciutto-flatbreads-with-spicy-honey.jpg"
  },
  {
    "Title": "Falafel-Spiced Tomatoes and Chickpeas on Flatbread",
    "Ingredients": "['2 garlic cloves, finely chopped', '1 teaspoon sumac', '1/2 teaspoon crushed red pepper flakes', '1/2 teaspoon ground coriander', '1/2 teaspoon ground cumin', '1 teaspoon kosher salt, plus more', '2 large heirloom tomatoes, any color, thinly sliced', '1 (15.5–ounce) can chickpeas, rinsed', '2 tablespoons red wine vinegar', 'Freshly ground black pepper', '1 small shallot, thinly sliced', '1/2 cup parsley leaves with tender stems', '3 tablespoons olive oil', '1 Persian cucumber, peeled, chopped', '3/4 cup plain yogurt', '1/2 cup coarsely chopped fresh mint', '1/2 cup coarsely chopped fresh parsley', 'Kosher salt, freshly ground pepper', 'Flatbread and assembly', '2 teaspoons kosher salt', '3/4 teaspoon baking powder', '1/2 teaspoon sugar', '2 cups all-purpose flour, plus more for surface', '1 cup plain yogurt', '4 tablespoons olive oil, plus more for drizzling', 'Freshly ground black pepper', 'Sumac, a tart, citrusy spice, can be found at Middle Eastern markets and specialty foods stores.']",
    "Instructions": "Combine garlic, sumac, red pepper flakes, coriander, cumin, and 1 teaspoon salt in a small bowl. Arrange tomato slices in a single layer on a rimmed baking sheet and sprinkle garlic mixture evenly over top. Let sit at room temperature at least 30 minutes and up to 1 hour.\nToss chickpeas and vinegar in a medium bowl; season with salt and pepper. Mash chickpeas with a fork until about half are smashed. Add shallot, parsley, and oil and toss to combine; season with salt and pepper. Set aside.\nCombine cucumber, yogurt, mint, and parsley in a medium bowl; season with hot sauce, salt, and pepper. Let sit at room temperature at least 15 minutes.\nYogurt sauce can be made 1 hour ahead. Cover and chill.\nWhisk salt, baking powder, sugar, and 2 cups flour in a large bowl. Add yogurt and stir to combine (the yogurt's acidity ensures a tender texture). Transfer dough to a lightly floured work surface and knead until mostly smooth, about 1 minute. Divide into 4 pieces, cover with plastic wrap, and let rest 15 minutes (this will make dough easier to roll).\nWorking one at a time, roll out each piece of dough into a round about 1/8\" thick. (Don't stress: They don't need to be perfect.) Heat 1 tablespoon oil in a large skillet, preferably cast iron, over medium.\nWorking one at a time, cook rounds of dough until underside is golden brown and flatbread is beginning to puff, about 2 minutes. Flip and cook until other side is golden brown, about 1 minute longer; transfer to a plate. Repeat with remaining oil and rounds of dough. Let cool slightly.\nTop each flatbread with yogurt sauce, chickpea mixture, and tomatoes. Drizzle with more oil and season well with salt and pepper.",
    "Image_Name": "falafel-spiced-tomatoes-and-chickpeas-on-flatbread-56389870.jpg"
  },
  {
    "Title": "Lavender Shortbread with Fruits, Flowers, and Herbs",
    "Ingredients": "['3 large egg whites', '4 cups powdered sugar', '1/2 teaspoons cream of tartar', '1/3 cup rice flour', '1 1/2 teaspoons kosher salt', '2 1/2 cups all-purpose flour', '1 cup plus 6 tbsp unsalted butter, cut into pieces, room temperatur', '3/4 cup granulated sugar', '1 teaspoon coarsely ground dried lavender', 'Freeze-dried and/or dried fruits, dried edible flowers, fresh and/or dried herbs (for decorating)', 'One 3 1/8\"-diameter and one 1 1/4\"-diameter fluted cutter']",
    "Instructions": "Using a wooden spoon or rubber spatula, stir egg whites, powdered sugar, and cream of tartar in a medium bowl until a thick paste forms with no dry spots. Ideally, glaze should sit at least 12 hours for sugar to fully hydrate, but it can be used as soon as cookies have cooled. Or, you can cover and chill up to 1 week. Bring to room temperature before using.\nWhisk rice flour, salt, and 2 1/2 cups all-purpose flour in a medium bowl. Using an electric mixer on medium-high, beat butter, sugar, and lavender in a medium bowl until very pale and fluffy, about 5 minutes. Mix in dry ingredients on low until fully combined. Wrap in plastic and chill at least 2 hours and up to 2 days. Preheat oven to 350°. Roll out dough between 2 sheets of lightly floured parchment to 1/8\" thick. Using large cutter, cut out 16 rounds, rerolling scraps. Using small cutter, punch out centers. Bake on parchment-lined baking sheets until edges are golden, 12-14 minutes. Let cool on a wire rack.\nWorking quickly, dip tops of cookies into glaze, letting excess drip off. Transfer to wire rack and decorate.",
    "Image_Name": "lavender-shortbread-with-fruits-flowers-and-herbs-51259280.jpg"
  },
  {
    "Title": "Cornbread, Chorizo, Cherry, and Pecan Stuffing",
    "Ingredients": "['3/4 cup (1 1/2 sticks) unsalted butter, cut into pieces, divided, plus more', '1/4 cup white wine vinegar', '1/2 cup dried tart cherries', '10 cups coarsely crumbled cornbread, preferably homemade, dried out overnight', '1/3 cup coarsely chopped pecans', '1/4 cup olive oil', '1 pound fresh chorizo, casings removed', '2 medium onions, chopped', '4 celery stalks, chopped', 'Kosher salt, freshly ground pepper', '2 garlic cloves, finely chopped', '2 tablespoons finely chopped fresh sage', '2 large eggs', '3 cups chicken stock or low-sodium chicken broth, divided', '1/4 cup finely chopped fresh parsley']",
    "Instructions": "Preheat oven to 400°. Butter a shallow 3-quart baking dish and a sheet of foil. Bring vinegar and 2 tablespoons water to a boil in a small saucepan; remove from heat and add cherries. Let sit until cherries are plump, 15-20 minutes.\nMeanwhile, spread out cornbread on a rimmed baking sheet and toast until golden brown, 10–15 minutes. Let cool. Place in a very large bowl.\nDrain cherries, reserving soaking liquid, and add cherries to bowl with cornbread (do not mix).\nReduce oven temperature to 350°. Toast pecans on a clean rimmed baking sheet, tossing once, until fragrant and slightly darkened, 8–10 minutes. Let cool; add to bowl.\nMeanwhile, heat oil in a large skillet over medium-high. Cook chorizo, stirring occasionally and breaking into small pieces with a spoon, until browned and cooked through, 8–10 minutes. Transfer to bowl with a slotted spoon.\nAdd onions and celery to skillet, season with salt and pepper, and cook, stirring often, until onions are golden brown and soft, 10–12 minutes. Add garlic and sage; cook, stirring, until fragrant, about 2 minutes. Transfer to bowl.\nReduce heat to medium and cook reserved cherry soaking liquid in skillet, scraping up any browned bits, until almost all evaporated, about 1 minute. Add 1/2 cup butter; cook, stirring, until melted. Drizzle over bread mixture.\nWhisk eggs and 2 cups stock in a medium bowl; pour over cornbread mixture. Add parsley, season with salt and pepper, and gently toss, adding more stock 1/4-cupful at a time as needed (you may not use it all), until combined and cornbread is hydrated. Mix carefully to avoid breaking cornbread into crumbs. Transfer to prepared dish and dot with remaining 1/4 cup butter.\nCover with buttered foil; bake until a paring knife inserted into the center comes out hot, 30–35 minutes. Increase oven temperature to 450°. Uncover and bake until top is golden brown and crisp, 20–25 minutes. Let sit 10 minutes before serving.\nDo ahead: Stuffing can be assembled 1 day ahead. Cover and chill.",
    "Image_Name": "cornbread-chorizo-cherry-and-pecan-stuffing-51255140.jpg"
  },
  {
    "Title": "Dutch Oven Cornbread with Fig Jam",
    "Ingredients": "['3/4 cup (1 1/2 sticks) unsalted butter', '1 1/2 cups all-purpose flour', '1 1/2 cups cornmeal', '1/4 cup sugar', '2 teaspoon baking soda', '2 teaspoon kosher salt', '1/2 teaspoon baking powder', '3 large eggs', '1 cup whole milk', '3/4 cup fig jam']",
    "Instructions": "Preheat oven to 425°. Place butter in a 10\"-12\"-diameter Dutch oven, cover, and place in oven to heat pot and melt butter, 6-8 minutes (don't let butter burn). Swirl butter to coat bottom and partway up sides of pan; pour butter into a small bowl and set aside.\nMeanwhile, whisk flour, cornmeal, sugar, baking soda, salt, and baking powder in a large bowl. Whisk eggs and milk in a medium bowl; add to cornmeal mixture along with reserved melted butter and whisk to combine. Scrape batter into hot Dutch oven.\nCover and bake until cornbread has started to set around edges, 10-12 minutes. Dot surface with jam. Cover and bake until a tester inserted into the center comes out clean, 15-20 minutes longer. Let cool, uncovered, 15 minutes. To serve, cut cornbread into wedges.",
    "Image_Name": "dutch-oven-cornbread-with-fig-jam-51238440.jpg"
  },
  {
    "Title": "Gingerbread",
    "Ingredients": "['2 cups all-purpose flour', '1 1/2 teaspoons ground ginger', '1 teaspoon baking soda', '1/2 teaspoon cinnamon', 'Scant 1/2 teaspoon salt', '1 stick unsalted butter, softened', '3/4 cup packed dark brown sugar', '1 large egg', '1/2 cup mild molasses (not robust or blackstrap)', '3/4 cup well-shaken buttermilk', '1/2 cup hot water', 'lightly sweetened whipped cream']",
    "Instructions": "Preheat oven to 350°F with rack in middle. Butter a 9-inch square baking pan.\nWhisk together flour, ginger, baking soda, cinnamon, and salt in a bowl. Beat butter and sugar with an electric mixer at medium speed until pale and fluffy. Beat in egg until blended, then beat in molasses and buttermilk. Mix in flour mixture on low speed until smooth, then add hot water and beat 1 minute (batter may look curdled.)\nSpread batter evenly in pan and bake until a wooded pick inserted into center comes out clean, 40 to 45 minutes. Cool in pan on a rack.",
    "Image_Name": "gingerbread-51210010.jpg"
  },
  {
    "Title": "Gingerbread Cookie Sandwiches",
    "Ingredients": "['3 1/2 cups all-purpose flour', '1 1/2 teaspoons baking soda', '1/4 teaspoon kosher salt', '1 1/2 teaspoons ground ginger', '1 teaspoon ground cinnamon', '1/4 teaspoon ground cloves', '1/4 teaspoon ground allspice', '1 cup unsalted butter, at room temperature', '1 cup (firmly packed) dark brown sugar', '1/2 cup granulated sugar', '1 large egg', '1/4 cup molasses', '1/3 cup unsalted butter, at room temperature', '1/2 teaspoon pure vanilla extract', '1/8 teaspoon kosher salt', \"1 1/2 cups confectioners' sugar\", '1 tablespoon milk, plus more as needed']",
    "Instructions": "1. In a large bowl, combine the flour, baking soda, salt, and spices; set aside. In the bowl of a stand mixer, beat the butter and sugars together until they appear light and fluffy. Add the egg and mix to combine. Add the molasses and mix to combine, scraping down the sides of the bowl once if needed.\n2. Working in three batches, add the dry ingredients, mixing between each addition until just incorporated. Remove the dough and turn it out onto a sheet of plastic wrap; form into a disk, wrap tightly and refrigerate until firm, at least 2 hours. (Dough can be made up to 1 day ahead.)\n3. Preheat the oven to 350°F. Remove the dough and cut it in half. Re-wrap one half and place back in the fridge; let the other sit at room temperature a few minutes to soften slightly. Lightly flour a work surface and your rolling pin, and roll out the dough to 1/4-inch thick.\n4. Line a baking sheet with parchment paper. Using cookie cutters, cut out the gingerbread men, and transfer to the prepared sheets. (If the dough feels very soft, refrigerate the gingerbread men on the baking sheet for 15 minutes before placing in the oven to bake.) Bake until cookies appear firm and like they're just starting to crisp, 12 to 15 minutes. Remove and let cool on the sheet 5 minutes, then transfer to racks to cool completely.\n5. Meanwhile, make the sandwich filling. Beat together the butter, vanilla, and salt until fluffy. Add the confectioners' sugar in 2 batches and beat on low speed until incorporated. Add the milk and beat until the mixture is thick but spreadable, adding more milk in 1 teaspoon increments as needed. Spread some of the icing onto half of the cooled gingerbread men; sandwich each with another cookie.",
    "Image_Name": "gingerbread-cookie-sandwiches-51205820.jpg"
  },
  {
    "Title": "Rosemary and Toasted-Caraway Shortbread",
    "Ingredients": "['1 teaspoon caraway seeds', '1 cup (2 sticks) chilled unsalted butter, cut into 1/2\" pieces', '1/2 cup granulated sugar', '1/4 cup powdered sugar', '1/2 teaspoons kosher salt', '2 1/2 cups all-purpose flour', '2 teaspoons finely chopped fresh rosemary, plus whole leaves', '1 large egg, beaten to blend', 'Coarse sanding sugar (for sprinkling)']",
    "Instructions": "Preheat oven to 350°F. Toast caraway seeds in a small dry skillet over medium-high heat, tossing occasionally, until fragrant, about 2 minutes. Coarsely chop; set aside.\nUsing an electric mixer on medium-high speed, beat butter, granulated sugar, powdered sugar, and salt until very light and fluffy, 7–10 minutes (beating air into butter makes for tender shortbread). Reduce speed to low and add flour, caraway, and 2 teaspoons chopped rosemary; mix just to combine. Dough will look shaggy and a little dry (it's not!).\nPress dough into two 8\"-diameter cake pans. Brush with egg, sprinkle with sanding sugar, and top with rosemary leaves.\nBake until shortbread is golden brown and sides pull away from pan, 20–25 minutes. Transfer pan to a wire rack; let cool in pan before turning out and cutting into wedges or bars.\nMAKE AHEAD: Shortbread dough can be made 1 month ahead; wrap tightly and freeze. Shortbread can be baked 1 week ahead; store wrapped tightly at room temperature.",
    "Image_Name": "rosemary-and-toasted-caraway-shortbread-51205390.jpg"
  },
  {
    "Title": "Cornbread with Caramelized Apples and Onions",
    "Ingredients": "['3/4 cup plus 2 tablespoons unsalted butter', '1 medium onion, thinly sliced', '1 teaspoon kosher salt plus more', 'Freshly ground black pepper', '2 medium red- or pink-skinned apples (such as Pink Lady), thinly sliced', '5 tablespoons sugar, divided', '3 teaspoons fresh thyme leaves, divided', '1 1/2 cups cornmeal', '1 cup all-purpose flour', '1 tablespoon baking powder', '2 large eggs', '1 1/2 cups buttermilk']",
    "Instructions": "Preheat oven to 400°F. Melt butter in an 8\" cast-iron skillet over medium-high heat. Pour all but 2 tablespoons butter into a small bowl; set aside.\nAdd onion to butter in skillet; season with salt and pepper, and cook, stirring occasionally, until onion is softened and beginning to brown, about 4 minutes. Add apples, 2 tablespoons sugar, and 2 teaspoons thyme and cook, stirring often, until apples are softened, about 4 minutes. Transfer onion mixture to a medium bowl and reserve skillet.\nWhisk cornmeal, flour, baking powder, 1 teaspoon salt, and remaining 3 tablespoonss sugar in a large bowl. Gradually whisk in eggs, buttermilk, and 3/4 cup reserved melted butter until smooth (no lumps should remain). Fold in half of onion mixture and scrape batter into reserved skillet. Top with remaining onion mixture and remaining 1 teaspoon thyme.\nBake cornbread until golden brown and a tester inserted into the center comes out clean, 30–40 minutes. Let cool slightly before serving.\nDO AHEAD: Cornbread can be made 6 hours ahead. Reheat before serving, if desired.",
    "Image_Name": "cornbread-with-caramelized-apples-and-onions-51198760.jpg"
  },
  {
    "Title": "Chocolate Shortbread Cookies",
    "Ingredients": "['1 1/2 C flour', '1/2 C unsweetened cocoa*', '1/4 tsp coarse salt', '1/2 pound (2 sticks) unsalted butter, room temperature', '1/2 C granulated sugar', '1 tablespoon cacao nibs*', '*Use a high quality chocolate such as Scharfen Berger.']",
    "Instructions": "In a small bowl, sift flour and cocoa together. Add coarse salt and set aside.\nWith an electric mixer beat butter on medium speed for 3 to 5 minutes until fluffy. Add sugar and cacao nibs and continue to beat until very light in color, about 2 minutes more. Add the flour and cocoa mixture and combine on low speed, until flour is just incorporated and dough sticks together when squeezed with fingers.\nOn a sheet of wax paper, pat and form the dough into a log about 12 to 14 inches long and 1 to 1 1/2 inches in diameter. If you want a square or rectangular cookie rather than round, flatten each side of the log as you roll it up in the wax paper. Chill until firm, at least 1 hour.\nPreheat oven to 325 degrees.\nLine a cookie sheet with parchment. Remove the wax paper from the dough and slice the log into 1/4 inch thick slices. Lay cookies on lined baking sheets. Bake until firm, 17 to 20 minutes. Cool completely on wire racks. Can be stored in an airtight container for 3 to 4 weeks.",
    "Image_Name": "chocolate-shortbread-cookies-51192010.jpg"
  },
  {
    "Title": "Rose Water Shortbread Cookies",
    "Ingredients": "['1/2 teaspoon ground cardamom', '1 1/2 cups white rice flour plus more for rolling', '3/4 cup powdered sugar', '1/2 cup (1 stick) unsalted butter, room temperature', '1 large egg', '1 teaspoon rose water', '1 teaspoon poppy seeds', 'ingredient info: Rice flour is available at natural foods stores, and rose water at Middle Eastern markets. Both can be found at specialty foods stores and some supermarkets.']",
    "Instructions": "Whisk cardamom and 1 1/2 cups flour in a medium bowl and set aside. Using an electric mixer, beat sugar and butter in a medium bowl until smooth. Add egg and rose water and beat to blend.\nReduce mixer to low speed; gradually mix in dry ingredients (dough will be stiff). Cover and chill at least 6 hours or overnight.\nPreheat oven to 300°. Scoop level tablespoonfuls of dough and, using lightly floured hands, roll into balls. Place on parchment-lined baking sheets, spacing about 1 1/2\" apart. Using a fork or another utensil that can make a decorative pattern in dough, flatten balls to a 1/4\" thickness. (Alternatively, flatten balls and make an indentation in the centers with your thumb.) Sprinkle cookies with poppy seeds.\nBake cookies until firm but still pale, 20- 25 minutes. Transfer to wire racks; let cool.\nDO AHEAD: Cookies can be baked 5 days ahead. Store airtight at room temperature.",
    "Image_Name": "rose-water-shortbread-cookies-51169140.jpg"
  },
  {
    "Title": "Lemon-Honey Tart with Salted Shortbread Crust",
    "Ingredients": "['Nonstick vegetable oil spray', '1 3/4 cups all-purpose flour', '2 tablespoons cornstarch', '1 1/4 teaspoons kosher salt', '3/4 cup (1 1/2 sticks) unsalted butter, room temperature, cut into 1\" pieces', '2/3 cup powdered sugar', '1 Meyer lemon or thin-skinned regular lemon', '1 cup sugar', '3 tablespoons honey', '1 tablespoon finely grated lemon zest', '3 large eggs', '2 large egg yolks', '1/4 cup all-purpose flour', '2 teaspoons cornstarch', '1/4 teaspoon kosher salt', '2/3 cup fresh lemon juice, preferably Meyer lemon', 'A 9\"-diameter springform pan']",
    "Instructions": "Coat springform pan with nonstick spray. Whisk flour, cornstarch, and salt in a small bowl; set aside. Place butter and powdered sugar in a food processor. Pulse until mixture is smooth. Add dry ingredients to food processor and pulse until mixture resembles medium-size pebbles (dough will not come together completely). Transfer dough to prepared pan. Using your fingers, press dough evenly onto bottom and 1 1/2\" up sides of pan. DO AHEAD: Crust can be prepared 1 day ahead. Cover and chill.\nUsing a mandoline, slice lemon into paper-thin rounds. Remove seeds. (If using a regular lemon, blanch slices in boiling water for 4 minutes, drain, and let cool before proceeding). Mix sugar, honey, and lemon zest in a medium bowl. Add lemon slices and toss to coat. Let sit until lemon is softened and sugar is dissolved, 30-45 minutes. DO AHEAD: Lemon slice mixture can be made 1 day ahead. Cover and chill.\nPlace rack in upper third of oven; preheat to 325°F. Bake crust until center is firm to the touch and edges are beginning to turn golden brown, 30-35 minutes.\nWhen crust is almost done baking, whisk eggs and egg yolks in a medium bowl to blend. Whisk flour, cornstarch, and salt in a small bowl; add to egg mixture and whisk to combine. Whisk in lemon juice. Add lemon slice mixture; mix gently to combine.\nReduce oven temperature to 300°F. Pour filling into hot crust. Bake until filling is set and slightly puffed around edges, 25-30 minutes. Transfer pan to a wire rack; let cool completely. Chill for at least 4 hours, then unmold. Serve cold. DO AHEAD: Tart can be made 2 days ahead. Cover and keep chilled.",
    "Image_Name": "lemon-honey-tart-with-salted-shortbread-crust-51140700.jpg"
  },
  {
    "Title": "Cranberry Shortbread",
    "Ingredients": "['1 cup all-purpose flour', '3/4 cup sugar, divided', '1/4 teaspoon kosher salt', '1/2 cup (1 stick) chilled unsalted butter, cut into 1/2\" cubes', '1 10-ounce bag fresh (or frozen, thawed) cranberries', '1/4 cup fresh grapefruit juice', '1 teaspoon grated grapefruit zest']",
    "Instructions": "Preheat oven to 350°F. Line an 8x8x2\" pan with parchment, leaving a 2\" overhang on 2 opposite sides. Whisk flour, 1/4 cup sugar, and salt in a medium bowl. Using your fingertips, rub butter into dry ingredients until mixture resembles coarse meal.\nTransfer to prepared pan; press evenly onto bottom of pan (using the bottom of a flat measuring cup works well). Prick dough all over with a fork.\nBake shortbread until cooked through and pale golden, 25-30 minutes. Transfer to a wire rack. Let cool completely in pan. DO AHEAD: Shortbread can be made 3 days ahead. Cover pan tightly with plastic wrap and store at room temperature.\nBring remaining 1/2 cup sugar, 1 1/2 cups cranberries, and grapefruit juice to a simmer in a small saucepan and cook, stirring occasionally, until cranberries burst and mixture is syrupy, about 8 minutes. Stir in remaining cranberries and cook until skins begin to split, about 3 minutes. Let cool. DO AHEAD: Cranberry topping can be made 3 days ahead. Cover and chill.\nSpread cooled cranberry topping over shortbread. Scatter zest over. Using paper overhang, lift shortbread from pan and transfer to a cutting board. Cut shortbread.",
    "Image_Name": "cranberry-shortbread-51122650.jpg"
  },
  {
    "Title": "Simple Strawberry Dulce de Leche Shortbread Tart",
    "Ingredients": "['1 cup all-purpose flour', '1/3 cup cornstarch', '1/4 teaspoon baking powder', '1/4 teaspoon salt', '3/4 stick (6 tablespoons) unsalted butter, softened', '1/3 cup granulated sugar', '2 large egg yolks', '1 teaspoon vanilla', '1 cup chilled heavy cream', '1/2 cup sour cream', '3 tablespoons sugar', '1 teaspoon vanilla', '1/2 cup homemade dulce de leche (or store-bought)', '1 pound strawberries, hulled and sliced']",
    "Instructions": "Heat oven to 350°F with rack in middle. Lightly butter a large baking sheet.\nWhisk together flour, cornstarch, baking powder, and salt in a small bowl.\nBeat together butter and sugar in a large bowl with an electric mixer on medium-high speed until light and fluffy, then beat in egg yolks and vanilla. Reduce speed to low and mix in flour mixture until combined.\nForm dough into a disk and roll out between 2 large sheets of parchment paper into an 11-inch round (about 1/8 inch thick). Peel off and discard top piece of parchment. Slide round (still on bottom piece of parchment) onto baking sheet. (Butter on sheet will help keep parchment in place.)\nBake until round is firm to the touch and pale golden around edges, 12 to 16 minutes. Slide round on parchment onto a rack to cool completely.\nBeat cream with sour cream, sugar, and vanilla using an electric mixer until soft peaks form.\nCarefully slide cool tart from parchment onto a flat platter or cutting board. Gently spread dulce de leche onto crust (an offset spatula is helpful for this), taking care not to break crust. Spoon cream on top of dulce de leche and top with strawberries.\nServe immediately.",
    "Image_Name": "simple-strawberry-dulce-de-leche-shortbread-tart-395010.jpg"
  },
  {
    "Title": "Parmesan Shortbread with Fennel and Sea Salt",
    "Ingredients": "['1 cup (2 sticks) unsalted butter, room temperature', '1/2 cup powdered sugar', '1 teaspoon freshly ground black pepper', '3/4 teaspoon kosher salt', '2 cups all-purpose flour plus more', '1 cup finely grated Parmesan (about 2 ounces)', '1 tablespoon fennel seeds', '1 teaspoon Maldon sea salt or other coarse salt', '2 tablespoons extra-virgin olive oil']",
    "Instructions": "Using an electric mixer, beat butter in a medium bowl on low speed until smooth, 1-2 minutes. Add powdered sugar, pepper, and kosher salt. Reduce speed to medium and beat, occasionally scraping down sides of bowl, until light and fluffy, 4-5 minutes. Add flour and cheese. Reduce mixer speed to low and beat mixture just until dough comes together.\nWrap dough in plastic and flatten into a rectangle. Chill until firm, at least 2 hours. DO AHEAD: Dough can be made 5 days ahead. Keep chilled. Let stand at room temperature for 30 minutes before continuing.\nPlace fennel seeds in a resealable plastic freezer bag. Coarsely crush with a rolling pin or the bottom of a skillet. Alternatively, pulse in a spice mill until coarsely crushed. Transfer to a small bowl; stir in sea salt. Set fennel salt aside.\nArrange a rack in center of oven and preheat to 350°F. Line a baking sheet with parchment paper. Remove plastic wrap from dough. Roll out dough on a lightly floured surface to a 10x8\" rectangle about 1/4\" thick. Cut in thirds crosswise, then cut each third crosswise into 6 rectangles. Arrange cookies on prepared baking sheet, spacing 1\" apart. Brush cookies generously with oil, then sprinkle with fennel salt.\nBake, rotating sheet halfway through, until cookies are golden brown (flecks of cheese will be slightly darker), 20-24 minutes. Let cool on sheets for at least 10 minutes. Serve warm or at room temperature. DO AHEAD: Can be made 2 days ahead. Store airtight at room temperature.",
    "Image_Name": "parmesan-shortbread-with-fennel-and-sea-salt-394673.jpg"
  },
  {
    "Title": "Gingerbread Cake",
    "Ingredients": "['Nonstick vegetable oil spray', '1 1/2 cups all-purpose flour', '1 teaspoon ground ginger', '3/4 teaspoon ground cinnamon', '3/4 teaspoon kosher salt', '1/2 teaspoon baking powder', '1/2 teaspoon baking soda', '1/2 cup (1 stick) unsalted butter, cut into 1/2\" pieces', '1/2 cup (packed) light brown sugar', '1/2 cup mild-flavored (light) molasses', '1 large egg, beaten to blend', '2 teaspoons grated peeled ginger', '1 cup chilled heavy cream', '1 tablespoon powdered sugar', '1/4 cup store-bought lemon curd', 'Finely grated lemon zest', 'An 8\" square metal cake pan']",
    "Instructions": "Preheat oven to 350°F. Coat pan with nonstick spray. Line bottom with parchment paper; spray paper. Whisk flour and next 5 ingredients in a medium bowl. Place butter in a large bowl. Pour 1/2 cup boiling water over; whisk until melted. Whisk in sugar and next 3 ingredients. Add dry ingredients; whisk to blend. Transfer to prepared pan.\nBake until a tester inserted into center of cake comes out clean, about 25 minutes. Let cool in pan for 10 minutes. Invert onto a wire rack; let cool. Remove parchment.\nBeat cream and sugar in a medium bowl until firm peaks form. Fold in curd, leaving swirls. Spread over cake. Garnish with zest.",
    "Image_Name": "gingerbread-cake-368939.jpg"
  },
  {
    "Title": "Shortbread Cookies",
    "Ingredients": "['2 cups whole wheat flour', '1/2 cup sugar', '1 1/2 teaspoons baking powder', '10 1/2 tablespoons salted butter, room temperature', '1 large egg, room temperature', '1 large egg yolk, room temperature', '3 tablespoons (about) raspberry jam']",
    "Instructions": "Preheat oven to 400°F. Whisk flour, sugar, and baking powder in a large bowl. Add butter; using your fingertips, rub in butter until coarse meal forms. Whisk egg and yolk in a bowl; add to flour mixture; stir just to blend.\nLine 2 baking sheets with parchment paper. Measure dough by 2 tablespoonfuls and roll into balls. Place on prepared sheets, spacing 2\" apart. Make an indentation in center of each ball; fill each with 1/2 teaspoon jam.\nBake cookies until golden, 12-14 minutes. Transfer to a wire rack to cool.",
    "Image_Name": "shortbread-cookies-367140.jpg"
  },
  {
    "Title": "Lemon-Lime Basil Shortbread Cookies",
    "Ingredients": "['1 cup all-purpose flour', '1/2 cup powdered sugar plus more for pressing cookies', '1/2 cup (1 stick) chilled unsalted butter, cut into 1/2\" cubes', '2 tablespoons sliced fresh basil leaves', '1 teaspoon finely grated lemon zest', '1 tablespoon fresh lemon juice', '1/2 teaspoon finely grated lime zest', '1/4 teaspoon kosher salt', 'Sanding sugar (optional)', 'Ingredient info: Decorative sanding sugar has large, crunchy crystals; available at specialty foods stores and beryls.com.']",
    "Instructions": "Preheat oven to 375°F. Place flour, 1/2 cup powdered sugar, butter, basil, both zests, lemon juice, and salt in a food processor. Pulse until large, moist clumps form. Measure level tablespoonfuls of dough; roll between your palms to form balls. Place on a large baking sheet, spacing 2\" apart. Lightly dust the bottom of a flat measuring cup with powdered sugar and press cookies into 2\" rounds, dusting cup bottom with powdered sugar as needed to prevent sticking. Sprinkle tops of cookies with sanding sugar, if using.\nBake until edges are brown, about 20 minutes. Transfer to a wire rack; let cool.",
    "Image_Name": "lemon-lime-basil-shortbread-cookies-366434.jpg"
  },
  {
    "Title": "Lemongrass Bars with Coconut Shortbread Crust",
    "Ingredients": "['1 1/2 cups all-purpose flour', '1 cup sweetened shredded coconut (about 3 ounces)', '1/2 cup powdered sugar', '1/2 cup plus 3 tablespoons unsalted butter, room temperature', '1 1/4 cups sugar', '3 lemongrass stalks, bottom 4 inches only, tough outer layer removed, finely chopped (scant 1/2 cup)', '5 tablespoons fresh lemon juice', '3 large eggs', '1/4 cup all purpose flour', 'Powdered sugar']",
    "Instructions": "Preheat oven to 350°F. Butter 13 x 9 x 2- inch metal baking pan. Using electric mixer, beat flour, coconut, powdered sugar, and 1/2 teaspoon salt in large bowl until well blended, 30 seconds. Add butter; beat on low speed until moist clumps form. Press dough onto bottom and 1/2 inch up sides of pan. Bake crust until golden (edges will be darker), about 25 minutes.\nMeanwhile, place sugar and lemongrass in processor; pulse until lemongrass is finely ground, about 1 minute. Add lemon juice; process until well blended, about 30 seconds. Add eggs; process to blend, 10 to 15 seconds. Add flour and pinch of salt; pulse until smooth.\nReduce oven temperature to 325°F. Pour filling over hot crust; bake until filling is firm, 22 to 23 minutes. Cool in pan on rack.\nCut lemongrass bars lengthwise into 4 strips, then crosswise into 6 pieces. Dust bars with powdered sugar and serve.",
    "Image_Name": "lemongrass-bars-with-coconut-shortbread-crust-364029.jpg"
  },
  {
    "Title": "Coffee-Spice Shortbread with Crystallized Ginger",
    "Ingredients": "['2 3/cups all purpose flour', '3/4 cup (packed) dark brown sugar', '2 tablespoons plus 2 teaspoons ground coffee beans', '2 teaspoons ground ginger', '1 1/2 teaspoons ground cinnamon', '1 teaspoon ground cardamom', '1/2 teaspoon salt', '1 cup (2 sticks) chilled unsalted butter, cut into 1/2-inch cubes', '1/2 cup powdered sugar', '2 teaspoons (or more) water', '1 teaspoon vanilla extract', '6 tablespoons chopped crystallized ginger', '2 9-inch-diameter tart pans with removable bottom']",
    "Instructions": "Position 1 rack in top third and 1 rack in bottom third of oven and preheat to 325°F. Mix flour, brown sugar, ground coffee, ginger, cinnamon, cardamom, and salt in processor 5 seconds. Add butter; using on/off turns, process until moist clumps begin to form. Gather dough into ball. Divide dough equally between two 9-inch- diameter tart pans with removable bottom. Press dough firmly and evenly onto bottom of each tart pan.\nBake shortbread 25 minutes. Reverse position of pans and continue to bake until shortbread is golden brown and firm around edges but center is still just slightly soft, about 20 minutes longer. Cool shortbread in pans 5 minutes. Remove pan sides. Cut warm shortbread in each pan into 12 wedges. Cool completely.\nMix powdered sugar, 2 teaspoons water, and vanilla in small bowl, adding more water by 1/4 teaspoonfuls, if necessary, for spreadable glaze. Using offset spatula, spread glaze thinly over cookies, leaving 1/2- inch border at edges. Sprinkle crystallized ginger over. Let stand until glaze is set, about 1 hour. Do ahead can be made 3 weeks ahead. Store airtight in freezer. Bring to room temperature before serving.",
    "Image_Name": "coffee-spice-shortbread-with-crystallized-ginger-362592.jpg"
  },
  {
    "Title": "Brown Sugar Shortbread",
    "Ingredients": "['1 cup (2 sticks) unsalted butter, at room temperature', '1/2 cup packed light brown sugar or muscovado sugar', '1 2/3 cup all-purpose flour', '1/3 cup cornstarch', 'Pinch of salt']",
    "Instructions": "1. Position a rack in the center of the oven and preheat to 350 degrees. Lightly butter a 9- to 9 1/2 inch springform pan.\n2. Beat the butter in a medium bowl with an electric mixer set at high speed until smooth, about 1 minute. Add the sugar and beat until the mixture is light in color and texture, about 2 minutes. Using a wooden spoon, stir in the flour, cornstarch, and salt. Press the dough evenly into the pan. Using the tines of a fork, press around the perimeter of the dough. Prick the dough, reaching down to the bottom of the pan, into 10 equal wedges.\n3. Bake until lightly browned, about 30 minutes. Cool completely in the pan. Remove the sides of the pan. Cut the shortbread into wedges, following the perforations in the dough. (The shortbread can be stored in an airtight container for up to 5 day.)",
    "Image_Name": "brown-sugar-shortbread-361649.jpg"
  },
  {
    "Title": "Chocolate-Toffee Shortbread Fingers",
    "Ingredients": "['1/2 cup toasted and cooled pecans, coarsely chopped', \"3/4 cup Heath Bits 'O Brickle Toffee bits or Skor or Heath bars, coarsely chopped\", '1 bag (12 ounces) bittersweet or semisweet chocolate chips', '1 tablespoon vegetable oil', '4 packages (8.8-ounces each) Walkers Pure Butter Shortbread Fingers']",
    "Instructions": "1. Line a few baking sheets with parchment paper. Combine the nuts and toffee bits in a shallow bowl.\n2. Combine the chocolate and oil in a small microwave-safe bowl. Heat the chocolate in the microwave on high until melted, 30 seconds to 1 minute depending on the strength of your microwave. Stir until smooth. (Alternatively, place water to a depth of 1 inch in the bottom of a double boiler or a large saucepan and bring to a bare simmer. Place the chocolate chips and oil in the top of the double boiler or in a stainless steel bowl big enough to rest on top of the saucepan without touching the water. Heat, whisking occasionally, until the chocolate is melted.)\n3. Hold a cookie by one end and dip it into the chocolate, turning, to coat three quarters of the cookie; let the excess drip back into the bowl. Hold the cookie over the bowl of nuts and toffee bits and sprinkle some of the mixture onto the chocolate-coated top and sides of the cookie. Place the cookie on a prepared baking sheet. Repeat with the remaining cookies. Let the cookies rest until the chocolate is set, about 30 minutes.\nChocolate-Toffee Shortbread Fingers will keep, between layers of parchment paper, in an airtight container at room temperature for up to 1 week\nTo toast the pecans, place them in a single layer on an ungreased baking sheet and bake in a 350°F oven, shaking the pan occasionally, until fragrant, 5 to 10 minutes. Watch them closely to make sure they don't burn, and transfer the toasted nuts to a plate to let them cool.",
    "Image_Name": "chocolate-toffee-shortbread-fingers-361429.jpg"
  },
  {
    "Title": "Maple-Gingerbread Layer Cake with Salted Maple-Caramel Sauce",
    "Ingredients": "['3/4 cup pecan halves, toasted', '1/4 cup pure maple syrup (preferably Grade B)', 'Coarse kosher salt', '2 1/2 cups all purpose flour', '1 1/2 teaspoons Chinese five-spice powder', '1 teaspoon baking soda', '1/2 teaspoon coarse kosher salt', '1/3 cup chopped crystallized ginger (1 1/2 to 2 ounces)', '1 cup maple sugar', '3/4 cup (1 1/2 sticks) unsalted butter, room temperature', '2 large eggs', '3/4 cup hot water', '2/3 cup mild-flavored (light) molasses', '1 1/3 cups chilled crème fraîche', '1 1/3 cups chilled heavy whipping cream', '1/2 cup maple sugar', '6 tablespoons powdered sugar', 'Salted Maple-Caramel Sauce', 'Ingredient info: Chinese five-spice powder-a spice blend that usually contains ground fennel seeds, Sichuan peppercorns, cinnamon, star anise, and cloves-is available in the spice section of most supermarkets. Crème fraîche is sold at most supermarkets and at specialty foods stores.']",
    "Instructions": "Place large piece of foil on work surface. Combine nuts and maple syrup in heavy medium skillet (do not use nonstick) over medium-high heat and bring to boil, tossing to coat. Cook until syrup is dark amber and almost cooked away and thickly coats nuts, tossing often, 3 to 3 1/2 minutes. Scrape nuts onto foil. Working quickly with 2 forks, separate nuts. Sprinkle with coarse salt. Cool until coating is crisp and hard, about 1 hour. DO AHEAD: Pecans can be made 1 day ahead. Store airtight at room temperature.\nPreheat oven to 350°F. Butter and flour two 9-inch-diameter cake pans with 1 1/2-inch-high sides. Combine first 4 ingredients in processor; add ginger. Blend until ginger is finely ground, about 1 minute. Using mixer, beat maple sugar and butter in large bowl until fluffy. Beat in eggs 1 at a time (batter may look curdled). Stir 3/4 cup hot water and molasses in small bowl. Beat dry ingredients into butter mixture in 4 additions alternately with molasses mixture in 3 additions.\nDivide batter between prepared pans (about 21/2 cups each). Bake until tester inserted into center comes out clean, 30 to 32 minutes. Cool cakes in pans on racks.\nCombine crème fraîche, cream, and both sugars in large bowl. Using electric mixer, beat until very thick and stiff.\nCut around pan sides to loosen cake layers; turn out onto racks. Place 1 cake layer on platter. Spread with 1 1/3 cups frosting. Drizzle with 3 tablespoons caramel sauce. Top with second cake layer. Spread remaining frosting smoothly over top and sides of cake. Drizzle top of cake with 3 tablespoons sauce. Cover with cake dome; chill at least 1 hour. DO AHEAD: Can be made 1 day ahead; keep chilled. Let stand at room temperature 30 minutes before continuing.\nCut pecans into pieces or leave whole. Press pecans into frosting on sides of cake. Cut cake into wedges. Spoon sauce over.",
    "Image_Name": "maple-gingerbread-layer-cake-with-salted-maple-caramel-sauce-361294.jpg"
  },
  {
    "Title": "Flatbread with Arugula, Asparagus, and Fried Eggs",
    "Ingredients": "['1 cup (packed) fresh spinach (about 2 ounces)', '1 cup (packed) arugula leaves (about 2 ounces) plus additional (for garnish)', '1/2 cup plus 2 tablespoons extra-virgin olive oil plus additional (for brushing)', '4 garlic cloves, coarsely chopped', '1 cup (or more) warm water (110°F to 115°F), divided', '1 tablespoon honey', '2 1/4-ounce packets active dry yeast', '3 cups all purpose flour', '1/4 teaspoon coarse kosher salt', 'Cornmeal (for sprinkling)', '8 ounces fingerling potatoes, cooked, cooled, cut crosswise into 1/3-inch slices', '8 ounces asparagus; thin stalks cut into 1/2-inch pieces, thick stalks cut into 1/4- to 1/3-inch pieces', '2 large ears of corn, husked, kernels cut from cobs', '2/3 cup fresh peas or frozen peas, thawed', '3/4 cup ricotta cheese (not drained)', '8 large eggs', 'Parmesan cheese shavings', 'Heavy-duty stand mixer with dough hook attachment']",
    "Instructions": "Place spinach in microwave-safe bowl. Sprinkle with water. Microwave until wilted, about 20 seconds. Drain, pressing on spinach to release liquid. Place spinach, 1 cup arugula, 1/2 cup oil, and garlic in blender. Blend until coarse puree forms. Transfer pesto to small bowl. Season to taste with salt and pepper. DO AHEAD: Can be made 1 day ahead. Cover and chill.\nStir 1/4 cup warm water and honey in small bowl. Stir in yeast. Let stand until foamy, about 10 minutes. Place flour and coarse salt in stand mixer fitted with dough hook attachment. Add 3/4 cup warm water and yeast mixture. Mix on medium speed until dough comes together and pulls away from sides of bowl, adding more water by tablespoonfuls if too dry, about 2 to 3 minutes. Brush large bowl with oil. Form dough into ball. Place in bowl; turn to coat. Cover with plastic; place in warm draft-free area until doubled in volume, about 1 hour.\nPlace pizza stone or baking sheet in oven (if using rimmed baking sheet, invert sheet, rim side down). Preheat oven to 500°F. Knead dough in bowl. Cover and let rise again until doubled in volume, about 45 minutes. Divide dough into 4 equal portions. Form each portion into ball. Place on floured work surface; cover with plastic wrap and let rest 10 minutes.\nSprinkle rimless baking sheet with cornmeal. Working with 1 ball at a time, roll out dough on floured surface to 12x7-inch oval. Transfer to sheet. Spread 2 tablespoons pesto over dough, leaving 1/2- inch plain border. Sprinkle 1/4 of potatoes, 1/4 of asparagus, 1/4 of corn, and 1/4 of peas over pesto. Spoon three 1-tablespoon dollops ricotta over vegetables. Slide pizza onto stone; bake until crust is golden brown on bottom and around edges, 10 to 12 minutes.\nMeanwhile, brush nonstick skillet with oil; heat over medium heat. Crack 2 eggs into skillet; cook just until whites are set but yolks are still runny, about 3 minutes.\nTransfer pizza to work surface. Place 2 fried eggs atop pizza. Scatter shaved Parmesan and arugula leaves over. Cut pizza into wedges and serve. Repeat with remaining dough, pesto, potatoes, asparagus, corn, peas, ricotta, and eggs.",
    "Image_Name": "flatbread-with-arugula-asparagus-and-fried-eggs-360754.jpg"
  },
  {
    "Title": "Cornbread with Bacon Crust",
    "Ingredients": "['10 thick-cut bacon slices', '1 1/2 cups medium-grind cornmeal', '1 1/2 cups all purpose flour', '3 tablespoons golden brown sugar', '1 tablespoon baking powder', '1 teaspoon salt', '1 2/3 cups whole milk', '3 large eggs', '3 tablespoons honey or agave syrup', '2 tablespoons unsalted butter, melted', '2 cups frozen corn kernels (unthawed)']",
    "Instructions": "Cook bacon in large skillet over medium heat until crisp. Drain on paper towels. Reserve 2 tablespoons drippings from skillet. Crumble bacon into small pieces.\nPreheat oven to 350°F. Coat 12-inch diameter ovenproof skillet with bacon drippings. Whisk cornmeal and next 4 ingredients in large bowl. Whisk milk, eggs, honey, and butter in medium bowl. Stir milk mixture into dry ingredients. Mix in corn.\nPlace prepared skillet in oven until very hot, about 10 minutes. Pour batter into skillet. Sprinkle bacon over. Bake cornbread until golden and tester inserted into center comes out clean, about 50 minutes. Cool in skillet at least 30 minutes. Serve cornbread directly from skillet. DO AHEAD: Can be made 8 hours ahead. If desired, rewarm uncovered in 350°F oven 10 to 15 minutes.",
    "Image_Name": "cornbread-with-bacon-crust-355804.jpg"
  },
  {
    "Title": "Spiced Pear Flatbreads with Goat Cheese and Mustard Cream",
    "Ingredients": "['6 tablespoons heavy whipping cream', '3 tablespoons whole grain Dijon mustard', '1 1/2 tablespoons Dijon mustard', '1 tablespoon fresh lemon juice', '1/2 teaspoon honey or agave syrup', '2 1/4 cups bread flour', '1 cup plus 7 tablespoons warm water (115°F to 120°F)', '3/4 cup all purpose flour', '1/3 cup whole wheat flour', '2 tablespoons olive oil', '2 teaspoons fine sea salt', '1/2 teaspoon honey', '1/4 teaspoon quick-rising active dry yeast', '2 firm but ripe Bosc pears, halved lengthwise, cored', 'Olive oil', \"Coarsely ground piment d'Espelette, Aleppo pepper, or cayenne pepper\", 'Fine sea salt', '5 cups baby arugula (about 4 ounces)', '8 ounces coarsely crumbled blue goat cheese (such as Bleuet or FireFly Farms Black and Blue)', 'pizza stone']",
    "Instructions": "Whisk all ingredients in small bowl. Season with salt and pepper. DO AHEAD: Can be made 1 day ahead. Cover; chill. Bring to room temperature before using.\nCombine all ingredients in bowl of heavy-duty mixer fitted with dough hook. Beat at low speed until dough forms and comes away from sides of bowl, about 2 minutes. Scrape dough off hook. Cover bowl with plastic wrap. Let dough rest 30 minutes.\nClean and reattach dough hook. Beat dough at medium speed 3 minutes. Scrape dough on hook into bowl. Cover bowl with plastic and towel. Let dough rise until light and slightly puffed, about 1 hour. Gently knead dough to deflate. Using floured hands, divide sticky dough into 4 equal pieces. Shape each into ball; place on plastic-lined baking sheet. Cover and chill at least 45 minutes. DO AHEAD: Can be made 8 hours ahead. Keep chilled. Bring to room temperature before using.\nCut pear halves vertically into very scant 1/4-inch-thick slices. Brush both sides with oil, then sprinkle with Espelette pepper. Arrange on sheet of foil. If using pizza stone, place in oven. (Alternatively, place heavy large baking sheet, upside down, in oven.) Preheat oven to 500°F for at least 45 minutes.\nStretch and roll each dough ball to 9-inch round on lightly floured work surface. Place 1 dough round on floured pizza peel or rimless baking sheet. Brush dough with oil; sprinkle with sea salt and Espelette pepper. Scatter 1/4 of arugula over. Drizzle lightly with oil. Top with pear slices and 1/4 of cheese.\nSlide flatbread onto hot pizza stone or baking sheet. Bake until crust is golden brown and crisp and cheese is melted, rotating occasionally, 10 to 11 minutes. Repeat with remaining flatbreads. Transfer flatbreads to plates. Drizzle with mustard cream and serve.",
    "Image_Name": "spiced-pear-flatbreads-with-goat-cheese-and-mustard-cream-354834.jpg"
  },
  {
    "Title": "Gingerbread Bars",
    "Ingredients": "['2 cups all purpose flour', '2 teaspoons ground ginger', '1 teaspoon ground cinnamon', '1/4 teaspoon ground nutmeg', '1/4 teaspoon ground cloves', '1/2 teaspoon baking soda', '1/2 teaspoon salt', '10 tablespoons (1 1/4 sticks) unsalted butter, room temperature', '3/4 cup (packed) dark brown sugar', '7 1/2 tablespoons sugar, divided', '2 large eggs', '1/4 cup light (unsulfured) molasses']",
    "Instructions": "Preheat oven to 350°F. Butter and flour 15x10x1-inch baking sheet. Place 2 cups flour in medium bowl; transfer 2 tablespoons flour to small bowl and reserve. Add spices, baking soda, and salt to flour in medium bowl; whisk to blend. Using electric mixer, beat butter, brown sugar, and 6 tablespoons sugar in large bowl until fluffy. Beat in eggs, 1 at a time, then molasses. Add dry ingredients to butter mixture and beat to blend. Spread batter evenly in prepared pan. Sift reserved 2 tablespoons flour evenly over batter, then sprinkle evenly with remaining 1 1/2 tablespoons sugar.\nBake gingerbread until golden brown and tester inserted into center comes out clean, about 22 minutes; cool completely in pan on rack. Cut gingerbread crosswise into 4 strips, then cut each strip into 6 pieces, forming 24 bars, each about 31/2x13/4 inches. DO AHEAD: _Can be made 2 days ahead._Store airtight at room temperature.",
    "Image_Name": "gingerbread-bars-353838.jpg"
  },
  {
    "Title": "Wheat Biscuit Shortbread",
    "Ingredients": "['2 sticks unsalted butter, at room temperature', '2/3 cup granulated sugar', '2 teaspoons vanilla extract', '1/2 teaspoon fine salt', '1 1/4 cups unbleached all-purpose flour', '1 cup white whole-wheat flour', '8 ounces semisweet chocolate']",
    "Instructions": "Arrange the racks in upper and lower thirds of the oven and preheat the oven to 325°F. Line 2 large cookie sheets and with parchment paper or silicone sheets.\nIn a large bowl, combine the butter, sugar, vanilla and salt at medium-low speed just until smooth. Add the flours and mix until just blended. Divide the dough in half and then shape, without over handling, into 2 disks.\nOn a lightly floured surface, roll 1 piece of dough out into a 13-inch, 1/4-inch-thick square. Using a ruler and a fluted pastry wheel or a large knife, trim the edges and cut into 2- by 1-inch rectangles. Transfer the cookies to the baking sheets, spacing 1 1/2 inches apart. Reroll the scraps and repeat with the remaining dough. Mark each cookie several times with tines of a fork and then chill the pans in the refrigerator for 10 minutes. Bake cookies for about 17 minutes, until golden and nearly firm in center. Let cool for 5 minutes on baking sheets and transfer to racks to cool completely.\nFinely chop semisweet chocolate. Place half of the chocolate in a heatproof bowl set over a saucepan with 1 inch of simmering water and stir until the chocolate is melted and smooth. Add the remaining chocolate to the bowl; remove the bowl from the pot and place on a folded towel. Stir occasionally until chocolate is smooth. Scrape the chocolate into a small bowl. Line a baking sheet with clean parchment or waxed paper. Dip the cookies halfway into the chocolate, let the excess drip off, and then place on the paper-lined sheet; let stand until set and dry, at least 1 hour.",
    "Image_Name": "wheat-biscuit-shortbread-243132.jpg"
  },
  {
    "Title": "Algerian Flatbread",
    "Ingredients": "['3 cups finely ground whole-wheat flour (preferably Indian atta or King Arthur whole-wheat)', '1 teaspoon salt', '1/2 cup olive oil, divided', '1 1/2 cups water', '1 teaspoon ground cumin', '1 teaspoon sweet paprika', '1 teaspoon turmeric']",
    "Instructions": "Stir together flour, salt, and 2 tablespoons oil in a large bowl. Slowly stir in water until a soft dough forms. If necessary, add more water 1 tablespoon at a time. Turn out dough onto a lightly floured surface and knead, dusting with just enough flour to keep dough from sticking, until smooth and elastic, about 15 minutes.\nForm dough into a ball and coat with 2 tablespoons oil in a bowl. Cover bowl with plastic wrap and let dough stand at warm room temperature 1 hour.\nStir together cumin, paprika, turmeric, and remaining 1/4 cup oil in a small bowl.\nDivide dough into 12 equal pieces and, keeping remaining pieces covered with plastic wrap, flatten 1 piece of dough into a disk. Roll out disk as thinly as possible (into a 9-inch round) on a lightly floured surface with a 6-inch wooden dowel or a rolling pin. Spread 1 teaspoon spiced oil on dough with your fingertips, then roll up tightly into a long cylinder and coil into a tight spiral. Transfer to a large sheet of parchment paper, then loosely cover with plastic wrap.\nMake 11 more spirals in same manner.\nTape another sheet of parchment to a work surface and on it roll out 1 spiral of dough into a round approximately 6 inches in diameter. Heat a dry large cast-iron skillet or griddle over medium heat until hot, then cook flatbread, turning once, until puffed and browned in spots, 3 to 4 minutes total. Transfer to a plate and cover with a kitchen towel. Roll out and cook 11 more flatbreads, stacking them on plate.\nCape Mentelle Margaret River Chardonnay '05",
    "Image_Name": "algerian-flatbread-241505.jpg"
  },
  {
    "Title": "Flatbread with Shrimp and White Bean Hummus",
    "Ingredients": "['1 1/4 cups warm water (105°F to 115°F)', '1 teaspoon active dry yeast', '1 teaspoon sugar', '3 cups all-purpose flour', '1 1/2 teaspoons kosher salt', '2 tablespoons extra-virgin olive oil', '5 to 6 garlic cloves, unpeeled', '1 tablespoon extra-virgin olive oil', '1 1/8 teaspoons kosher salt', '1 (15-ounce) can white beans, rinsed and drained', '2 tablespoons white vinegar', '2 teaspoons fresh lemon juice', '1 tablespoon tahini', '1 teaspoon fresh rosemary, finely chopped', '2 teaspoons unsalted butter', '2 medium Spanish onions, cut into medium dice', '1 1/2 teaspoons sugar', '1/4 teaspoon kosher salt', '1/4 teaspoon freshly ground black pepper', '2 tablespoons extra-virgin olive oil', '4 leeks, white and light green parts only, washed and cut into medium dice', '1/4 teaspoon kosher salt', '1/4 teaspoon freshly ground black pepper', '1 tablespoon extra-virgin olive oil for brushing flatbread', '1 lemon, halved lengthwise and very thinly sliced', '1 pound small, sweet shrimp such as Caribbean Laughing Bird*, peeled and cooked', '6 ounces Grana Padano or Parmigiano-Reggiano cheese, finely grated (about 1 ½ cups)', '3/4 teaspoon kosher salt', '1 1/2 teaspoons fresh lemon juice', '3/4 cup mixed micro greens, such as baby arugula', \"*Small and full of flavor, Caribbean Laughing Bird shrimp are sustainably raised off the coast of Belize. If they're unavailable, you can substitute rock shrimp, which are similar in flavor, though not as environmentally friendly. Alternatively, use any sweet shrimp, cut into pieces if large.\", 'stand mixer with paddle attachment and dough hook, pasta machine or rolling pin, pizza stone or heavy baking sheet, food processor']",
    "Instructions": "In bowl of stand mixer fitted with paddle attachment, stir together water, yeast, and sugar until dissolved, about 5 seconds. Let stand until foamy, about 5 minutes. In large bowl, whisk together flour and salt. Add to yeast mixture and mix on low speed until just combined, about 30 seconds. Add oil and mix on low speed until just combined, about 30 seconds. Switch to dough hook and mix on medium speed until dough is elastic and pulls away from sides, about 8 minutes. (Dough should feel firm and moist, but not sticky.)\nLightly oil large bowl. Gently shape dough into ball and transfer to bowl. Turn over several times to coat lightly with oil, then cover with plastic wrap and let rise in warm place (80°F to 85°F, see Chef's Notes) until doubled in size, about 1 hour.\nWhile dough is rising, position rack near bottom of oven and top with pizza stone or heavy baking sheet. Preheat oven to 450°F for 1 hour.\nSet smooth rollers of pasta machine on widest setting (see Chef's Notes). Divide dough into 6 equal parts. Cover 5 parts with plastic wrap. Shape remaining piece into rough rectangle and feed through rollers once to flatten into roughly 12-by 4-inch rectangle, approximately 1/8-inch thick. Transfer flatbread to large baking sheet, dust with flour, and top with sheet of parchment paper. Roll out remaining flatbreads in same manner, stacking between layers of parchment paper. Cover with plastic wrap until ready to bake.\nTransfer 1 or more flatbreads to preheated pizza stone and bake in batches until slightly puffed but still pale, about 5 minutes. Transfer to wire rack to cool completely. Leave oven on. DO AHEAD: Flatbreads can be prepared ahead and frozen, wrapped tightly in parchment paper and plastic wrap, up to 6 months.\nTransfer garlic cloves to 6-inch square of foil, drizzle with 1 teaspoon olive oil, sprinkle with 1/8 teaspoon salt, and wrap tightly. Bake until tender, about 45 minutes. Unwrap and let cool. DO AHEAD: Roasted garlic can be prepared ahead and refrigerated, in airtight container, up to 3 days.\nSqueeze garlic cloves from skin into food processor. Add white beans, remaining 2 teaspoons olive oil, vinegar, lemon juice, tahini, rosemary, and remaining 1 teaspoon salt and purée until smooth, about 2 minutes. DO AHEAD: Hummus can be prepared ahead and refrigerated in airtight container up to 3 days.\nIn large, heavy saucepan over moderately low heat, melt butter. Add onions and sauté, stirring occasionally, until slightly transparent and starting to soften, about 2 minutes. Add sugar and 4 teaspoons water and sauté, stirring occasionally, until golden brown, 12 minutes. Stir in salt and pepper, then transfer to medium bowl to cool. DO AHEAD: Onions can be prepared ahead and refrigerated, in airtight container, up to 3 days.\nIn large, heavy saucepan over moderate heat, heat olive oil. Add leeks and sauté, stirring occasionally, until soft and translucent, about 8 minutes. Stir in salt and pepper, then transfer to medium bowl to cool. DO AHEAD: Leeks can be prepared ahead and refrigerated, in airtight container, up to 3 days.\nPosition rack near bottom of oven and top with pizza stone or heavy baking sheet. Preheat oven to 450°F for 1 hour.\nBrush each flatbread with olive oil and spread with hummus. Scatter onions and leeks over and top with lemon slices and shrimp. Scatter with cheese, then sprinkle with salt and lemon juice.\nTransfer 1 or more flatbreads to preheated pizza stone and bake in batches until toppings are warmed through and cheese has melted, 6 to 8 minutes.\nTransfer flatbreads to large cutting board and top with micro greens. Using very sharp knife, cut into 6 thin slices and serve immediately.",
    "Image_Name": "flatbread-with-shrimp-and-white-bean-hummus-351889.jpg"
  },
  {
    "Title": "Flatbread with Fingerling Potatoes, Shitake Mushrooms, and Truffle Oil",
    "Ingredients": "['1 cup warm water (105 to115° F)', '1 1/4 teaspoons active dry yeast', '1 teaspoon sugar', '1 tablespoon plus 1 teaspoon dry milk powder', '1 3/4 cups all-purpose flour', '1/2 teaspoon kosher salt', '4 (approximately 1-inch-wide and 3-inch-long) fingerling potatoes', '4 sprigs fresh thyme plus 2 teaspoons fresh thyme leaves', '1 clove garlic, peeled and smashed with back of knife', '2 1/2 teaspoons kosher salt', '1 tablespoon canola oil', '1 tablespoon unsalted butter', '2 cups (4 ounces) fresh shiitake mushrooms, stemmed and thinly sliced', '1/4 cup shallots, minced (from 2 medium shallots)', '3/4 teaspoons freshly ground black pepper', '2 teaspoons extra-virgin olive oil', '1/4 cup white truffle oil', '1/2 cup crème fraîche', '2 tablespoons fresh chives, minced', 'stand mixer fitted with paddle attachment and dough hook, heavy baking sheet']",
    "Instructions": "In bowl of stand mixer fitted with paddle attachment, stir together water, yeast, and sugar until dissolved, about 5 seconds. Stir in milk powder until dissolved, about 5 seconds.\nIn large bowl, whisk together flour and salt. Add to yeast mixture and mix on low speed until just combined, about 30 seconds. Switch to dough hook and mix on medium speed until dough is elastic but still sticky, about 10 minutes.\nUsing vegetable oil, lightly oil large bowl. Gently shape dough into ball and transfer to bowl. Turn over several times to coat lightly with oil, then cover with plastic wrap and let rise in warm place (75°F to 80°F, see Chef's Notes) until doubled in size, about 1 ½ hours.\nUsing vegetable oil, liberally oil heavy baking sheet. Using hands, lift dough from bowl and gently turn over several times to remove excess air. Shape into ball and transfer to prepared baking sheet. Cover with plastic wrap and let rise in warm place (75°F to 80°F, see Chef's Notes) 30 minutes.\nUsing fingertips, press and spread dough to edges of baking sheet. (If dough tears, mend hole by pressing surrounding dough together Cover with plastic wrap and let rise in warm place (75°F to 80°F, see Chef's Notes) until puffy, about 1 1/2 hours.\nPreheat oven to 475°F.\nIn medium saucepan over moderately high heat, combine potatoes, 4 sprigs thyme, garlic, salt, and enough water to cover by 1 inch. Bring to boil, then reduce heat to moderately low and simmer, uncovered, until potatoes are easily pierced with fork, about 20 minutes. Immediately drain, discarding thyme sprigs and garlic. When cool enough to handle, slice potatoes into 1/4-inch-thick rounds and reserve. (Potatoes can be prepared ahead and refrigerated, covered, up to 24 hours.)\nIn medium sauté pan over moderately high heat, heat canola oil and butter until hot but not smoking. Add mushrooms and sauté 1 minute. Add shallots and sauté until light golden brown and soft, about 2 minutes. Stir in 1/2 teaspoon salt and 1/4 teaspoon pepper, then transfer to paper-towel-lined plate and reserve. (Mushrooms can be prepared ahead and refrigerated, covered, up to 24 hours.)\nArrange potato slices on flatbread, then brush with olive oil and sprinkle with thyme leaves. Spread mushroom mixture on top, then drizzle with 2 tablespoons white truffle oil and sprinkle with 1 teaspoon salt and 1/2 teaspoon pepper. Bake, rotating pan 180 degrees halfway through, until crust is light golden brown, 20 to 22 minutes.\nWhile flatbread bakes, in small bowl, whisk together crème fraîche and remaining 2 tablespoons truffle oil.\nTransfer flatbread to large cutting board and let cool about 5 minutes. Drizzle with truffle oil–infused crème fraˆhe and sprinkle with chives. Using pizza wheel or very sharp knife, cut into slices and serve immediately.",
    "Image_Name": "flatbread-with-fingerling-potatoes-shitake-mushrooms-and-truffle-oil-351233.jpg"
  },
  {
    "Title": "Gingerbread Angels",
    "Ingredients": "['6 cups all purpose flour', '1 tablespoon ground ginger', '1 tablespoon ground cinnamon', '2 teaspoons baking soda', '1 teaspoon salt', '1/2 cup coarsely chopped crystallized ginger (about 3 ounces)', '1 cup (2 sticks) unsalted butter, room temperature', '1 cup sugar', '1/2 cup (packed) golden brown sugar', '2 large eggs', '1/4 cup mild-flavored (light) molasses', '1/4 cup fresh orange juice', '2 teaspoons finely grated orange peel', '1 egg white, beaten with 1 tablespoon water (for glaze; optional)', 'Raw sugar and/or colored sugar (optional)']",
    "Instructions": "Whisk flour, ground ginger, cinnamon, soda, and salt in large bowl. Place crystallized ginger in mini processor; add 1 tablespoon flour mixture and blend until ginger is very finely chopped. Using electric mixer, beat butter in another large bowl until smooth. Add 1 cup sugar and 1/2 cup brown sugar; beat until light and fluffy. Beat in eggs, 1 at a time. Beat in molasses, orange juice, and orange peel (batter may look curdled). Beat in crystallized ginger mixture. Blend in remaining flour-spice mixture. Gather dough together. Flatten into disk. Wrap in plastic; chill at least 4 hours.\nPosition 1 rack in top third and 1 rack in bottom third of oven; preheat to 350°F. Line 2 baking sheets with parchment. Divide dough into 4 portions; shape each into round. Chill 3 rounds. Roll out remaining dough round on floured work surface to generous 1/8-inch thickness. Using floured angel-shaped cookie cutter, cut out cookies. Gather dough scraps and reroll to generous 1/8-inch thickness; cut out more cookies. Using spatula, transfer cookies to sheets, spacing 1 inch apart. Brush cookies with glaze, then sprinkle with raw sugar and/or colored sugar, if desired.\nBake cookies until golden, reversing sheets after 7 minutes, about 14 minutes total. Let stand 2 minutes; transfer to racks to cool. Repeat with remaining dough, cooling baking sheets between batches. DO AHEAD: Can be made 1 week ahead. Store between sheets of waxed paper in airtight container.",
    "Image_Name": "gingerbread-angels-350818.jpg"
  },
  {
    "Title": "Cinnamon Pecan Shortbread",
    "Ingredients": "['2 cups all purpose flour', '1/4 cup sugar', '1/4 cup (packed) golden brown sugar', '1/4 cup cornstarch', '1 1/4 teaspoons ground cinnamon', '1/4 teaspoon salt', '1 cup (2 sticks) unsalted butter, cut into 1/2-inch cubes, room temperature', '1 large egg white, beaten to blend with 1 tablespoon water (for glaze)', '1 1/2 cups chopped toasted pecans for wedges, or 36 pecan halves for round cookies', 'Raw sugar*']",
    "Instructions": "Whisk first 6 ingredients in large bowl to blend. Add butter. Mash with back of fork until coarse meal forms. Using fingertips, work dough until smooth; shape into disk. Wrap in plastic and chill until firm but not hard, about 30 minutes.\nPosition rack in center of oven; preheat to 325°F. For wedges, shape dough into 2 disks. Place on 2 heavy baking sheets; cover with plastic. Flatten to 10-inch rounds. Remove plastic. Brush with glaze. Sprinkle with chopped pecans, then raw sugar; press to adhere. For round cookies, shape dough into 1-inch balls; arrange on 2 heavy baking sheets, spacing 2 inches apart. Cover smooth-bottomed glass with plastic. Using glass, press each dough ball to 2-inch round. Cut with scalloped cookie cutter, if desired. Brush with glaze; top with pecan half and sprinkle with raw sugar.\nBake cookies, 1 sheet at a time, until golden, about 30 minutes for large rounds and 22 minutes for small rounds. Cool large rounds on sheets 10 minutes, then cut each into 16 wedges. Cool all cookies completely on sheets. DO AHEAD: Can be made 3 days ahead. Store airtight at room temperature.\n*Also called turbinado or demerara sugar; available at most supermarkets and at natural food stores.",
    "Image_Name": "cinnamon-pecan-shortbread-350831.jpg"
  },
  {
    "Title": "Dark Gingerbread Pear Cake",
    "Ingredients": "['1 1/2 cups all-purpose flour', '1 teaspoon baking soda', '1/2 teaspoon cinnamon', '1/8 teaspoon ground allspice', '1/4 teaspoon salt', '1 stick unsalted butter', '1/4 cup water', '1/2 cup packed dark brown sugar', '1/2 cup molasses (not robust or blackstrap)', '3 large eggs', '1/4 cup grated peeled ginger', '1 Bosc pear', 'Accompaniment: whipped cream']",
    "Instructions": "Preheat oven to 350°F with rack in middle. Butter and flour a 9-inch cake pan, knocking out excess.\nWhisk together flour, baking soda, cinnamon, allspice, and salt.\nMelt butter with water.\nBeat together brown sugar and molasses with an electric mixer until combined. Add eggs 1 at a time, beating well. Beat in flour mixture at low speed until just combined. Add butter mixture and ginger, beating just until smooth. Pour into cake pan.\nPeel pear and cut into 3/4-inch pieces. Scatter over batter. Bake until a wooden pick inserted into center comes out clean, about 35 minutes. Cool slightly.",
    "Image_Name": "dark-gingerbread-pear-cake-350222.jpg"
  },
  {
    "Title": "Haunted Gingerbread House",
    "Ingredients": "['Royal icing or 1 (16-ounce) container vanilla frosting', 'Liquid food coloring in red, yellow, green, and blue', '1 undecorated gingerbread house*', 'Black licorice laces', 'Gummy spiders', 'Candy corn in assorted flavors', 'Green apple sour belts', 'Mellocreme pumpkins', 'Sugar candy bats (also called dextrose candy bats)', 'Marshmallow ghosts', '*Undecorated gingerbread houses can be purchased from Dylans Candy Bar or Amazon.com']",
    "Instructions": "Place 1/2 cup icing in small bowl and tint purple (see Decorating Tips).\nPlace 1/2 cup icing in small bowl and tint green (see Decorating tips).\nPlace 1/4 cup icing in small bowl and tint orange (see Decorating tips).\nUsing small offset spatula or knife, spread purple icing in thin, even layer on roof.\nCut black licorice laces into shorter pieces, then arrange in crisscross pattern on right side of roof to create spiderweb. Gently press into icing to secure. Arrange gummy spiders on roof, gently pressing to secure. Arrange candy corn along seam where left and right sides of roof meet. Arrange candy corn in three vertical lines on left side of roof.\nUsing small offset spatula or knife, spread green icing in thin, even layer on base of house. Arrange green apple sour belts around base of house to form grass.\nUsing small offset spatula or knife, spread small dollop of orange icing on bottom of one Mellocreme pumpkin, then place in front of house. Repeat with additional pumpkins if desired.\nUsing small offset spatula or knife, spread white icing in thin, even layer across surface of door. Gently press sugar candy bats onto door. Place small dollop of white icing on 1 sugar bat and attach to left side of roof. Repeat as desired.\nUsing small offset spatula or knife, spread small dollop of white icing on marshmallow ghost then gently press it onto front of house.\nUsing small offset spatula or knife, spread thin line of orange icing along seam where roof meets front of house. Arrange candy corn along seam, gently pressing to secure.\nArrange candy corn along sides and back of house to form fence. If necessary, secure with additional icing.\nContinue adding candy as desired.",
    "Image_Name": "haunted-gingerbread-house-350143.jpg"
  },
  {
    "Title": "Cherry Almond Shortbread Cookies",
    "Ingredients": "['24 dried tart cherries (about 1 1/2 ounces)', '1/3 cup crème de cassis (black-currant liqueur)', '1/2 cup raw almonds with skins, divided', '1/2 cup all purpose flour', '1/2 cup whole wheat flour', '1/2 teaspoon salt', '1/2 cup (1 stick) unsalted butter, room temperature', '1/2 cup powdered sugar, sifted', '1 large egg, lightly beaten']",
    "Instructions": "Soak cherries in cassis in small bowl at least 4 hours or overnight. Drain; pat dry.\nGrind 3 tablespoons almonds in mini processor until finely ground. Finely chop remaining almonds.\nWhisk all purpose flour, whole wheat flour, and salt in medium bowl. Using electric mixer, beat butter and sugar in large bowl until creamy, about 2 minutes. Add ground almonds; beat until well blended, about 1 minute. Beat in flour mixture on low speed just to blend.\nScrape dough out onto sheet of parchment or waxed paper. Using paper as aid, form dough into 81/2x13/4-inch log. Brush dough all over with egg (except for ends). Scatter chopped almonds on sheet of plastic wrap. Roll log in almonds to coat. Wrap in plastic wrap and chill at least 2 hours. DO AHEAD: Dough can be made 2 days ahead. Keep refrigerated. Cover and chill cherries.\nPreheat oven to 350°F. Let dough stand at room temperature 10 minutes. Unwrap dough and cut into 3/8-inch-thick slices. Place cookies on large ungreased baking sheet, spacing 1 inch apart. Place 1 cherry in center of each cookie.\nBake 10 minutes. Press cherries into cookies (cookies will have softened). Rotate baking sheet in oven and bake until cookies are lightly golden and slightly puffed, about 18 minutes longer. Cool cookies on sheet on rack 5 minutes. Transfer cookies to rack to cool completely. DO AHEAD: Cookies can be made 2 days ahead. Store airtight at room temperature.",
    "Image_Name": "cherry-almond-shortbread-cookies-350132.jpg"
  },
  {
    "Title": "Ground Coriander and Cilantro Flatbreads",
    "Ingredients": "['1 1/2 cups (or more) unbleached all purpose flour', '2 1/2 teaspoons ground coriander', '1 1/2 teaspoons baking powder', '3/4 teaspoon salt', '1/2 teaspoon baking soda', '1/3 cup chopped fresh cilantro', '3/4 cup (or more) plain whole-milk yogurt', 'Olive oil (for frying)']",
    "Instructions": "Sift first 5 ingredients into medium bowl. Stir in cilantro. Add yogurt and stir with fork until small clumps form. Knead mixture in bowl just until dough holds together, adding more flour or yogurt by tablespoonfuls for soft and slightly sticky dough. Turn dough out onto floured surface. Knead just until smooth, about 1 minute. Divide dough into 8 equal pieces.\nRoll each piece into ball, then roll each dough piece out on floured surface to 4 1/2-inch round. Brush large nonstick skillet generously with olive oil; heat over medium heat. Working in batches, add 3 dough rounds to skillet; cook until golden brown and puffed, adjusting heat to medium-high as needed to brown evenly, about 3 minutes per side. Transfer flatbreads to platter; serve warm.",
    "Image_Name": "ground-coriander-and-cilantro-flatbreads-242112.jpg"
  },
  {
    "Title": "Texas Buttermilk Cornbread",
    "Ingredients": "['unsalted butter', '2 cups yellow cornmeal', '6 tablespoons all purpose flour', '1 tablespoon baking powder', '1/2 teaspoon salt', '1/8 teaspoon baking soda', '1 1/3 cups buttermilk']",
    "Instructions": "Preheat oven to 400°F. Brush 8x8x2-inch glass baking dish with 2 tablespoons butter. Place dish in oven 10 minutes (butter may brown).\nMeanwhile, whisk cornmeal, flour, baking powder, salt, and baking soda in large bowl to blend. Add buttermilk and remaining 6 tablespoons melted butter. Stir batter just until evenly moistened (do not over mix).\nTransfer cornbread batter to hot dish and spread evenly. Bake cornbread until crusty on top and tester inserted into center comes out clean, about 25 minutes. Let cornbread cool at least 10 minutes. Serve warm.",
    "Image_Name": "texas-buttermilk-cornbread-241130.jpg"
  },
  {
    "Title": "Sage-Scented Shortbread",
    "Ingredients": "['2 cups all purpose flour', '1/2 cup powdered sugar', '2 tablespoons thinly sliced fresh sage leaves or 2 teaspoons dried sage', '1 teaspoon coarse kosher salt', '1 cup (2 sticks) unsalted butter, cut into 1/2-inch-thick pieces, room temperature']",
    "Instructions": "Blend first 4 ingredients in processor. Add butter; using on/off turns, process until dough comes together. Divide in half. Shape each dough piece into log about 1 1/2 inches in diameter. Chill until firm enough to slice, about 30 minutes.\nPosition 1 rack in top third and 1 rack in bottom third of oven; preheat to 350°F. Line 2 baking sheets with parchment. Cut each dough log into 1/3- to 1/2-inch-thick rounds; place on sheets. Bake 10 minutes. Reverse sheets so bottom sheet is on top rack of oven and top sheet is on bottom rack. Bake until cookies are golden, about 15 minutes longer. Cool on racks.",
    "Image_Name": "sage-scented-shortbread-240377.jpg"
  },
  {
    "Title": "Sage and Honey Skillet Cornbread",
    "Ingredients": "['1 cup cornmeal (preferably whole grain, medium grind)', '1 cup unbleached all purpose flour', '1 tablespoon baking powder', '1 teaspoon salt', '2 teaspoons chopped fresh sage plus 12 whole fresh sage leaves', '1 cup whole milk', '1/2 cup honey', '1 large egg', '1/2 cup (1 stick) unsalted butter']",
    "Instructions": "Preheat oven to 400°F. Heat heavy 10-inch-diameter ovenproof skillet (preferably cast-iron) in oven 10 minutes.\nWhisk first 4 ingredients and 2 teaspoons chopped sage in large bowl to blend. Whisk milk, honey, and egg in medium bowl to blend.\nRemove skillet from oven; add 1/2 cup butter. Swirl until butter is melted. Pour all except 2 tablespoons butter into egg mixture. Add whole sage leaves to butter in skillet; toss to coat. Arrange leaves over bottom of skillet, spacing apart.\nAdd egg mixture to cornmeal mixture; stir until just combined (do not overmix; batter will be wet and runny). Pour batter over sage leaves in skillet. Bake until browned around edges and tester inserted into center comes out clean, about 22 minutes. Cool in skillet 10 minutes. Invert onto platter. If necessary, reposition sage leaves atop cornbread.",
    "Image_Name": "sage-and-honey-skillet-cornbread-240376.jpg"
  },
  {
    "Title": "Shortbread Cookies",
    "Ingredients": "['1 cup all purpose flour', '1/4 cup sugar', '1/4 teaspoon salt', '1/2 cup (1 stick) chilled unsalted butter, cut into 1/2-inch cubes']",
    "Instructions": "Preheat oven to 300°F. Lightly butter 9-inch-diameter springform pan. Whisk flour, sugar, and salt in medium bowl to blend. Add 1/2 cup butter and rub in with fingertips until mixture resembles coarse meal. Gather dough together and form into ball; flatten into disk. Roll out dough on lightly floured surface to 1/2-inch-thick round. Transfer round to prepared pan. Using fingers, press dough evenly over bottom to edges of pan. Using tip of small sharp knife, score dough into 8 equal triangles, then pierce all over with fork. Bake until shortbread is cooked through and pale golden, about 45 minutes.\nUsing tip of sharp knife, cut warm shortbread into triangles along scored lines. Run knife around shortbread to loosen. Cool in pan at least 30 minutes. Release springform pan sides. Using spatula, carefully remove shortbread from pan (shortbread will be fragile). DO AHEAD Can be made 1 day ahead. Store shortbread airtight in single layer at room temperature.",
    "Image_Name": "shortbread-cookies-237919.jpg"
  },
  {
    "Title": "Cornbread Muffins with Maple Butter",
    "Ingredients": "['3/4 cup (1 1/2 sticks) unsalted butter, room temperature', '3 1/2 tablespoons pure maple syrup (preferably grade B)', '1 cup yellow cornmeal', '1 cup unbleached all purpose flour', '1/4 cup sugar', '1 tablespoon baking powder', '1/4 teaspoon salt', '1 cup buttermilk', '1 large egg', '5 tablespoons unsalted butter, melted, cooled slightly']",
    "Instructions": "Using electric mixer, beat butter in medium bowl until creamy. Gradually beat in maple syrup until well blended and smooth. DO AHEAD Can be made 1 week ahead. Cover and refrigerate.\nPreheat oven to 375°F. Butter 12 regular (1/3-cup) muffin cups. Sift cornmeal, flour, sugar, baking powder, and salt into medium bowl. Whisk buttermilk and egg in another medium bowl; whisk in melted butter. Add buttermilk mixture to dry ingredients; stir just until incorporated (do not overmix). Divide batter equally among prepared muffin cups. Bake muffins until tester inserted into center comes out clean, about 15 minutes (muffins will be pale). Cool on rack 10 minutes. Serve with maple butter.",
    "Image_Name": "cornbread-muffins-with-maple-butter-237892.jpg"
  },
  {
    "Title": "Real Gingerbread",
    "Ingredients": "['2 1/4 cups all-purpose flour', '1 teaspoon baking soda', '1 teaspoon ground cinnamon', '1/4 teaspoon ground allspice', '1/2 teaspoon salt', '1 stick (1/2 cup) unsalted butter, well softened', '2/3 cup molasses (not blackstrap)', '2/3 cup packed dark brown sugar', '2 large eggs', '3 tablespoons finely grated (with a rasp) peeled fresh ginger', '2/3 cup hot water']",
    "Instructions": "Put oven rack in middle position and preheat oven to 350°F. Butter a 9-inch square baking pan.\nWhisk together flour, baking soda, spices, and salt in a bowl.\nBeat together butter, molasses, brown sugar, eggs, and ginger in a large bowl with an electric mixer at medium speed until combined. Reduce speed to low and mix in flour mixture until smooth, then add hot water and mix until combined (batter may appear curdled).\nPour batter into pan and bake until a wooden pick or skewer inserted in center of cake comes out clean, 35 to 40 minutes. Cool to warm in pan on a rack.",
    "Image_Name": "real-gingerbread-237680.jpg"
  },
  {
    "Title": "Caramelized-Onion Flatbreads with Crème Fraîche",
    "Ingredients": "['1/4 cup plus 1 tablespoon warm water (105°F to 115°F)', '3/4 teaspoon active dry yeast', '3/4 cup plus 2 tablespoons all purpose flour', '3/4 teaspoon nigella (kalonji) seeds', '1/2 teaspoon salt', '1 tablespoon butter, room temperature', '2 tablespoons extra-virgin olive oil', '1 pound onions (about 2 medium), cut into 1/3-inch-thick wedges through root ends', '2 teaspoons chopped fresh thyme', '1 teaspoon honey', '1 tablespoon Sherry wine vinegar', '1/2 cup crème fraîche', '1 large egg', '1/2 teaspoon salt', '1/4 teaspoon ground black pepper', 'Semolina flour (pasta flour)* or cornmeal', '2 tablespoons chopped fresh chives']",
    "Instructions": "Whisk 1/4 cup plus 1 tablespoon warm water and yeast in small bowl; let stand until yeast is dissolved, about 10 minutes.\nMix flour, nigella seeds, and salt in medium bowl. Add yeast mixture and stir with wooden spoon until mixture clumps together. Add butter; mix until incorporated. Turn dough out onto lightly floured work surface and knead until smooth and elastic, about 5 minutes. Divide dough into 6 equal pieces; roll each into ball. Place on baking sheet; cover with plastic wrap. (Can be prepared 1 day ahead. Keep covered and refrigerate.)\nHeat oil in large nonstick skillet over medium-high heat. Add onion wedges to skillet and cook without turning until beginning to brown, about 7 minutes. Carefully turn onions over; reduce heat to medium and continue to cook until onions are tender and brown, occasionally stirring gently, about 10 minutes. Add thyme and honey; cook 1 minute. Stir in vinegar. Seasonto taste with salt and pepper. Remove skillet from heat. Cool. (Can be prepared 1 day ahead. Cover and refrigerate.)\nLet dough rise in warm draft-free area until doubled, about 1 hour. Whisk crème fraîche and egg in small bowl to blend. Stir in 1/2 teaspoon salt and 1/4 teaspoon pepper.\nPreheat oven to 450°F. Sprinkle 2 rimmed baking sheets lightly with semolina flour. Roll out each dough ball to 5-inch round. Transfer 3 rounds to each prepared baking sheet. Let rest 10 minutes. Pierce dough rounds all over with fork. Spread 1 generous tablespoon crème fraîche mixture over each dough round, leaving 1/4-inch plain border. Arrange onions evenly atop each; drizzle lightly with crème fraîche mixture (mixture may spill over edges of dough).\nBake flatbreads until crusts are puffed and golden, about 12 minutes. Transfer to plates; sprinkle with chives.\n*Available at some supermarkets, and at specialty foods stores and Italian markets.",
    "Image_Name": "caramelized-onion-flatbreads-with-creme-fraiche-233905.jpg"
  },
  {
    "Title": "Caramel Pudding Tart with Almond Shortbread Crust",
    "Ingredients": "['1/2 cup slivered almonds, toasted, cooled', '1/4 cup sugar', '1 cup all purpose flour', '1/4 cup powdered sugar', '1/4 teaspoon salt', '1/2 cup (1 stick) chilled unsalted butter, cut into 1/2-inch cubes', '1 large egg yolk', '2 1/2 tablespoons cornstarch', '1/4 teaspoon salt', '2 1/4 cups whole milk, divided', '3 large egg yolks', '1 cup sugar', '1/3 cup water', '3 tablespoons unsalted butter', '1/2 teaspoon vanilla extract', '2/3 cup sugar', '1/3 cup water', '1 cup slivered almonds', '1/2 cup chilled heavy whipping cream', '1/2 tablespoon powdered sugar', '1/8 teaspoon vanilla extract', 'Fleur de sel*', '*A type of sea salt; available at some supermarkets and at specialty foods stores.']",
    "Instructions": "Butter 9-inch-diameter tart pan with removable bottom. Combine almonds and 1/4 cup sugar in processor; grind nuts finely. Add flour, powdered sugar, and salt; blend 5 seconds. Add butter and blend, using on/off turns, until coarse meal forms. Add egg yolk and blend until moist clumps form, about 30 seconds. Knead dough into ball. Transfer 1/4 cup dough to small bowl and reserve for another use. Press remaining dough evenly onto bottom and up sides of prepared pan. Pierce bottom all over with fork. Cover pan with foil and freeze crust at least 1 hour and up to 1 day.\nPreheat oven to 375°F. Bake crust uncovered until deep golden brown, checking often and pressing sides and bottom with back of fork during first 15 minutes when crust puffs or bubbles, about 20 minutes total. Cool completely.\nPlace cornstarch and salt in medium bowl. Gradually add 1/4 cup milk, whisking until cornstarch dissolves. Whisk in egg yolks.\nStir sugar and 1/3 cup water in heavy large saucepan over medium-high heat until sugar dissolves. Bring to boil, brushing down pan sides with wet pastry brush. Boil without stirring until syrup is deep amber, swirling pan occasionally, about 10 minutes. Add 2 cups milk (mixture will bubble). Whisk until caramel bits dissolve. Slowly whisk hot milk mixture into yolk mixture; return to same pan. Whisk until pudding thickens and boils, about 2 minutes. Remove from heat. Whisk in butter and vanilla. Transfer to crust. Chill uncovered until cold and just firm, at least 3 hours. Do ahead Can be made 1 day ahead.\nStir 2/3 cup sugar and 1/3 cup water in heavy medium skillet (do not use nonstick) over medium-high heat until sugar dissolves. Bring to boil, brushing down pan sides with wet pastry brush. Boil without stirring until syrup is medium amber color, about 7 minutes. Add almonds and stir to coat evenly with caramel. Immediately scrape coated almonds onto sheet of foil. Working quickly with 2 forks, separate almonds and spread out in single layer. Cool completely. Do ahead Let almonds stand at room temperature up to 6 hours or cover and chill up to 1 day. Break almonds into small clusters before using.\nPress bottom of pan up, releasing tart. Whisk cream, powdered sugar, and vanilla in bowl until peaks form; spread over tart. Sprinkle almond clusters with fleur de sel. Garnish tart with clusters.",
    "Image_Name": "caramel-pudding-tart-with-almond-shortbread-crust-236889.jpg"
  },
  {
    "Title": "Gingerbread Trees with Juniper Berry Glaze",
    "Ingredients": "['2 1/4 cups unbleached all purpose flour', '1 teaspoon ground ginger', '1 teaspoon ground allspice', '1/2 teaspoon ground cinnamon', '1/2 teaspoon baking soda', '1/2 teaspoon salt', '1 cup (2 sticks) unsalted butter, room temperature', '1/2 cup (packed) golden brown sugar', '1/4 cup mild-flavored (light) molasses', '3/4 cup half and half', '1/3 cup (1 ounce) juniper berries, lightly crushed', '1 pound powdered sugar', 'Assorted decorations (colored sugars, nonpareils, and dragées)']",
    "Instructions": "Whisk first 6 ingredients in medium bowl. Beat butter and sugar in large bowl until fluffy. Beat in molasses. Beat in dry ingredients. Gather dough; divide into 4 pieces. Shape into disks. Wrap; chill at least 2 hours and up to 2 days.\nPreheat oven to 350°F. Line 2 baking sheets with parchment. Roll out 1 dough disk to 1/8-inch thickness. Using 3 1/2-inch cutter, cut out cookies. Transfer to sheet. Gather scraps; chill.\nBake cookies until almost firm in center, 12 minutes. Cool on sheets 2 minutes, then cool on racks. Repeat, using all dough. Do ahead Store airtight at room temperature up to 3 days or freeze up to 2 weeks.\nBring first 2 ingredients to simmer. Cover; chill 5 hours. Strain. Place powdered sugar in bowl. Whisk in half and half by spoonfuls until glaze is spreadable. Frost cookies; decorate. Let stand until glaze sets. Do ahead Store between sheets of waxed paper in airtight container at room temperature up to 3 days.",
    "Image_Name": "gingerbread-trees-with-juniper-berry-glaze-236805.jpg"
  },
  {
    "Title": "Scottish Sharp-Cheddar Shortbread",
    "Ingredients": "['1/2 cup (1 stick) unsalted butter, at room temperature', '1/2 teaspoon salt', '1/4 teaspoon freshly ground black pepper', 'Pinch of cayenne pepper', '8 ounces extra-sharp white Cheddar cheese, finely shredded', '1 cup unbleached all-purpose flour']",
    "Instructions": "Using electric mixer fitted with whisk attachment, beat together butter, salt, black pepper, and cayenne at low speed just until blended. Add Cheddar and flour and mix at low speed just until smooth (do not overmix). Shape dough into disk, wrap in plastic wrap or waxed paper, and chill 30 minutes.\nArrange racks in upper and lower thirds of oven and preheat to 350°F. Line 2 large baking sheets with parchment paper.\nOn lightly floured surface, roll out dough to 1/4- to 1/8-inch-thick round. Using 1 1/2- to 2-inch round cutter, cut out rounds and arrange 1 1/2 inches apart on baking sheets. Reroll scraps if desired (rerolled scraps will be tougher).\nBake shortbread until lightly golden and beginning to brown on edges, about 13 to 15 minutes. Cool on sheets 5 minutes, then transfer to racks to cool completely.",
    "Image_Name": "scottish-sharp-cheddar-shortbread-236735.jpg"
  },
  {
    "Title": "Norwegian Flatbreads",
    "Ingredients": "['4 medium-large russet potatoes (about 2 pounds), finely diced', '5 tablespoons unsalted butter, cut into 1/2-inch slices', '1 3/4 teaspoons kosher salt', '1/2 cup heavy cream', '2 cups unbleached all-purpose flour', '1/2 cup sugar', '1 teaspoon cinnamon', 'About 3 cups unbleached all-purpose flour', '4 tablespoons salted butter, melted']",
    "Instructions": "In medium saucepan over high heat, combine potatoes and cold water to cover. Cover and bring to boil, then reduce heat to low and simmer until tender, about 15 minutes. Drain well and force potatoes through ricer or food mill into large bowl. Stir in butter. Add salt and cream and stir until smooth. Add flour and stir until dough forms (do not overmix). Cover and chill at least 6 hours and up to 3 days.\nIn small bowl, whisk together sugar and cinnamon. Lightly oil 10-inch cast iron skillet and set over moderately low heat. Have ready rolling pin, pastry bench scraper, and thin metal spatula.\nTurn dough out onto well-floured work surface. Using pastry bench scraper, cut in half and return half to bowl. Cut other piece in half again; cut 1 piece into 8 small pieces and reserve other piece.\nPat 1 small piece to flatten. Dough may be very soft and sticky, depending on moisture content of potato — add some of 3 cups flour as needed to prevent sticking. Using scraper, flip dough over and pat again to flatten. Roll patty out to 7-inch circle.\nUsing pastry bench scraper, carefully transfer flatbread to hot skillet and cook until dough bubbles and is beginning to brown underneath, less than 1 minute. Using thin, flexible metal spatula, flip flatbread over and cook other side until lightly brown, about 1 minute. Transfer to plate and brush off any excess flour. Scrape any excess flour out of skillet.\nRepeat rolling and cooking with 8 small pieces of dough, then divide remaining piece of dough on counter into 8 pieces and roll and cook each piece. Repeat process with remaining dough in bowl to make 32 flatbreads.\nTo serve, brush warm lefse with melted butter, sprinkle with cinnamon-sugar, and roll up. Serve warm.",
    "Image_Name": "norwegian-flatbreads-236734.jpg"
  },
  {
    "Title": "Gingerbread Puddings with Candied Apples",
    "Ingredients": "['8 cups unsweetened apple cider or apple juice', '1 1/2 pounds Granny Smith apples, peeled, cored, cut into 1/3-inch cubes (about 4 1/2 cups)', '3/4 cup (packed) golden brown sugar', '1 3/4 cups all purpose flour', '1 tablespoon ground ginger', '1 teaspoon baking soda', '1 teaspoon ground cinnamon', '1/4 teaspoon salt', '1/4 teaspoon ground cloves', '1/4 teaspoon finely ground black pepper', '1/2 cup (1 stick) unsalted butter, room temperature', '3/4 cup (packed) golden brown sugar', '1 large egg', '3/4 cup mild-flavored (light) molasses', '1/2 cup boiling water', '3 cups whole milk', '2 4-inch-long pieces fresh ginger (about 4 ounces), peeled, thickly sliced', '1 tablespoon whole black peppercorns', '4 large eggs', '3/4 cup sugar', '1 teaspoon vanilla extract', '1 teaspoon ground ginger', 'Pinch of salt', 'Ice cream or crème fraîche*', '*Available at some supermarkets and at specialty foods stores.']",
    "Instructions": "Combine all ingredients in large pot. Bring to boil over high heat, stirring until sugar dissolves. Reduce heat to medium and simmer until apples are soft and translucent and cider coats apples thickly, stirring occasionally, about 2 hours. Transfer to bowl and cool. DO AHEAD Can be made 1 week ahead. Cover and chill. Bring to room temperature before serving.\nPreheat oven to 350°F. Butter 9x9x2-inch metal baking pan. Whisk first 7 ingredients in medium bowl to blend. Using electric mixer, beat butter in large bowl until fluffy. Add brown sugar and egg and beat until blended. Beat in molasses, then flour mixture. Using rubber spatula, stir in 1/2 cup boiling water. Transfer batter to prepared pan.\nBake gingerbread until tester inserted into center comes out clean, about 40 minutes. Transfer pan to rack and cool gingerbread completely in pan. DO AHEAD Can be made 1 day ahead. Cover pan with foil; let stand at room temperature.\nPreheat oven to 325°F. Combine milk, fresh ginger, and peppercorns in heavy medium saucepan; bring to simmer. Remove from heat. Whisk eggs, sugar, vanilla, ground ginger, and salt in medium bowl to blend. Gradually whisk hot milk mixture into egg mixture. Strain custard into medium bowl; discard solids in strainer.\nCut enough gingerbread into 1/2-inch cubes to measure 5 1/3 cups (reserve any remaining gingerbread for another use). Divide gingerbread cubes among eight 3/4-cup custard cups or ramekins. Pour custard over gingerbread in each cup, dividing equally. Let stand 15 minutes to allow gingerbread to absorb some custard.\nPlace cups in roasting pan. Pour enough hot water into pan to come halfway up sides of cups. Cover pan with foil. Bake puddings until set, about 1 hour. Remove from water bath.\nServe puddings warm or at room temperature, topped with candied apple garnish and ice cream.",
    "Image_Name": "gingerbread-puddings-with-candied-apples-236546.jpg"
  },
  {
    "Title": "Cheesy Zucchini and Red Onion Flatbread",
    "Ingredients": "['Nonstick vegetable oil spray', '1 10-ounce tube refrigerated pizza dough', '3/4 cup garlic-and-herb cheese spread (such as Alouette), divided', '3/4 cup finely grated Parmesan cheese, divided', '3 tablespoons chopped fresh Italian parsley, divided', '1 small red onion', '1 7- to 8-inch-long zucchini (yellow or green), cut crosswise into 1/8-inch-thick rounds, divided', 'Olive oil']",
    "Instructions": "Preheat oven to 400°F. Line baking sheet with parchment paper; spray with nonstick spray. Unroll dough onto parchment. Spread half of herb cheese over 1 long half of dough, leaving 1/2-inch plain border. Sprinkle with half of Parmesan and 2 tablespoons parsley. Using parchment as aid, fold plain half of dough over filled half (do not seal edges). Spread remaining herb cheese over top; sprinkle with remaining Parmesan. Remove enough outer layers of onion to yield 2-inch-diameter core; cut into 1/8-inch-thick rounds. Arrange 1 row of zucchini down 1 long side of dough. Arrange onion rounds in row alongside zucchini. Arrange 1 more row of zucchini alongside onion. Brush vegetables with oil; sprinkle with salt and pepper. Bake bread until puffed and deep brown at edges, about 24 minutes. Sprinkle with 1 tablespoon parsley.",
    "Image_Name": "cheesy-zucchini-and-red-onion-flatbread-235578.jpg"
  },
  {
    "Title": "Mango Gingerbread with Macadamia Streusel",
    "Ingredients": "['1/3 cup finely chopped lightly salted dry-roasted macadamia nuts', '1/4 cup sugar', '2 1/2 tablespoons finely chopped crystallized ginger', '2 cups all purpose flour', '3/4 cup (packed) golden brown sugar', '1 1/2 tablespoons ground ginger', '2 teaspoons baking powder', '1 teaspoon baking soda', '1/4 teaspoon salt', '1 pound ripe mangoes, peeled, pitted', '1/2 cup buttermilk', '1/4 cup canola oil', '2 large eggs']",
    "Instructions": "Stir all ingredients in small bowl to blend.\nPosition rack in center of oven and preheat to 350°F. Butter 9x9x2-inch metal baking pan. Whisk first 6 ingredients in medium bowl to blend. Coarsely puree mangoes in food processor. Transfer 1 cup mango puree to large bowl (reserve any remaining puree for another use). Add buttermilk, oil, and eggs to puree; whisk until blended. Add flour mixture; stir just until combined. Transfer half of batter (about 2 cups) to prepared pan. Sprinkle half of streusel over. Spoon remaining batter over, smooth evenly with spatula, then sprinkle with remaining streusel.\nBake bread until springy to touch and tester inserted into center comes out clean, about 45 minutes. Cool completely in pan on rack. (Can be made 8 hours ahead. Cover and store at room temperature.) Cut bread into 9 squares and serve.\nButtermilk and baking soda help give the gingerbread a tender texture.",
    "Image_Name": "mango-gingerbread-with-macadamia-streusel-233912.jpg"
  },
  {
    "Title": "Apricot-Orange Shortbread Bars",
    "Ingredients": "['1 cup apricot preserves', '3 tablespoons orange liqueur (such as Grand Marnier)', '1 cup (2 sticks) unsalted butter, room temperature', '3/4 cup sugar', '1 teaspoon almond extract', '2 cups all purpose flour', '1/4 teaspoon salt', '1/4 cup (packed) almond paste (from 7-ounce roll), crumbled', '1/2 cup sliced almonds, divided']",
    "Instructions": "Preheat oven to 325°F. Butter 9x9x2-inch metal baking pan; line bottom and sides of pan with parchment paper, extending over sides. Butter parchment. Mix preserves and orange liqueur in small bowl; set aside.\nUsing electric mixer, beat 1 cup butter and sugar in large bowl until well blended. Beat in almond extract. Add flour and salt; beat just until blended. Transfer 1 cup of dough to another small bowl; add crumbled almond paste and mix with fingertips until small clumps form. Mix in 1/4 cup sliced almonds; set aside for topping.\nPress remaining dough evenly onto bottom of prepared pan. Spread preserves mixture evenly over. Using fingertips, coarsely crumble topping over preserves, then sprinkle 1/4 cup almonds over. Press topping lightly into preserves.\nBake shortbread until top and crust edges are golden brown, about 1 hour. Cool completely in pan on rack. Using parchment paper as aid, lift shortbread from pan. Cut shortbread into 4 equal strips, then cut each strip crosswise into 8 small bar cookies. (Can be prepared ahead. Store in single layer in airtight container at room temperature up to 4 days or freeze up to 2 weeks.)",
    "Image_Name": "apricot-orange-shortbread-bars-233425.jpg"
  },
  {
    "Title": "Chocolate-Dipped Shortbread",
    "Ingredients": "['2 sticks (1/2 pound) unsalted butter, at room temperature', '2/3 cup sugar', '2 teaspoons vanilla extract', '1/2 teaspoon salt', '2 1/4 cups all-purpose flour', '8 ounces high-quality semisweet chocolate, finely chopped']",
    "Instructions": "Arrange racks in upper and lower thirds of oven and preheat to 325°F. Line 2 large cookie sheets with parchment paper.\nIn electric mixer, beat butter, sugar, vanilla, and salt at medium speed just until smooth. Add flour and mix at low speed until combined. Divide dough in half and shape into 2 disks.\nOn lightly floured work surface, roll out 1 piece dough to 1/4-inch-thick rectangle. Using fluted pastry wheel or large knife, cut into 2- by 1-inch rectangles. Transfer cookies to baking sheets, spacing 1 1/2 inches apart. Repeat with remaining dough.\nPrick each cookie several times with tines of fork, then chill 10 minutes. Bake until edges are golden, about 15 minutes. Cool on pans 5 minutes, then transfer to racks and cool completely.\nTo decorate: Line baking sheet with clean parchment or wax paper. In medium heatproof bowl set over saucepan of simmering water, melt half chocolate. Add remaining chocolate, remove bowl from heat, and stir occasionally until smooth. Pour into small bowl.\nDip each cookie halfway into chocolate, let excess drip off, and place on baking sheet. Let stand until chocolate is set, about 1 hour. Store in airtight container at room temperature. (Do not refrigerate.)",
    "Image_Name": "chocolate-dipped-shortbread-233311.jpg"
  },
  {
    "Title": "Cornbread Casserole and Butternut Squash, Mushrooms, and Ancho Mole",
    "Ingredients": "['3 tablespoons extra-virgin olive oil', '2 1/2 cups chopped onions', '1 1/4 pounds assorted wild mushrooms (such as oyster, chanterelle, and portobello), coarsely chopped', '1 1/2 tablespoons chopped fresh sage', '4 teaspoons chopped fresh thyme', '3 large garlic cloves, chopped', '2 1/2 teaspoons ground cumin', '4 cups 1/2-inch cubes seeded peeled butternut squash (about 2 1/2 pounds)', '2 cups drained rinsed black beans (from two 15-ounce cans)', '2 cups diced tomatoes in juice (from two 14 1/2-ounce cans)', '1/2 cup water', '4 cups Masa Harina (corn tortilla mix)', '2/3 cup yellow cornmeal', '2 1/4 teaspoons salt', '3/4 teaspoon baking powder', '4 1/4 cups (or more) water', '10 tablespoons (1 1/4 sticks) butter, melted, divided', '2 large eggs', '1 large egg yolk', '2 cups (packed) coarsely grated extra-sharp white cheddar cheese (about 8 ounces)', '3 tablespoons finely chopped fresh Italian parsley', 'Ancho Mole']",
    "Instructions": "Heat oil in large pot over medium-high heat. Add onions; sauté until golden, about 10 minutes. Add mushrooms; sauté until tender, about 10 minutes. Add sage, thyme, garlic, and cumin; stir 1 minute. Add squash, beans, tomatoes with juice, and 1/2 cup water; bring to boil. Reduce heat to medium, cover, and simmer 8 minutes. Uncover and simmer until vegetables are tender and most of liquid has evaporated but mixture is still very moist, about 12 minutes. Season filling generously with salt and pepper. (Can be made 1 day ahead. Cool slightly. Cover; chill.)\nPreheat oven to 350°F. Butter 15x10x2-inch glass baking dish. Mix Masa Harina, cornmeal, salt, and baking powder in large bowl. Whisk 4 1/4 cups water, 6 tablespoons melted butter, eggs, and egg yolk in another large bowl to blend. Stir egg mixture into Masa Harina mixture. Stir in cheese and parsley, adding more water by tablespoonfuls as needed to form thick moist dough.\nTransfer 4 cups dough to prepared baking dish. Place large piece of plastic wrap atop dough. Using plastic as aid, press dough evenly over bottom and 3/4 of the way up sides of dish; peel off plastic. Spoon filling into dough in dish, spreading evenly. Spoon remaining dough in small dollops atop filling. Using offset spatula, gently spread dollops evenly over filling to cover. Press top and bottom dough together at edges to seal, enclosing filling. (Can be made 1 day ahead. Cover; chill.)\nBrush top of casserole with 4 tablespoons melted butter. Bake until dough is light golden and casserole is heated through, about 1 hour (or about 1 hour 15 minutes if chilled). Cool 10 minutes. Cut into squares; serve with Ancho Mole.",
    "Image_Name": "cornbread-casserole-and-butternut-squash-mushrooms-and-ancho-mole-233151.jpg"
  },
  {
    "Title": "Chocolate-Covered Gingerbread Kids",
    "Ingredients": "['1 3/4 cups plus 2 tablespoons all purpose flour', '2 teaspoons ground ginger', '3/4 teaspoon ground cinnamon', '1/2 teaspoon baking powder', '1/4 teaspoon baking soda', '1/4 teaspoon ground nutmeg', '1/4 teaspoon ground cloves', '6 tablespoons (packed) golden brown sugar', '1/4 cup (1/2 stick) unsalted butter, room temperature', '3 tablespoons mild-flavored (light) molasses', '1 large egg', '6 ounces semisweet chocolate, chopped', '2 teaspoons vegetable oil', 'Cinnamon decorating candies or chopped crystallized ginger']",
    "Instructions": "Position rack in center of oven and preheat to 325°F. Line 2 large baking sheets with parchment paper. Whisk first 7 ingredients in large bowl to blend. Stir brown sugar, butter, and molasses in medium saucepan over low heat until melted. Increase heat to medium-high and bring to boil, stirring constantly. Remove from heat. Let cool 10 minutes. Whisk egg in medium bowl to blend. Gradually whisk molasses mixture into egg. Using electric mixer, gradually beat molasses mixture into flour mixture until just blended.\nRoll dough out on lightly floured surface to 12x10-inch rectangle. Cut out gingerbread with cookie cutters. Transfer to baking sheets, spacing 1 inch apart. Gather scraps and roll out on lightly floured surface; cut out additional cookies. Repeat until all dough is used.\nBake cookies, 1 sheet at a time, until puffed and tops are firm, about 10 minutes. Cool on sheets 5 minutes. Transfer to rack; cool completely.\nPlace rack over rimmed baking sheet. Stir chocolate and oil in top of double boiler set over barely simmering water until melted. Holding bottom of 1 cookie, dip top into chocolate, allowing excess to drip off. Transfer cookies, chocolate-side up, to prepared rack. Repeat with remaining cookies and chocolate. Decorate cookies with candies or ginger. Chill cookies until chocolate is set, about 30 minutes. (Cookies can be made 3 days ahead. Store in single layer in airtight container in refrigerator.) Let cookies stand at room temperature 15 minutes before serving.",
    "Image_Name": "chocolate-covered-gingerbread-kids-231309.jpg"
  },
  {
    "Title": "Old-Fashioned Gingerbread with Molasses Whipped Cream",
    "Ingredients": "['1 cup plus 1 tablespoon sugar', '1/2 cup (1 stick) unsalted butter, room temperature', '3/4 cup plus 2 tablespoons mild-flavored (light) molasses', '2 large eggs', '2 cups all purpose flour', '2 teaspoons baking soda', '1 1/4 teaspoons ground cinnamon', '3/4 teaspoon ground ginger', '1/2 teaspoon salt', '1 1/2 cups chilled whipping cream, divided', '3/4 cup boiling water']",
    "Instructions": "Preheat oven to 350°F. Butter and flour 9x9x2-inch metal baking pan. Using electric mixer, beat 1 cup sugar and butter in large bowl until blended. Beat in 3/4 cup molasses, then eggs 1 at a time. Sift in flour, baking soda, cinnamon, ginger, and salt; beat until blended. Beat in 1/4 cup cream, then 3/4 cup boiling water. Transfer batter to prepared pan.\nBake cake until tester inserted into center comes out clean, about 45 minutes. Cool cake in pan on rack.\nBeat 1 1/4 cups cream and 1 tablespoon sugar in medium bowl until peaks form. Fold in 2 tablespoons molasses just until streaks appear (do not overmix). Cut cake into slices; transfer to plates. Serve with molasses whipped cream.",
    "Image_Name": "old-fashioned-gingerbread-with-molasses-whipped-cream-231121.jpg"
  },
  {
    "Title": "Green Onion-Jalapeño Cornbread",
    "Ingredients": "['3/4 cup all purpose flour', '3/4 cup yellow cornmeal', '1/4 cup sugar', '1 1/2 teaspoons salt', '1 1/2 teaspoons baking powder', '1 teaspoon baking soda', '1/2 cup thinly sliced green onions', '2 teaspoons minced jalapeño chile with seeds', '1 1/4 cups buttermilk', '2 large eggs', '1/4 cup (1/2 stick) unsalted butter, melted, cooled']",
    "Instructions": "Preheat oven to 350°F. Butter 13x9x2-inch metal baking pan. Whisk flour, cornmeal, sugar, salt, baking powder, and baking soda in large bowl to blend. Stir in green onions and jalapeño. Whisk buttermilk and eggs in medium bowl to blend, then whisk in melted butter. Add buttermilk mixture to dry ingredients and stir just until blended (do not overmix). Transfer batter to prepared pan (batter will come only about 3/4 inch up sides of pan).\nBake cornbread until lightly browned on top and tester inserted into center comes out clean, about 25 minutes. Transfer pan to rack and cool cornbread completely in pan. (Cornbread can be prepared 1 day ahead. Cover tightly with foil and store at room temperature.)",
    "Image_Name": "green-onion-jalapeno-cornbread-231072.jpg"
  },
  {
    "Title": "Gingerbread Snowflakes",
    "Ingredients": "['2/3 cup molasses (not robust)', '2/3 cup packed dark brown sugar', '1 tablespoon ground ginger', '1 1/2 teaspoons ground cinnamon', '1/2 teaspoon ground allspice', '1/2 teaspoon ground cloves', '2 teaspoons baking soda', '2 sticks (1 cup) unsalted butter, cut into tablespoon pieces', '1 large egg, lightly beaten', '3 3/4 to 4 cups all-purpose flour', '1/2 teaspoon salt', 'Decorating icing', '1 metal offset spatula', '1 pastry bag fitted with 1/8- to 1/4-inch plain tip', 'assorted 2- to 3-inch cookie cutters (preferably snowflake-shaped); a metal offset spatula; a pastry bag fitted with 1/8- to 1/4-inch plain tip (optional)']",
    "Instructions": "Bring molasses, brown sugar, and spices to a boil in a 4- to 5-quart heavy saucepan over moderate heat, stirring occasionally, and remove from heat. Stir in baking soda (mixture will foam up), then stir in butter 3 pieces at a time, letting each addition melt before adding next, until all butter is melted. Add egg and stir until combined, then stir in 3 3/4 cups flour and salt.\nPreheat oven to 325°F.\nTransfer dough to a lightly floured surface and knead, dusting with as much of remaining 1/4 cup flour as needed to prevent sticking, until soft and easy to handle, 30 seconds to 1 minute. Halve dough, then wrap 1 half in plastic wrap and keep at room temperature.\nRoll out remaining dough into a 14-inch round (1/8 inch thick) on a lightly floured surface. Cut out as many cookies as possible with cutters and carefully transfer with offset spatula to 2 buttered large baking sheets, arranging them about 1 inch apart.\nBake cookies in upper and lower thirds of oven, switching position of sheets halfway through baking, until edges are slightly darker, 10 to 12 minutes total (watch carefully toward end of baking; cookies can burn easily). Transfer cookies to racks to cool completely. Make more cookies with remaining dough and scraps (reroll once).\nPut icing in pastry bag (if using) and pipe or spread decoratively onto cookies.",
    "Image_Name": "gingerbread-snowflakes-107445.jpg"
  },
  {
    "Title": "Upside-Down Pear Gingerbread Cake",
    "Ingredients": "['2 1/2 firm pears (preferably Bosc)', '1/2 stick (1/4 cup) unsalted butter', '3/4 cup packed light brown sugar', '2 1/2 cups all-purpose flour', '1 1/2 teaspoons baking soda', '1 teaspoon ground cinnamon', '1 teaspoon ground ginger', '1/2 teaspoon ground cloves', '1/4 teaspoon salt', '1 cup molasses (preferably mild)', '1 cup boiling water', '1 stick (1/2 cup) unsalted butter, softened', '1/2 cup packed light brown sugar', '1 large egg, lightly beaten', 'Accompaniment: vanilla ice cream', 'a well-seasoned 10-inch cast-iron skillet or a 12-inch deep nonstick skillet (handle wrapped with a double layer of foil if not ovenproof)']",
    "Instructions": "Peel and core pears and cut each into 8 wedges.\nMelt butter in skillet over moderate heat until foam subsides. Reduce heat to low, then sprinkle brown sugar over bottom of skillet and cook, undisturbed, 3 minutes (not all sugar will be melted). Arrange pears decoratively over sugar and cook, undisturbed, 2 minutes. Remove from heat.\nPreheat oven to 350°F.\nWhisk together flour, baking soda, cinnamon, ginger, cloves, and salt in a bowl. Whisk together molasses and boiling water in a small bowl. Beat together butter, brown sugar, and egg in a large bowl with an electric mixer at medium speed until creamy, about 2 minutes, then alternately mix in flour mixture and molasses in 3 batches at low speed until smooth.\nPour batter over topping in skillet, spreading evenly and being careful not to disturb pears, and bake in middle of oven until a tester comes out clean, 40 to 50 minutes.\nCool cake in skillet on a rack 5 minutes. Run a thin knife around edge of skillet, then invert a large plate with a lip over skillet and, using pot holders to hold skillet and plate tightly together, invert cake onto plate. Replace any pears that stick to skillet. Serve warm or at room temperature.",
    "Image_Name": "upside-down-pear-gingerbread-cake-106181.jpg"
  }
]