[
    {
        "Title": "휘핑 달콤한 옥수수를 곁들인 콘브레드 머핀",
        "Ingredients": "['코코넛 오일 3큰술 (기름칠용 추가)', '메조울 대추 6개', '끓는 물', '중간 크기로 갈은 노란 옥수수가루 ¾컵', '밀가루 ¾컵', '코코넛 팜 설탕 2큰술', '베이킹파우더 1큰술', '고운 바다소금 ½작은술', '갓 갈은 황금 아마씨 2큰술', '무가당 귀리 우유 1컵', '비건 버터 3큰술', '잘게 다진 흰 양파 ¼컵', '신선한 옥수수 알갱이 2컵(약 3개)', '코코넛 팜 설탕 2작은술', '코셔 소금 ¼작은술 (필요에 따라 추가)', '캐슈 크림 ½컵', '신선한 레몬즙', '갓 갈은 흰 후추', '할라페뇨 고추 젤리 (서빙용)']",
        "Instructions": "머핀 만들기: 오븐을 400°F로 예열합니다. 일반 머핀 틀의 9개 구멍에 코코넛 오일을 두껍게 바릅니다.\n작은 내열 그릇에 대추를 넣고 끓는 물을 채웁니다. 약 5분간 담가둡니다. 대추의 물을 빼고 담가둔 액체를 따로 보관한 다음 푸드 프로세서에 옮깁니다. 따로 보관한 담가둔 액체 1큰술을 넣고 측면을 긁어내고 필요한 경우 따로 보관한 담가둔 액체를 더 넣어 대부분 크림이 되지만 몇 개의 덩어리가 남을 때까지 가공합니다.\n준비한 머핀 틀을 오븐에 넣고 5분간 가열합니다. 그 사이에 큰 그릇에 콘밀, 밀가루, 설탕, 베이킹파우더, 소금을 체로 걸러 섞습니다. 잘 섞일 때까지 휘젓습니다.\n중간 크기의 그릇에 아마씨와 물 6큰술을 넣고 잘 섞일 때까지 휘젓습니다. 퓌레한 대추와 코코넛 오일을 부드러워질 때까지 휘젓습니다. 귀리 우유를 잘 섞일 때까지 휘젓습니다. 귀리 우유 혼합물을 옥수수가루 혼합물에 넣고 잘 섞일 때까지 저어줍니다.\n머핀 틀이 뜨거워지면 오븐에서 꺼내고 반죽을 준비된 머핀 컵에 바로 긁어 넣고, 컵에 고르게 분배합니다(컵은 3/4 정도 채워야 함).\n머핀이 황금빛 갈색이 될 때까지 16~18분간 굽습니다. 틀에 10분 정도 식힌 다음 와이어 랙으로 옮겨 조금 더 식힙니다.\n휘핑 달콤한 옥수수 만들기: 머핀이 식는 동안 큰 프라이팬에 중불로 버터를 녹입니다. 양파를 넣고 자주 저어주면서 부드러워질 때까지 3~5분간 볶습니다. 옥수수, 설탕, 소금을 넣고 자주 저어주면서 옥수수가 부드러워질 때까지 약 5분간 볶습니다.\n프라이팬의 내용물을 푸드 프로세서에 긁어 넣습니다. 캐슈 크림을 넣고 원하는 농도가 될 때까지 물을 필요에 따라 더하면서 매끄러워질 때까지 볶습니다. 레몬즙, 소금, 흰 후추로 맛을 보고 간을 합니다. 서빙 그릇에 옮깁니다. 휘핑된 달콤한 옥수수를 듬뿍 바르고 후추 젤리를 얹은 따뜻한 머핀을 서빙합니다.",
        "Image_Name": "cornbread-muffins-with-whipped-sweet-corn.jpg"
    },
    {
        "Title": "아보카도와 파 살사를 곁들인 플랫브레드",
        "Ingredients": "['설탕 1 ½ 티스푼', '활성 건조 효모 1(¼온스) 봉지(약 2¼티스푼)', '다용도 밀가루 2½컵(313g)', '전유 플레인 그릭 요거트 ½컵', '엑스트라 버진 올리브 오일 2큰술', '코셔 소금 2작은술', '고수 씨앗 2작은술', '쿠민 씨앗 2작은술', '대파 8개', '엑스트라 버진 올리브 오일 4큰술 더하기 1컵, 나누어서 더하기 솔질용 더하기', '코셔 소금', '빨간색 또는 녹색 고추 1개(세라노 또는 할라페뇨 등), 잘게 다진 것', '잘게 다진 파슬리 1컵', '레몬 1개', '중간 크기 아보카도 4개, 씨 제거', '조각 ​​바다 소금(선택 사항)', '특수 장비: 향신료 분쇄기']",
        "Instructions": "큰 그릇에 따뜻한 물 ¾컵에 설탕을 넣고 저어줍니다. 효모를 뿌리고 거품이 생길 때까지 약 10분간 방치합니다.\n설탕 혼합물에 밀가루, 요거트, 오일, 코셔 소금을 넣고 털털한 반죽이 될 때까지 섞습니다(건조하거나 섞이지 않은 부분은 걱정하지 마세요). 그릇을 축축한 주방 타월로 덮고 따뜻하고 건조한 곳에 두어 크기가 두 배가 될 때까지 약 1시간 방치합니다.\n반죽이 부풀어 오르는 동안 고수 씨앗과 커민 씨앗을 건조한 중간 크기의 프라이팬에 넣고 중불로 자주 흔들어 향이 나고 색상이 약간 어두워질 때까지 약 3분간 볶습니다. 향신료 분쇄기에 옮깁니다. 식힌 다음 거칠게 갈아줍니다. 향신료 혼합물은 따로 보관합니다.\n프라이팬에 파와 오일 1큰술을 넣고 코셔 소금으로 간을 한 다음 가끔 뒤집어서 부드럽고 깊이 탄 때까지 약 4분간 조리합니다. 도마로 옮깁니다. 뿌리를 다듬고 버립니다. 파를 잘게 다져서 중간 크기의 그릇에 넣습니다. 남겨둔 향신료 혼합물, 칠리, 파슬리를 넣습니다. 레몬 제스트의 절반을 그릇에 잘게 갈은 다음 레몬을 반으로 자르고 주스를 짜 넣습니다. 기름 1컵을 넣고 잘 저어 섞습니다. 코셔 소금으로 간을 하고 플랫브레드를 만드는 동안 그대로 둡니다.\n반죽을 가볍게 뿌린 표면에 펴서 8등분합니다. 공 모양으로 만들고 한 번에 한 공씩 작업하여 두께가 약 ¼인 6인치 원형으로 펼칩니다.\n대형 프라이팬에 기름 1큰술을 중불로 가열합니다. 한 번에 하나씩 작업하고 필요에 따라 남은 기름 2큰술을 더하면서 플랫브레드가 표면에 거품이 나타날 때까지 약 1분간 굽습니다. 뒤집어서 완전히 익을 때까지 약 1분간 굽습니다. 계속 굽고 자주 뒤집어서 양쪽에 반점이 갈색이 될 때까지 약 1분 더 굽습니다. 접시에 옮겨 깨끗한 주방 타월로 감싸 따뜻하게 유지합니다.\n서빙할 때 각 플랫브레드에 기름을 바릅니다. 아보카도를 플랫브레드에 굵게 으깨고 살사를 얹습니다. 원하시면 바닷소금을 뿌려주세요.",
        "Image_Name": "flatbread-with-avocado-and-scallion-salsa.jpg"
    },
    {
        "Title": "염소 버터 쇼트브레드",
        "Ingredients": "['1컵(8온스) 차가운 염소 버터, 입방체', '½컵 과립 설탕', '¼컵 볶은 밀 배아', '1 ¾컵 미표백 다용도 밀가루', ¼컵 통밀가루', '½티스푼 코셔 소금', '½티스푼 바다소금 플레이크']",
        "Instructions": "스탠드 믹서의 그릇에 버터와 설탕을 넣고 버터가 굳을 때까지 약 30분간 냉장 보관합니다.\n그 사이에 오븐을 350°F로 예열하고 밀 배아를 반 시트(13 x 18인치) 팬에 펴 바릅니다. 약간 향이 날 때까지 약 3분간 토스트합니다. 실온으로 식힙니다.\n그릇에 밀가루, 소금, 토스트한 밀 배아를 넣고 휘젓습니다. 그릇을 냉장고에서 꺼냅니다. 믹서에 패들 부착물을 장착합니다. 밀가루 혼합물을 버터와 설탕에 넣고 반죽이 거친 밀가루처럼 될 때까지 저속으로 섞습니다(6~8분). 속도를 중간으로 높이고 반죽이 패들 주위나 그릇 측면에 뭉치기 시작할 때까지 섞습니다(2~3분 더). 스탠드 믹서에서 그릇을 꺼냅니다. 플라스틱 벤치 스크레이퍼로 반죽을 손으로 완전히 모읍니다.\n밀가루를 살짝 뿌린 표면에 반죽을 놓습니다. 반죽을 앞뒤로 굴려 원통형으로 만듭니다. 손가락을 사용하여 반죽을 두드려 직사각형 모양으로 만듭니다. 작업대에 반 시트 팬과 같은 크기의 양피지를 놓고 가볍게 밀가루를 뿌립니다. 반죽을 그 위에 놓습니다.\n롤링 핀을 사용하여 반죽을 펴기 시작합니다. 반죽에 균열이 생기면 멈추어 서로 붙입니다. 반죽이 양피지에 달라붙지 않게 하려면 가볍게 밀가루를 뿌리고 다른 양피지로 덮은 다음 반죽을 두 장의 양피지 사이에 끼운 다음 반죽과 양피지를 뒤집습니다. 양피지의 윗부분을 벗기고 계속 펴세요. 반죽을 약 ¼인치 두께의 10 x 12 또는 14인치 직사각형으로 펴세요. 표면이 고르지 않으면 페이스트리 롤러를 표면에 굴려 고르게 펴세요.\n반죽과 양피지를 반 시트 팬에 펴세요. 다른 양피지로 덮고 단단해질 때까지 냉장 보관하세요. 최소 20분 이상 보관하세요. 오븐을 350°F로 예열합니다. 두 개의 반 시트 팬에 양피지를 깔아주세요.\n반죽을 최대 10분 동안 실온에 두십시오. 반죽을 작업대에 뒤집어 놓고 양피지 윗면을 벗기십시오. 반죽 위에 도커를 굴리거나 포크로 여러 번 찔러 넣으십시오.\n1 ¾ x 2 ½인치(또는 비슷한 크기) 쿠키 커터를 사용하여 쇼트브레드를 잘라냅니다. 반죽 조각을 다시 굴리고 식힌 다음 쿠키를 더 잘라냅니다. 비슷한 쿠키 커터가 없으면 칼로 직사각형을 잘라낼 수 있습니다.\n준비된 팬에 쇼트브레드 12~16개를 고르게 놓습니다. 팬을 오븐에 넣고 온도를 325°F로 낮추고 10분 동안 굽습니다. 팬을 돌려 쿠키가 딱딱하고 가장자리가 약간 갈색이 될 때까지 6~8분 더 굽습니다. 쿠키를 시트 팬 위에서 완전히 식히십시오. 나머지 반죽에도 반복하십시오.\n쿠키는 밀폐 용기에 담아 실온에서 최대 1주일 동안 보관할 수 있습니다. 반죽은 최대 1주일 동안 냉장 보관이 가능합니다.",
        "Image_Name": "goat-butter-shortbread.jpg"
    },
    {
        "Title": "수맥과 바닐라 쇼트브레드",
        "Ingredients": "['240g(8½온스) 버터, 실온', '120g(4½온스/1컵) 제과용 설탕', '360g(12¾온스/2¾컵) 다용도 밀가루', '바닐라 꼬투리 1개(씨앗을 긁어낸 것)', '½티스푼 조각 바다소금', '2큰술 수막', '2큰술 과립 설탕']",
        "Instructions": "푸드 프로세서나 패들 부착물이 달린 전기 믹서기를 사용하여 버터, 설탕가루, 밀가루, 바닐라 씨앗, 소금을 반죽이 반죽 덩어리가 될 때까지 섞습니다. 반죽이 뭉쳐지려면 시간이 걸리므로 믿음을 잃지 마세요. 반죽이 뭉쳐지면 반죽을 작업대에 꺼냅니다. 두 조각으로 나누고 각각을 통나무 모양으로 만듭니다. 저는 직사각형 모양으로 만드는 것을 선호하지만 어떤 모양이든 맛있습니다.\n작업대에서 수맥과 설탕을 섞습니다. 통나무를 수맥-설탕에 굴려 전체를 코팅한 다음 냉장고에 넣어 최소 1시간 동안 굳힙니다(또는 구울 때까지 냉동합니다).\n오븐을 190°C/170°C 팬/375°F/가스 마크 5로 예열합니다. 베이킹 트레이 두 개에 베이킹 페이퍼를 깔아줍니다. 날카로운 칼로 각 통나무를 12~14조각으로 자르고 트레이에 평평하게 놓습니다.\n10~12분 동안 가볍게 황금색이 될 때까지 구운 다음 오븐에서 꺼냅니다. 먹기 전에 트레이에 식힙니다.",
        "Image_Name": "sumac-and-vanilla-shortbread.jpg"
    },
    {
        "Title": "베이컨 지방과 갈색 설탕을 곁들인 스킬렛 콘브레드",
        "Ingredients": "['고운 흰 돌로 갈은 옥수수가루 2½컵', '베이킹파우더 1큰술', '소금 1½작은술', '큰 계란 3개', '버터밀크 1¾컵', '갈색 설탕 2큰술', '베이컨 지방 또는 라드 3큰술']",
        "Instructions": "오븐을 425°F로 예열합니다.\n큰 그릇에 콘밀, 베이킹파우더, 소금을 넣고 휘젓습니다. 다른 그릇에 계란, 버터밀크, 황설탕을 넣고 부드러워질 때까지 휘젓습니다.\n젖은 재료를 마른 재료에 넣고 휘젓습니다.\n베이컨 지방을 12인치 주철 프라이팬에 넣고 액체가 될 때까지 가열합니다. 프라이팬 바닥과 측면을 코팅하기 위해 돌린 다음 나머지를 반죽에 붓습니다.\n반죽을 부드러워질 때까지 휘젓고 뜨거운 프라이팬에 붓습니다. 즉시 오븐에 넣습니다.\n황금빛 갈색이 되고 중앙에 꽂은 이쑤시개가 깨끗하게 나올 때까지 굽습니다(약 25분). 따뜻하게 제공합니다.",
        "Image_Name": "skillet-cornbread-with-bacon-fat-and-brown-sugar.jpg"
    },
    {
        "Title": "얼룩말 줄무늬 쇼트브레드 쿠키",
        "Ingredients": "['다용도 밀가루 2 1/3컵, 나누어 사용', '코셔 소금 1 1/2작은술, 나누어 사용', '더치 프로세스 코코아 가루 1/3컵', '무염 버터 1 1/4컵(2 1/2스틱), 실온', '과립 설탕 2/3컵', '가루 설탕 1/4컵', '큰 달걀 노른자 1개', '바닐라 추출물 또는 페이스트 1작은술', '큰 달걀 1개, 섞어서 사용', '샌딩 설탕 1/4컵(색상 무관)']",
        "Instructions": "중간 크기의 그릇에 밀가루 1 1/3컵과 소금 3/4작은술을 넣고 휘젓습니다. 다른 중간 크기의 그릇에 코코아 가루, 남은 밀가루 1컵, 남은 소금 3/4작은술을 넣고 휘젓습니다. 이것들이 초콜릿과 바닐라 반죽의 기본입니다.\n스탠드 믹서의 그릇에 버터, 과립 설탕, 가루 설탕을 넣고 중속~고속으로 약 4분간 가볍고 부드러워질 때까지 휘젓습니다. 계란과 바닐라를 넣고 부드러워질 때까지 휘젓습니다. 혼합물을 두 그릇의 건조 재료에 나누어 넣습니다(각각 약 1컵). 바닐라 혼합물을 스탠드 믹서 그릇에 다시 긁어 넣고(믹싱 그릇은 보관) 저속으로 섞일 때까지 휘젓습니다. 다시 그릇에 넣습니다. 초콜릿 혼합물로 과정을 반복합니다.\n작업대에 큰 양피지 두 장을 놓습니다. 각 시트 중앙에 초콜릿 반죽 1/4을 얹고 6x2인치 크기의 직사각형 모양으로 두드려줍니다. 각 초콜릿 슬라브 위에 바닐라 반죽 1/4을 얹고 크기와 모양이 같은 직사각형 모양으로 두드려서 각각 2개의 층을 만듭니다. 전체 과정을 반복해서 번갈아 가며 4개의 층을 만듭니다. 양피지를 사용하여 쌓은 반죽을 약 1 1/2인치 너비, 8인치 길이의 원통형으로 단단히 눌러줍니다. 통나무를 비닐 랩으로 감싸고 아주 단단해질 때까지 냉장합니다(최소 2시간).\n오븐의 위아래 1/3에 랙을 놓습니다. 350°F로 예열합니다. 한 번에 하나씩 반죽을 풀고 계란을 바릅니다. 표면에 사포 설탕을 조심스럽게 뿌리고 통나무를 설탕에 굴려 잘 코팅합니다(반죽을 설탕에 꼭 눌러서 달라붙게 합니다). 두께가 1/4인치인 원형으로 자르고, 몇 번 자른 후 돌려서 조각이 둥글게 유지되도록 합니다. 쿠키를 양피지를 깐 베이킹 시트에 2인치 간격으로 놓습니다. 베이킹 시트를 위에서 아래로, 앞에서 뒤로 반쯤 돌린 후 가장자리가 굳을 때까지 굽습니다(12~14분). 베이킹 시트에서 식힙니다.\n반죽은 3일 전에 만들어 냉장 보관합니다. 쿠키는 5일 전에 구워서 실온에서 밀폐 보관합니다.",
        "Image_Name": "zebra-striped-shortbread-cookies.jpg"
    },
    {
        "Title": "초콜릿 쇼트브레드 슬라이스",
        "Ingredients": "['1/3컵(80ml) 싱글(붓기/라이트) 크림', '400g 다크 초콜릿, 다진 것', '100g 무염 버터, 다진 것', '175g 시중에서 판매하는 플레인 쇼트브레드 비스킷/쿠키', '코코아 파우더, 뿌리기용']",
        "Instructions": "8cm x 20cm 로프 틴에 노스틱 베이킹 페이퍼를 깔아줍니다. 크림, 초콜릿, 버터를 중간 크기의 냄비에 넣고 약한 불로 녹고 매끄러워질 때까지 저어줍니다. 초콜릿 혼합물의 1/3을 틴에 붓습니다. 틴에 쇼트브레드의 절반을 넣습니다. 남은 초콜릿 혼합물의 절반을 쇼트브레드 위에 붓습니다. 남은 쇼트브레드와 초콜릿으로 반복하고 위를 매끄럽게 합니다. 3~4시간 동안 또는 굳을 때까지 냉장합니다. 틴에서 슬라이스를 꺼내 코코아를 뿌립니다. 서빙할 때는 뜨거운 칼을 사용하여 슬라이스합니다.",
        "Image_Name": "chocolate-shortbread-slice-bars.jpg"
    },
    {
        "Title": "버터밀크 콘브레드",
        "Ingredients": "['논스틱 식물성 기름 스프레이', '다용도 밀가루 2컵', '중간 크기의 옥수수가루 2컵', '설탕 1/4컵', '베이킹파우더 1큰술', '코셔 소금 2 1/2작은술', '갓 갈은 검은 후추 3/4작은술', '큰 달걀 4개', '버터밀크 2컵', '무염 버터 1/2컵(1스틱), 녹인 후 살짝 식힌 것']",
        "Instructions": "오븐을 400°F로 예열합니다. 13x9인치 베이킹 접시에 노스틱 스프레이를 가볍게 바릅니다. 큰 그릇에 밀가루, 콘밀, 설탕, 베이킹파우더, 소금, 후추를 넣고 휘젓습니다. 중간 크기의 그릇에 계란, 버터밀크, 버터를 넣고 휘젓습니다. 마른 재료에 구멍을 뚫고 계란 혼합물을 붓습니다. 마른 재료와 나무 숟가락으로 섞일 때까지 저어줍니다. 반죽을 준비된 팬에 긁어 넣고 윗면을 매끈하게 다듬습니다.\n콘브레드를 굽습니다. 중간에 접시를 돌려 가운데에 꽂은 테스터가 깨끗하게 나올 때까지 20~25분간 굽습니다. 접시에 콘브레드를 살짝 식힌 다음 가로로 4개의 큰 조각으로 자릅니다. 큰 주걱으로 와이어 랙으로 옮겨 완전히 식힙니다.\n콘브레드는 2일 전에 구울 수 있습니다. 단단히 싸서 실온에서 보관합니다.",
        "Image_Name": "buttermilk-cornbread.jpg"
    },
    {
        "Title": "플랫브레드 카프레제",
        "Ingredients": "['다용도 밀가루 2컵(반죽용도 추가)', '활성 건조 효모 1/2티스푼', '바다소금 1티스푼(필요에 따라 추가)', '설탕 1/4티스푼', '따뜻한 물 1컵(화씨 105도~110도)', '엑스트라 버진 올리브 오일', '신선한 모짜렐라 치즈 4온스(1/2인치 크기로 자름)', '포도토마토 1/2파인트(1/4인치 두께로 썰어 둠)', '신선한 바질 잎 한줌']",
        "Instructions": "큰 그릇에 밀가루, 효모, 소금, 설탕을 넣고 휘저어 섞습니다. 물을 넣고 거친 반죽이 될 때까지 저어줍니다.\n조리대나 도마에 밀가루를 약간 뿌립니다. 반죽을 도마 위에 꺼내고 그 위에 밀가루를 조금 더 뿌립니다. 반죽이 부드러운 공이 될 때까지 반죽합니다(3~4분). 필요에 따라 밀가루를 더 넣습니다. 반죽을 깨끗한 주방 수건으로 덮고 조리대에 10분 동안 둡니다.\n오븐을 425°F로 예열합니다. 베이킹 시트에 쿠킹 스프레이를 뿌립니다.\n반죽을 9x17인치 직사각형으로 펴서 준비된 팬에 옮깁니다. 올리브 오일을 약간 뿌리고 황금색이 되고 바삭해질 때까지 18~20분 동안 굽습니다.\n그 사이에 중간 크기의 그릇에 모짜렐라 치즈와 토마토를 넣습니다. 바질을 리본 모양으로 썰어 그릇에 넣고 기름을 약간 뿌립니다. 소금으로 간을 합니다.\n플랫브레드를 도마로 옮깁니다. 모짜렐라 혼합물을 위에 뿌립니다. 플랫브레드를 세로로 자른 다음 삼각형으로 자릅니다. 즉시 제공합니다.",
        "Image_Name": "flatbread-caprese-tomato-mozzarella-basil.jpg"
    },
    {
        "Title": "클래식 스킬렛 콘브레드",
        "Ingredients": "['굵게 갈은 옥수수가루 2 1/2컵', '베이킹소다 1 1/4티스푼', '코셔소금 1 1/4티스푼', '큰 달걀 1개', '버터밀크 1 2/3컵', '베이컨 지방, 라드 또는 무염 버터 2큰술', '핫 허니 버터(서빙용)', '직경 10인치 주철 프라이팬']",
        "Instructions": "오븐을 375°F로 예열합니다. 반죽을 만드는 동안 마른 프라이팬을 약한 불로 가열합니다. 중간 크기의 그릇에 콘밀, 베이킹 소다, 소금을 넣고 휘젓습니다. 가운데에 구멍을 뚫고 계란과 버터밀크를 넣은 다음 가운데부터 계란을 섞기 시작해서 빼면서 힘차게 휘저어 마른 재료가 섞이고 반죽이 매끄러워질 때까지 휘저으세요.\n불을 중불로 높이고 프라이팬에 베이컨 지방을 넣습니다. 프라이팬 바닥과 측면을 코팅하기 위해 돌립니다. 반죽을 한 번 더 휘저어 다시 섞은 다음 프라이팬에 붓고 위를 매끄럽게 합니다(반죽이 가장자리에 튀길 것입니다).\n콘브레드를 오븐에서 가장자리가 황금빛 갈색이 되고 위가 황금빛이 되고 곳곳에 갈라지고 만지면 딱딱해질 때까지 25~30분간 굽습니다. 웨지 모양으로 자르기 전에 팬에서 최소 5분 동안 식힙니다. 핫 허니 버터와 함께 제공합니다.\n콘브레드는 8시간 전에 구울 수 있습니다. 식힌 다음 단단히 싸서 실온에서 보관합니다.",
        "Image_Name": "classic-skillet-cornbread.jpg"
    },
    {
        "Title": "진저브레드 브라우니",
        "Ingredients": "['논스틱 식물성 기름 스프레이', '설탕 2 1/4컵', '무가당 코코아 가루 1 1/2컵', '코셔 소금 1티스푼', '무염 버터 1컵(2스틱)', '큰 달걀 4개', '당밀 3큰술(강력/블랙스트랩 불가)', '바닐라 추출물 2티스푼', '다용도 밀가루 1컵', '계피 가루 2티스푼', '생강 가루 2티스푼', '베이킹파우더 1티스푼', '정향 가루 1/2티스푼']",
        "Instructions": "오븐 중앙에 랙을 놓고 350°F로 예열합니다. 9x9인치 베이킹 팬에 노스틱 스프레이를 뿌립니다. 팬에 양피지를 두 겹 깔고 모든 면에 2인치 정도를 남겨둡니다. 양피지에 노스틱 스프레이를 뿌립니다.\n큰 그릇에 설탕, 코코아 가루, 소금을 넣고 휘젓습니다. 중간 크기의 내열 그릇에 버터를 넣고 전자레인지에서 녹이거나 중간 크기의 냄비에 넣고 중불로 녹입니다. 뜨거운 버터를 설탕 혼합물에 바로 넣고 나무 숟가락이나 고무 주걱으로 부드러워질 때까지 저어줍니다. 계란을 하나씩 넣고 매번 넣을 때마다 숟가락이나 주걱으로 힘차게 저어주면서 반죽이 걸쭉하고 윤이 나고 부드러워질 때까지 저어줍니다. 당밀과 바닐라를 넣고 저어줍니다. 체나 고운 체로 밀가루, 계피, 생강, 베이킹 파우더, 정향을 체로 걸러줍니다. 잘 섞일 때까지 저은 다음 40번 힘차게 치세요.\n반죽을 준비된 팬에 옮기고 윗면을 매끈하게 합니다. 브라우니를 살짝 부풀어 오르고 윗부분이 만져도 딱딱하고, 가장자리가 고정되고, 중앙이 촉촉하지만 익지 않은 상태이며, 중앙에 테스터나 파링 나이프를 꽂으면 촉촉한 부스러기(흐르는 반죽 아님)가 붙어 나올 때까지 40~45분간 굽습니다.\n와이어 랙으로 옮기고 브라우니를 팬에서 완전히 식힙니다. 양피지 돌출부를 사용하여 브라우니를 팬에서 들어 올려 도마로 옮깁니다. 16개의 사각형으로 자릅니다.",
        "Image_Name": "gingerbread-brownies.jpg"
    },
    {
        "Title": "럼 버터 글레이즈를 곁들인 부드러운 진저브레드 타일",
        "Ingredients": "['무염 버터 6큰술(85g), 실온', '1/3컵 더하기 2큰술(90g) 흑설탕', '1/4컵(100g) 블랙스트랩 당밀', '큰 달걀 노른자 1개', '1 3/4컵 더하기 2큰술(235g) 다용도 밀가루, 더하기 압착용 추가', '더치 가공 코코아 가루 1큰술', '베이킹 소다 1/2작은술', '생강가루 1작은술', '계피가루 1/2작은술', '정향가루 1/8작은술', '소금 1/4작은술', '갓 갈은 검은 후추 1/4작은술', '제과용 설탕 2/3컵(80g)', '계피가루 1/8작은술', '무염 버터 1큰술(15g) 녹여서 따뜻하게', '다크럼 1큰술(또는 레몬즙)', '따뜻한 물 1작은술']",
        "Instructions": "버터, 설탕, 당밀을 전기 믹서의 그릇에 넣고 패들 부착물을 설치합니다. 부드럽고 섞일 때까지 중간 속도로 치십시오. 달걀 노른자를 넣고 완전히 섞일 때까지 계속 치십시오.\n밀가루, 코코아 가루, 베이킹 소다, 생강, 계피, 정향, 소금, 후추를 체로 걸러 그릇에 넣습니다. 믹서의 속도를 낮추고 마른 재료를 버터와 당밀에 넣습니다. 혼합물이 합쳐지면 가볍게 밀가루를 뿌린 작업대에 반죽을 올리고 부드럽게 반죽합니다. 반죽을 약 1/4인치/0.5cm 두께로 펴십시오. 반죽이 매우 부드럽다면 식혀야 합니다.\n오븐을 375°F/190°C로 예열합니다. 베이킹 시트 두 개에 양피지를 깔고 따로 보관합니다.\n쿠키 스탬프를 작은 밀가루 그릇에 담그고 여분의 밀가루를 털어낸 다음 한 번에 하나씩 반죽에 단단히 눌러 깊은 자국을 만듭니다. 각인을 찍기 위해 얼마나 눌러야 하는지는 각인에 따라 달라집니다. 일부 각인은 다른 각인보다 더 깊게 깎여 있습니다. 쿠키는 구울 때 약간 부풀어 오르므로 부드러운 각인은 사라집니다. 패턴보다 약간 큰 둥근 쿠키 커터를 사용하여 각인된 진저브레드 조각을 잘라냅니다. 쿠키를 3/4인치/2cm 간격으로 깔아 놓은 베이킹 시트에 옮깁니다. 반죽을 다시 말아서 반죽이 모두 소모될 때까지 계속 각인하고 쿠키를 자릅니다.\n9~10분 동안 굽고, 중간에 시트를 돌려서 만지면 딱딱해질 때까지 굽습니다. 식으면서 계속 딱딱해지므로 더 이상 굽지 마세요.\n진저브레드가 오븐에 있는 동안 럼 버터 글레이즈를 만들려면, 글레이즈를 쿠키가 아직 따뜻할 때 발라야 하므로, 제과용 설탕과 계피를 작은 그릇에 체로 걸러 넣습니다. 녹인 버터, 럼(또는 레몬 주스)과 물을 넣고 숟가락으로 부드러워질 때까지 섞습니다. 유약은 그대로 두면 약간 걸쭉해지므로 필요한 경우 따뜻한 물을 조금 더 넣어 저어줍니다. 묽은 꿀 정도의 농도여야 합니다.\n쿠키를 오븐에서 꺼내 5분간 식힌 다음, 페이스트리 브러시로 유약을 솔질하거나 두드립니다. 와이어 랙으로 옮겨 완전히 식힙니다.\n반죽이 완성되면 비닐 랩으로 덮고 최대 2일 동안 냉장고에 보관한 다음 굽습니다.\n밀폐 용기에 담아 5일 동안 보관할 수 있습니다. 유약이 변색되고 약간 갈라지지만 맛에는 영향을 미치지 않습니다.",
        "Image_Name": "soft-gingerbread-tiles-with-rum-butter-glaze.jpg"
    },
    {
        "Title": "소시지와 콘브레드를 곁들인 우리가 가장 좋아하는 추수감사절 스터핑",
        "Ingredients": "['무염 버터 1/2컵(1스틱), 팬용 버터 추가', '양질의 하루 묵은 바삭한 컨트리 스타일 또는 농민 빵 1/2파운드, 3/4인치 조각(약 5컵)', '하루 묵은 콘브레드 1/2파운드, 3/4인치 조각(약 5컵)', '아침 식사용 소시지 링크 1파운드, 케이싱 제거 또는 아침 식사용 소시지 믹스 가루, 1/2인치 조각으로 부순 것', '다진 양파 2 1/2컵(중간 크기 1개, 큰 크기 1개)', '중간 크기 셀러리 줄기 3개, 슬라이스', '큰 계란 2개', '저염 닭고기 육수 2 1/2컵', '다진 파슬리 1/2컵', '다진 세이지 2큰술', '다진 타임 1큰술', '다진 로즈마리 2작은술', '코셔 소금 2작은술', '갓 딴 검은 후추 가루', '13x9x2인치 또는 기타 3쿼트 베이킹 접시']",
        "Instructions": "오븐을 300°F로 예열합니다. 베이킹 접시에 버터를 바르고 따로 보관합니다. 테두리가 있는 베이킹 시트에 빵과 콘브레드를 한 겹으로 놓습니다. 가끔씩 뒤집어가며 완전히 말랐을 때까지 35~50분간 굽습니다. 베이킹 시트에서 식힌 다음 매우 큰 그릇에 옮깁니다.\n그동안 중불로 큰 프라이팬을 가열합니다. 소시지를 1/2인치 크기로 쪼개고 나무 숟가락이나 주걱으로 더 작은(약 1/4인치) 조각으로 저어가며 갈색이 될 때까지 8~10분간 익힙니다. 빵이 있는 그릇에 옮기지만 저어주지는 않습니다.\n남은 버터 1스틱을 같은 프라이팬에 중불로 가열합니다. 양파와 셀러리를 자주 저어주고 팬 바닥에서 갈색 조각을 긁어내면서 갈색이 되기 시작할 때까지 약 10분간 익힙니다. 빵 혼합물이 있는 그릇에 넣고 식힙니다.\n중간 크기의 그릇에 계란, 국물, 파슬리, 세이지, 타임, 로즈마리, 소금, 후추를 넣고 휘젓습니다. 빵 혼합물에 넣고 완전히 섞일 때까지 부드럽게 접습니다.\n오븐 온도를 350°F로 높입니다. 혼합물을 준비된 접시에 옮기고 호일로 덮은 다음, 인스턴트 온도계를 중앙에 꽂아 160°F를 기록할 때까지 스터핑을 굽습니다. 40~45분. 덮개를 열고 굳고 윗부분이 갈색으로 변하고 바삭해질 때까지 45~50분 더 굽습니다.\n스터핑은 조립할 수 있지만 구울 수는 없으며, 1일 전에 미리 굽습니다. 덮고 식힙니다. 구울 준비가 되면 실온으로 올려 레시피에 따라 굽습니다. 스터핑은 1일 전에 미리 굽습니다. 완전히 식힌 다음 호일로 덮고 식힙니다. 덮은 상태로 350°F 오븐에서 25~30분 동안 완전히 데워질 때까지 굽습니다. 덮개를 열고 윗부분이 바삭해질 때까지 7~10분 더 굽습니다.",
        "Image_Name": "our-favorite-thanksgiving-stuffing-with-sausage-and-cornbread.jpg"
    },
    {
        "Title": "레몬 프로스팅이 곁들여진 진저브레드 컵케이크",
        "Ingredients": "['다용도 밀가루 1 1/4컵', '베이킹파우더 1티스푼', '베이킹소다 1/2티스푼', '생강가루 3티스푼', '계피가루 1티스푼', '정향가루 1/4티스푼', '소금 1/4티스푼', '식물성 기름 1/2컵', '연한 당밀 1/3컵', '메이플 시럽 1/2컵', '두유 1/4컵', '두유 요거트 2큰술', '레몬 제스트 잘게 갈은 것 1 1/2티스푼', '정향 가루 잘게 다진 것 1/4컵', '수소화되지 않은 마가린, 부드럽게 한 것 1/4컵', '비건 크림치즈, 부드럽게 한 것 1/4컵', '제과용 설탕 2컵', '바닐라 추출물 1티스푼', '레몬 제스트 잘게 갈은 것 1큰술']",
        "Instructions": "오븐을 350°F로 예열합니다. 머핀 팬에 종이 컵케이크 라이너를 깔아줍니다.\n밀가루, 베이킹파우더, 베이킹소다, 생강, 계피, 정향, 소금을 체로 걸러 그릇에 넣고 섞습니다.\n기름, 당밀, 메이플 시럽, 두유, 요거트, 레몬 제스트를 별도의 큰 그릇에 넣고 휘핑합니다. 밀가루 혼합물을 젖은 재료에 넣고 부드러워질 때까지 섞습니다. 다진 결정화된 생강을 넣습니다.\n컵케이크 라이너를 2/3까지 채웁니다. 중앙에 칼이나 이쑤시개를 꽂아 깨끗하게 나올 때까지 19~22분 동안 굽습니다. 식는 랙으로 옮겨 완전히 식힌 다음 프로스팅합니다.\n마가린과 크림치즈를 잘 섞일 때까지 크림을 섞습니다. 핸드헬드 믹서를 사용하여 제과용 설탕을 1/2컵씩 넣으면서 휘핑합니다. 부드럽고 크리미해질 때까지 섞은 다음 바닐라를 넣습니다. 레몬 제스트를 넣습니다. 사용할 때까지 뚜껑을 꼭 닫고 냉장 보관합니다.",
        "Image_Name": "gingerbread-cupcakes-with-lemony-frosting.jpg"
    },
    {
        "Title": "베이비의 딸기 쇼트브레드 발렌타인 쿠키",
        "Ingredients": "['다용도 밀가루 6컵', '베이킹파우더 1티스푼', '무염 버터 2컵', '제과용 설탕 2컵', '큰 달걀 노른자 2개', '오렌지 주스 1/2컵', '순수 바닐라 추출물 1티스푼', '딸기 보존식품 6컵']",
        "Instructions": "오븐을 350°F로 예열합니다. 밀가루와 베이킹파우더를 체로 걸러 따로 보관합니다.\n스탠드 믹서의 그릇이나 핸드헬드 전기 믹서가 있는 그릇에 버터와 설탕을 가볍고 부드러워질 때까지 약 3~5분간 크림 형태로 섞습니다.\n달걀 노른자, 오렌지 주스, 바닐라 추출물을 넣고 천천히 섞습니다.\n밀가루 혼합물을 버터 혼합물에 넣고 반죽이 형성될 때까지 천천히 섞습니다.\n믹서에서 반죽을 꺼내 손으로 반죽하여 늘어질 때까지 반죽합니다. 반죽을 양피지 두 장 사이에 놓고 밀대를 사용하여 평평하게 펴줍니다.\n양피지 윗장을 제거하고 반죽을 반으로 자릅니다. 반죽의 반쪽에 쿠키의 \"단단한\" 아랫부분을 펀칭합니다. 반죽의 다른 반쪽에 쿠키의 \"하트 윈도우\" 윗부분을 펀칭합니다.\n양피지를 깐 쿠키 시트에 쿠키를 배열하고 8~10분 동안 굽습니다. 갈색이 되기 전에 꺼내 완전히 식힙니다.\n쿠키의 단단한 아랫부분에 딸기 보존 식품을 조심스럽게 펴 바르고, 각 쿠키의 하트 윈도우 부분을 위에 올려놓습니다. 서빙하고 즐기세요!",
        "Image_Name": "strawberry-shortbread-valentines-cookies.jpg"
    },
    {
        "Title": "시금치-아티초크 플랫브레드 피자",
        "Ingredients": "['발사믹 식초 1컵', '플랫아웃 라이트 이탈리안 허브 플랫브레드 6개', '프레고 라이트 홈스타일 알프레도 소스 3/4컵', '작은 시금치 6컵', '체리토마토 3컵(반으로 자름)', '4등분한 아티초크 하트 1캔(15온스) 물기를 빼고 다진 것', '저지방 모짜렐라 치즈 3/4컵(저는 사르젠토를 좋아합니다)']",
        "Instructions": "오븐을 350˚F로 예열합니다. 베이킹 시트 2개에 호일을 깔아줍니다.\n작은 냄비에 발사믹 식초를 중불로 끓입니다. 불을 중불로 줄이고 발사믹 식초가 걸쭉해지고 반으로 줄어들 때까지 20~25분간 끓입니다.\n그동안 준비한 베이킹 시트에 플랫브레드를 펴놓고 쿠킹 스프레이를 뿌립니다. 5~6분간 굽습니다. 오븐에서 꺼내지만 오븐은 그대로 둡니다.\n각 플랫브레드에 알프레도 소스 2큰술을 고르게 바릅니다. 각각에 시금치 1컵, 포도 토마토 1/2컵, 아티초크 1/4컵, 모짜렐라 치즈 2큰술을 얹습니다.\n오븐에 다시 넣고 치즈가 녹을 때까지 7~9분간 굽습니다. 오븐에서 꺼내 발사믹 리덕션을 각 피자에 고르게 뿌립니다.",
        "Image_Name": "spinach-artichoke-flatbread-pizzas.jpg"
    },
    {
        "Title": "포도와 로즈마리 플랫브레드",
        "Ingredients": "['1 (16온스) 수제 또는 매장에서 구입한 피자 도우', '트러플 오일 1큰술', '신선한 로즈마리 2작은술, 다진 것', '붉은 포도 2/3컵, 반으로 자른 것', '마무리 소금 1/2작은술', '부순 페타 치즈 2큰술']",
        "Instructions": "오븐을 500˚F로 예열합니다. 베이킹 시트에 양피지를 깔고 가볍게 밀가루를 뿌립니다.\n피자 반죽을 사용하기 30분 전에 냉장고에서 꺼냅니다. 날카로운 칼로 반죽을 반으로 자릅니다. 반죽을 양피지 위에 두 개의 긴 직사각형(각각 약 6x11인치)으로 늘립니다. 트러플 오일을 바릅니다. 로즈마리, 포도, 소금, 페타 치즈를 뿌립니다. 8~10분 동안 굽습니다. 오븐에서 꺼내 조각으로 자릅니다.",
        "Image_Name": "grape-and-rosemary-flatbread.jpg"
    },
    {
        "Title": "파를 넣은 스킬렛 콘브레드",
        "Ingredients": "['굵게 갈은 옥수수가루 2컵', '설탕 2큰술(선택사항)', '소금 1작은술', '베이킹파우더 1/2작은술', '베이킹소다 1/2작은술', '큰 달걀 1개', '버터밀크 1 1/2컵', '라드 또는 식물성 기름 1큰술', '무염 버터 1/2컵(1스틱), 실온', '잘게 다진 파 2큰술', '바다소금(서빙용)', '10인치 주철 프라이팬']",
        "Instructions": "오븐 중앙에 랙을 놓고 스킬렛을 랙 위에 올려놓습니다. 450°F로 예열합니다.\n그동안 큰 그릇에 콘밀, 설탕(사용하는 경우), 코셔 소금, 베이킹파우더, 베이킹소다를 넣고 휘저어 섞습니다. 중간 크기의 그릇에 계란과 버터밀크를 넣고 휘저어 마른 재료에 넣고 섞어줍니다.\n스킬렛을 오븐에서 조심스럽게 꺼내고 라드를 넣고 팬에 돌려 코팅합니다. 스킬렛에 반죽을 긁어 넣습니다(접촉 시 가장자리 주변에서 지글지글 타야 함). 콘브레드를 윗부분이 황금빛 갈색이 되고 중앙이 단단해질 때까지 15~20분간 굽습니다. 서빙하기 전에 15분간 식힙니다.\n콘브레드에 버터를 바르고 파를 얹고 바닷소금을 뿌립니다.",
        "Image_Name": "skillet-cornbread-with-chives.jpg"
    },
    {
        "Title": "크림이 들어간 애플 진저브레드 케이크",
        "Ingredients": "['무염 버터 3큰술 반컵, 팬용도 더 필요', '연한 황설탕 1컵(꽉 채운 것), 나누어 담음', '레이디 사과 1파운드, 껍질 벗기지 않고 아주 얇게 썰어서 씨를 제거하고 나누어 담음', '다용도 밀가루 2컵', '베이킹파우더 1 1/2작은술', '코셔 소금 1 1/2작은술', '계피 가루 1 1/2작은술', '정향 가루 1/2작은술', '육두구 가루 1/2작은술', '진한 풍미(다크) 당밀 1/2컵', '순수 메이플 시럽 1/2컵', '큰 달걀 2개, 실온', '잘게 갈은 껍질 벗긴 생강 2큰술', '베이킹소다 1 1/2작은술', '크림 1/2컵, 서빙용도 더 필요', '10인치 스프링폼 팬']",
        "Instructions": "오븐을 350°F로 예열합니다. 팬에 버터를 바르고 바닥에 양피지를 깔고, 양피지에 버터를 바릅니다. 큰 프라이팬에 버터 1큰술, 황설탕 1/2컵, 물 2큰술을 넣고 중불로 가열하면서 끊임없이 저어주며 버터가 녹고 설탕이 녹을 때까지 가열합니다. 저어주지 않고 프라이팬을 자주 돌려가며 천천히 터지는 큰 거품이 형성될 때까지 약 2분간 조리합니다. 캐러멜을 준비한 팬에 붓고 팬을 기울여 바닥을 고르게 코팅합니다.\n같은 프라이팬에 버터 1큰술을 중불로 녹입니다. 사과 반쪽을 넣고 섞어서 분리합니다. 사과가 부드러워지고 거의 반투명해질 때까지 자주 저어주며 약 4분간 조리합니다. 버터 1큰술과 남은 사과로 과정을 반복합니다. 사과를 손으로 만질 수 있을 만큼 식을 때까지 둔 다음 캐러멜 위에 여러 겹으로 놓습니다. 팬을 따로 보관합니다.\n큰 그릇에 밀가루, 베이킹파우더, 소금, 계피, 정향, 육두구를 넣고 섞은 다음 따로 보관합니다. 내열 그릇에 당밀, 메이플 시럽, 남은 황설탕 1/2컵, 남은 버터 1/2컵을 넣고 물이 거의 끓지 않는 냄비 위에 올려놓고 끊임없이 저어가며 버터가 녹고 혼합물이 부드러워질 때까지 가열합니다. 계란과 생강을 넣고 휘젓습니다. 작은 그릇에 베이킹소다를 1/4컵의 아주 뜨거운 물에 넣고 녹을 때까지 저은 다음 당밀 혼합물에 넣습니다. 당밀 혼합물을 남은 건조 재료에 넣고 휘젓고 사과 위에 반죽을 긁어 올려 고르게 펴 바릅니다. 반죽 위에 크림 1/2컵을 고르게 뿌립니다.\n케이크를 호일에 싼 테두리가 있는 베이킹 시트에 올려놓고 가운데가 딱딱해지고 가운데에 꽂은 케이크 테스터가 깨끗하게 나올 때까지 35~45분간 굽습니다. 팬을 와이어 랙으로 옮기고 케이크를 팬에서 15분간 식힙니다. 케이크 옆면을 따라 칼로 깎아낸 다음, 팬 옆면을 제거하고 케이크를 랙 위에 뒤집습니다. 팬을 조심스럽게 제거하고 양피지를 벗깁니다(사과가 달라붙을 수 있으므로 천천히 작업합니다). 완전히 식힙니다.\n케이크를 쐐기 모양으로 자르고 크림을 더 뿌려 서빙합니다.\n케이크는 1일 전에 구울 수 있습니다. 밀폐하여 실온에서 보관합니다. 사과를 되살리려면 전자레인지에서 케이크를 살짝 데운 다음 위에 메이플 시럽을 바릅니다.",
        "Image_Name": "apple-gingerbread-cake-with-cream.jpg"
    },
    {
        "Title": "삶은 계란과 꿀 소스를 곁들인 플랜틴 플랫브레드",
        "Ingredients": "['중간 크기의 녹색/약간 노란색 바나나 1개, 껍질을 벗기고 자름', '계란 3~4개', '바다소금', '갓 갈은 검은 후추', '꿀', '장식: 얇게 썬 파']",
        "Instructions": "오븐을 375ºF로 예열합니다. 9x9인치 베이킹 팬에 코코넛 오일을 바릅니다.\n고속 블렌더에 플랜테인, 계란 2개, 소금 한 꼬집을 넣고 부드러워질 때까지 블렌딩합니다.\n이 혼합물을 베이킹 팬에 붓고 25~30분 동안 굽습니다. 굳고 중앙에 쑤시개를 꽂아 깨끗하게 나올 때까지(또는 측면을 들어 올려 익었는지 확인) 굽습니다.\n계란 1~2개를 삶습니다(제공하는 계란 수에 따라 다름). 플랜테인 플랫브레드에 삶은 계란을 얹어 제공합니다.\n소금과 후추를 뿌려 맛을 내고 꿀을 살짝 뿌립니다. 원하는 대로 장식합니다.",
        "Image_Name": "plantain-flatbread-with-poached-egg-and-honey-drizzle.jpg"
    },
    {
        "Title": "철제 프라이팬 콘브레드",
        "Ingredients": "['다용도 밀가루 1 1/4컵', '고운 가루 옥수수가루 1컵', '베이킹파우더 1큰술', '코셔 소금 1 1/2작은술', '큰 달걀 4개', '크림 옥수수 통조림 1 1/2컵(15온스 캔 1개)', '연한 녹색 고추 1캔(4.5온스), 물기를 빼고 다진 것', '연한 흰색 체다 치즈 1 1/2온스, 강판한 것(약 1/2컵)', '몬터레이 잭 치즈 1 1/2온스, 강판한 것(약 1/2컵)', '무염 버터 3/4컵(1 1/2스틱), 실온', '설탕 2/3컵', '논스틱 식물성 기름 스프레이', '10인치 주철 프라이팬(테두리부터 측정)']",
        "Instructions": "오븐 중앙에 랙을 놓습니다. 프라이팬을 테두리가 있는 베이킹 시트에 놓고 랙 위에 올려놓고 오븐을 400°F로 예열합니다. 작은 그릇에 밀가루, 콘밀, 베이킹파우더, 소금을 넣고 섞습니다. 중간 크기의 그릇에 계란을 가볍게 치고 섞은 다음 크림 옥수수, 칠리, 체다 치즈, 몬테레이 잭을 넣고 섞습니다.\n큰 그릇에 버터와 설탕을 나무 숟가락으로 버터가 설탕을 흡수하지만 버터는 여전히 작은 조각일 때까지 섞습니다. 계란 혼합물을 넣고 섞습니다. 마른 재료를 거의 섞이지 않을 때까지 섞습니다.\n프라이팬을 오븐에서 꺼내고 노스틱 스프레이를 가볍게 뿌립니다. 반죽을 긁어 넣습니다(접촉 시 지글지글 끓고 중앙에 약간 뭉쳐 있어야 함). 콘브레드를 윗부분이 황금빛 갈색이 되고 살짝 누르면 튀어나올 때까지 35~45분간 굽습니다. 서빙하기 전에 10분간 식힙니다.",
        "Image_Name": "hillstone-iron-skillet-cornbread.jpg"
    },
    {
        "Title": "훈제 연어, 무, 허브를 곁들인 플랫브레드",
        "Ingredients": "['일반 전유 요거트 3컵', '식물성 기름(그릴용)', '마늘 허브 난 1/2개 또는 시중에서 판매하는 피자 도우 1파운드(실온), 반으로 자름', '훈제 송어 2개(5온스 패키지), 굵게 플레이크', '무 4개, 다듬어서 만돌린으로 얇게 썬 것', '굵게 다진 딜 1/4컵', '얇게 썬 파 2큰술', '바다소금', '갓 빻은 후추', '레몬 조각(서빙용)', '치즈 천']",
        "Instructions": "고운 망사 체에 치즈 천을 깔고 중간 크기의 그릇 위에 올려놓습니다. 체에 요거트를 넣고 비닐 랩으로 덮은 다음 냉장고에 최소 1일, 조금 더 걸쭉하게 만들고 싶다면 최대 2일까지 물기를 빼세요. 남은 액체는 버리세요. (또는 이 단계를 완전히 건너뛰고 대신 1 1/2컵의 시중에서 판매하는 라브네를 사용하세요.)\n중간에서 높은 간접 열에 그릴을 준비하세요(숯불 그릴의 경우 그릴 한쪽에 숯을 쌓으세요. 가스 그릴의 경우 버너 하나나 둘을 끄세요). 그릴에 가볍게 기름을 바르세요. 한 번에 반죽 한 조각씩 작업하면서 약 10x8인치 타원으로 부드럽게 늘립니다. 직화로 구워서 필요에 따라 뒤집고 돌려가며 빵이 딱딱해지고 양쪽이 살짝 탄 상태가 될 때까지 굽습니다. 총 3분 정도 걸립니다. 남은 반죽을 구울 때는 간접 열로 옮겨 따뜻하게 유지합니다.\n두 개의 플랫브레드를 작업대에 옮기고 물기를 뺀 요거트를 뿌립니다. 송어, 무, 딜, 파를 얹습니다. 소금과 후추를 뿌리고 레몬 조각을 짜서 곁들입니다.\n요거트는 1주일 전에 물기를 뺄 수 있습니다. 덮고 식힙니다.",
        "Image_Name": "flatbread-with-smoked-trout-radishes-and-herbs.jpg"
    },
    {
        "Title": "3가지 재료로 만든 플레이키 플랫브레드",
        "Ingredients": "['다용도 밀가루 2컵 + 1큰술', '소금 1작은술', '베이킹파우더 1/2작은술', '올리브 오일(기름칠용)', '무염 버터 1컵(2스틱)을 부드럽게 해서 나누어 놓음']",
        "Instructions": "큰 그릇에 밀가루, 소금, 베이킹파우더를 넣고 휘젓습니다. 가운데에 구멍을 뚫고 물 2/3컵을 천천히 넣고 손이나 나무 숟가락으로 섞어 털털한 반죽이 될 때까지 섞습니다. 반죽을 그릇에 넣고 부드럽고 탄력이 생길 때까지 약 4분간 반죽합니다. 반죽을 깨끗한 작업대에 옮깁니다. 그릇을 닦고 기름을 살짝 바릅니다. 반죽을 그릇에 다시 넣고 주방 타월로 덮은 다음 30분간 쉬게 합니다.\n반죽을 깨끗한 작업대에 꺼냅니다. 벤치 스크레이퍼나 큰 칼을 사용하여 6등분합니다. 공 모양으로 만들고 덮은 다음 15분간 더 쉬게 합니다.\n큰 쿠키 시트나 테두리가 있는 베이킹 시트의 아랫면에 버터 1큰술을 바릅니다. 테두리가 있는 다른 베이킹 시트에 양피지를 깔아줍니다.\n준비된 쿠키 시트에 반죽 1조각을 놓습니다. 손가락 끝으로 납작한 타원형으로 두드린 다음 반죽 위에 버터 2큰술을 바릅니다. 손가락 끝으로 반죽을 바깥쪽으로 눌러 밀어내어 약 12x10인치 크기의 매우 얇은 타원으로 늘립니다.\n긴 쪽 끝에서 시작하여 반죽을 그 자체 위로 굴려 약 1인치 너비의 긴 튜브를 만듭니다. 살짝 납작하게 합니다. 짧은 쪽 끝에서 시작하여 젤리 롤처럼 코일 모양으로 굴립니다. 양피지를 깐 시트로 옮깁니다. 주방 타월로 덮습니다. 남은 반죽으로 반복합니다. 덮고 15분간 얼립니다.\n한 번에 하나씩 작업하면서 코일을 옆으로 돌리고 손바닥으로 디스크 모양으로 납작하게 합니다. 롤링 핀을 사용하여 약 8x4인치 크기의 거친 타원형으로 굴립니다. 냉동고로 옮깁니다. 남은 코일로 반복하고 사용할 때까지 냉동합니다.\n중불로 가열한 그릴판이나 대형 논스틱 프라이팬에 버터 1큰술을 넣습니다. 반죽 2개를 넣고 불을 중불로 줄인 후 플랫브레드를 바닥이 황금빛 갈색이 되고 아래에 큰 거품이 형성될 때까지 약 3분간 굽습니다. 뒤집어서 두 번째 면이 황금빛 갈색이 될 때까지 약 1분간 더 굽습니다. 남은 반죽으로 반복하고 각 배치 전에 버터 1큰술을 넣습니다.",
        "Image_Name": "3-ingredient-flaky-flatbread.jpg"
    },
    {
        "Title": "파바콩, 오이, 부라타 치즈를 곁들인 플랫브레드",
        "Ingredients": "['껍질을 벗긴 파바콩 2컵(꼬투리 2파운드 정도)', '코셔 소금', '신선한 레몬즙 2큰술', '올리브 오일 2큰술(구이용 오일 추가)', '갓 갈은 후추', '페르시아 오이 2개(얇게 썬 것)', '양념하지 않은 쌀 식초 2큰술', '마늘 허브 난 1/2개 또는 시중에서 판매하는 피자 반죽 1파운드(실온)을 반으로 자른 것', '부라타 치즈 또는 신선한 모짜렐라 치즈 2개(8온스)', 물기를 뺀 것', '바질 잎(서빙용)', '볶은 참깨 1작은술', '바다 소금']",
        "Instructions": "중간 크기의 냄비에 끓는 소금물에 파바콩을 넣고 약 4분간 익을 때까지 익힌다. 망사 체를 사용하여 얼음물 그릇에 놓인 체에 옮긴다. 물을 빼고 껍질을 벗긴다. 레몬즙, 기름 2큰술, 파바콩 반을 중간 크기의 그릇에 넣고 포크로 가볍게 으깬다. 남은 파바콩을 넣고 저어주고, 코셔 소금과 후추로 간을 한다.\n중간 크기의 그릇에 오이와 식초를 넣고, 코셔 소금으로 간을 한다. 약간 부드러워질 때까지 10~12분간 둔다.\n중불에서 간접적으로 가열할 그릴을 준비한다(숯불 그릴의 경우 그릴 한쪽에 숯을 쌓는다. 가스 그릴의 경우 버너 하나나 둘을 끄고); 그릴에 가볍게 기름을 바른다. 한 번에 반죽 한 조각씩 작업하면서 약 10x8인치 타원으로 부드럽게 늘립니다. 직화로 구워서 필요에 따라 뒤집고 돌려가며 빵이 딱딱해지고 양쪽이 살짝 탄 상태가 될 때까지 굽습니다. 총 3분 정도 걸립니다. 나머지 반죽을 구울 때는 간접 열로 옮겨 따뜻하게 유지합니다.\n플랫브레드를 작업대에 옮깁니다. 부라타를 조각으로 찢어서 플랫브레드에 나눕니다. 푸바콩 혼합물, 오이, 바질을 얹습니다. 참깨, 바다 소금, 후추를 뿌립니다.\n푸바콩은 3일 전에 조리할 수 있습니다. 덮고 식힙니다.",
        "Image_Name": "flatbread-with-fava-beans-cucumbers-and-burrata.jpg"
    },
    {
        "Title": "아티초크, 시금치, 프로슈토 플랫브레드와 매콤한 꿀",
        "Ingredients": "['올리브 오일 3큰술', '마늘 4쪽, 얇게 썬 것', '잘게 다진 납작잎 파슬리 2큰술', '냉동 시금치 1팩(10온스), 해동한 것', '냉동 아티초크 하트 1팩(9온스), 해동한 것', '코셔 소금, 갓 갈은 후추', '잘게 갈은 레몬 제스트 2큰술', '옥수수 가루(팬용)', '냉동 피자 반죽 1파운드, 해동한 것', '다용도 밀가루(표면용)', '파마산 치즈 1/2파운드, 상자 강판의 큰 구멍으로 갈아서(약 2컵), 나누어 놓은 것', '꿀 3큰술', '고추 플레이크 1 1/2작은술', '얇게 썬 프로슈토 2온스']",
        "Instructions": "오븐의 중간과 위쪽 1/3에 랙을 놓고 475ºF로 예열합니다.\n중불로 가열한 대형 무거운 프라이팬에 기름을 데웁니다. 마늘과 파슬리를 넣고 30초간 저어가며 조리합니다. 시금치와 아티초크를 넣고 코팅하고 뚜껑을 덮은 채로 아티초크가 부드러워질 때까지 10~12분간 조리합니다. 뚜껑을 열고 가끔 저어가며 주스가 걸쭉해질 때까지 약 2분간 끓입니다. 소금 1/2티스푼과 검은 후추를 약간 넣습니다. 불에서 내리고 레몬 제스트를 넣고 저어줍니다.\n림이 없는 베이킹 시트 2개에 콘밀을 뿌립니다. 반죽의 절반을 밀가루를 뿌린 표면에 펴서 12x7인치 타원형으로 만듭니다. 베이킹 시트로 옮깁니다. 남은 반죽으로 반복합니다.\n각 반죽에 파마산 치즈 1/2컵을 뿌린 다음, 아티초크와 시금치 혼합물을 고르게 얹습니다. 남은 파마산 치즈 1컵을 얹고 소금과 후추를 약간 뿌립니다. 중간에 시트를 돌려가며 빵 껍질이 황금빛 갈색이 될 때까지 굽습니다(20~22분).\n그 사이에 작은 그릇에 꿀과 고추 플레이크를 섞습니다.\n플랫브레드를 오븐에서 꺼냅니다. 프로슈토를 얹고 매운 꿀을 뿌립니다. 플랫브레드를 쐐기 모양으로 자르고 서빙합니다.",
        "Image_Name": "artichoke-spinach-and-prosciutto-flatbreads-with-spicy-honey.jpg"
    },
    {
        "Title": "플랫브레드에 팔라펠 양념 토마토와 병아리콩",
        "Ingredients": "['마늘 2쪽, 잘게 다진 것', '수막 1티스푼', '붉은 고추 플레이크 1/2티스푼', '고수 가루 1/2티스푼', '쿠민 가루 1/2티스푼', '코셔 소금 1티스푼, 추가', '큰 전통 토마토 2개, 색상 무관, 얇게 썬 것', '병아리콩 1캔(15.5온스), 헹군 것', '붉은 와인 식초 2큰술', '검은 후추 가루', '작은 샬롯 1개, 얇게 썬 것', '줄기가 부드러운 파슬리 잎 1/2컵', '올리브 오일 3큰술', '페르시아 오이 1개, 껍질을 벗기고 다진 것', '플레인 요거트 3/4컵', '신선한 민트 1/2컵, 굵게 다진 신선한 파슬리 1/2컵', '코셔 소금, 후추 가루', '플랫브레드와 조립', '2 [작은술 코셔 소금', '3/4작은술 베이킹파우더', '1/2작은술 설탕', '2컵 다용도 밀가루(더 필요량)', '1컵 플레인 요거트', '4큰술 올리브 오일(더 필요량)', '갓 빻은 검은 후추', '신맛이 나는 감귤 향의 향신료인 수막은 중동 시장과 특산 식품점에서 찾을 수 있습니다.']",
        "Instructions": "작은 그릇에 마늘, 수맥, 고추 플레이크, 고수, 커민, 소금 1티스푼을 섞습니다. 테두리가 있는 베이킹 시트에 토마토 조각을 한 겹으로 놓고 마늘 혼합물을 고르게 뿌립니다. 실온에 최소 30분에서 최대 1시간 동안 두십시오.\n중간 크기의 그릇에 병아리콩과 식초를 넣고 소금과 후추로 간을 합니다. 병아리콩을 포크로 약 절반이 으깨질 때까지 으깨십시오. 샬롯, 파슬리, 기름을 넣고 섞습니다. 소금과 후추로 간을 합니다. 따로 보관합니다.\n중간 크기의 그릇에 오이, 요거트, 민트, 파슬리를 넣고 매운 소스, 소금, 후추로 간을 합니다. 실온에 최소 15분 동안 두십시오.\n요거트 소스는 1시간 전에 만들 수 있습니다. 덮고 식힙니다.\n큰 그릇에 소금, 베이킹파우더, 설탕, 밀가루 2컵을 넣고 휘젓습니다. 요거트를 넣고 저어서 섞습니다(요거트의 산도가 부드러운 식감을 보장합니다). 반죽을 가볍게 밀가루를 뿌린 작업대에 옮겨 대부분 매끄러워질 때까지 반죽합니다(약 1분). 4조각으로 나누고 비닐 랩으로 덮은 다음 15분간 쉬게 합니다(이렇게 하면 반죽을 펴기가 더 쉽습니다).\n한 번에 하나씩 반죽을 펴서 두께가 약 1/8인치인 원형으로 펴세요.(스트레스 받지 마세요. 완벽할 필요는 없습니다.) 대형 프라이팬(주철이면 더 좋습니다)에 기름 1큰술을 넣고 중불로 가열합니다.\n한 번에 하나씩 반죽을 펴서 밑면이 황금빛 갈색이 되고 플랫브레드가 부풀기 시작할 때까지 약 2분간 굽습니다. 뒤집어서 반대쪽이 황금빛 갈색이 될 때까지 약 1분 더 굽습니다. 접시에 옮깁니다. 남은 기름과 반죽 원형으로 반복합니다. 약간 식힙니다.\n각 플랫브레드 위에 요거트 소스, 병아리콩 혼합물, 토마토를 얹습니다. 기름을 더 뿌리고 소금과 후추로 간을 합니다.",
        "Image_Name": "falafel-spiced-tomatoes-and-chickpeas-on-flatbread-56389870.jpg"
    },
    {
        "Title": "과일, 꽃, 허브를 곁들인 라벤더 쇼트브레드",
        "Ingredients": "['큰 달걀 흰자 3개', '가루 설탕 4컵', '크림 오브 타르타르 1/2티스푼', '쌀가루 1/3컵', '코셔 소금 1 1/2티스푼', '다용도 밀가루 2 1/2컵', '무염 버터 1컵 + 6큰술, 조각으로 자름, 실온', '과립 설탕 3/4컵', '건조 라벤더 굵게 갈은 것 1티스푼', '동결 건조 및/또는 건조 과일, 건조 식용 꽃, 신선 및/또는 건조 허브(장식용)', '직경 3 1/8인치 1개, 직경 1 1/4인치 1개']",
        "Instructions": "나무 숟가락이나 고무 주걱을 사용하여 달걀 흰자, 가루 설탕, 크림 오브 타르타르를 중간 크기의 그릇에 넣고 마른 부분이 없는 걸쭉한 반죽이 될 때까지 저어줍니다. 이상적으로는 설탕이 완전히 수화되도록 유약을 최소 12시간 동안 두어야 하지만 쿠키가 식으면 바로 사용할 수 있습니다. 또는 덮고 최대 1주일 동안 냉장 보관할 수 있습니다. 사용하기 전에 실온으로 맞춥니다.\n중간 크기의 그릇에 쌀가루, 소금, 다용도 밀가루 2 1/2컵을 넣고 휘젓습니다. 전기 믹서를 중간~높은 속도로 사용하여 중간 크기의 그릇에 버터, 설탕, 라벤더를 약 5분간 매우 창백하고 부드러워질 때까지 섞습니다. 완전히 합쳐질 때까지 낮은 속도로 건조한 재료를 섞습니다. 비닐에 싸서 최소 2시간에서 최대 2일까지 냉장 보관합니다. 오븐을 350°로 예열합니다. 가볍게 밀가루를 뿌린 양피지 두 장 사이에 반죽을 1/8인치 두께로 펴세요. 큰 커터를 사용하여 16개의 원형을 잘라내고 남은 반죽을 다시 말아주세요. 작은 커터를 사용하여 가운데를 펀칭하세요. 양피지를 깐 베이킹 시트에 올려 가장자리가 노릇노릇해질 때까지 12~14분간 굽습니다. 와이어 랙에서 식힙니다.\n빠르게 쿠키 윗부분을 유약에 담그고 남은 것을 떨어뜨립니다. 와이어 랙으로 옮겨 장식합니다.",
        "Image_Name": "lavender-shortbread-with-fruits-flowers-and-herbs-51259280.jpg"
    },
    {
        "Title": "콘브레드, 초리조, 체리, 피칸 스터핑",
        "Ingredients": "['무염 버터 3/4컵(1 1/2개), 조각으로 자르고, 나누고, 더 많이', '화이트 와인 식초 1/4컵', '말린 타트 체리 1/2컵', '굵게 부순 콘브레드 10컵(수제, 가급적이면 밤새 말려 두기)', '굵게 다진 피칸 1/3컵', '올리브 오일 1/4컵', '신선한 초리조 1파운드(껍질 제거)', '중간 크기 양파 2개(잘게 다진 것)', '셀러리 줄기 4개(잘게 다진 것)', '코셔 소금, 후추 가루', '마늘 2쪽(잘게 다진 것)', '신선한 세이지 2큰술(잘게 다진 것)', '큰 달걀 2개', '닭고기 육수 또는 저염 닭고기 육수 3컵(나누기)', '신선한 파슬리 1/4컵(잘게 다진 것)']",
        "Instructions": "오븐을 400°로 예열합니다. 얕은 3쿼트 베이킹 접시와 호일 한 장에 버터를 바릅니다. 작은 냄비에 식초와 물 2큰술을 넣고 끓입니다. 불에서 내리고 체리를 넣습니다. 체리가 부풀어 오를 때까지 15-20분간 그대로 둡니다.\n그 사이에 테두리가 있는 베이킹 시트에 콘브레드를 펴서 황금색이 될 때까지 10-15분간 토스트합니다. 식힙니다. 매우 큰 그릇에 넣습니다.\n체리를 빼고, 담가두었던 액체를 따로 보관하고, 체리를 콘브레드가 있는 그릇에 넣습니다(섞지 마세요).\n오븐 온도를 350°로 낮춥니다. 테두리가 있는 깨끗한 베이킹 시트에 피칸을 토스트하고, 한 번 뒤집어서 향이 나고 약간 어두워질 때까지 8-10분간 토스트합니다. 식힙니다. 그릇에 넣습니다.\n그 사이에 중불로 가열한 대형 프라이팬에 기름을 두릅니다. 가끔 저어주고 숟가락으로 작은 조각으로 쪼개서 갈색이 되고 완전히 익을 때까지 8-10분간 조리합니다. 슬롯형 스푼으로 그릇에 옮깁니다.\n양파와 셀러리를 프라이팬에 넣고 소금과 후추로 간을 한 다음 양파가 황금빛 갈색이 되고 부드러워질 때까지 자주 저어가며 10~12분간 조리합니다. 마늘과 세이지를 넣고 향이 날 때까지 약 2분간 저어가며 조리합니다. 그릇에 옮깁니다.\n불을 중불로 줄이고 남은 체리 담가두기 액체를 프라이팬에 넣고 갈색 조각을 긁어내며 거의 모두 증발할 때까지 약 1분간 조리합니다. 버터 1/2컵을 넣고 녹을 때까지 저어가며 조리합니다. 빵 혼합물에 뿌립니다.\n중간 크기의 그릇에 계란과 육수 2컵을 넣고 휘저은 다음 콘브레드 혼합물에 붓습니다. 파슬리를 넣고 소금과 후추로 간을 한 다음 부드럽게 섞고 필요에 따라 육수를 1/4컵씩 더 넣습니다(모두 사용하지 않아도 됨). 섞이고 콘브레드가 수분을 흡수할 때까지 섞습니다. 콘브레드가 부스러기로 부서지지 않도록 조심스럽게 섞습니다. 준비된 접시에 옮기고 남은 버터 1/4컵을 떨어뜨립니다.\n버터를 바른 호일로 덮습니다. 중앙에 칼을 꽂아 뜨거워질 때까지 굽습니다(30~35분). 오븐 온도를 450°로 높입니다. 뚜껑을 열고 위가 황금빛 갈색이 되고 바삭해질 때까지 굽습니다(20~25분). 서빙하기 전에 10분 동안 그대로 둡니다.\n미리 준비: 스터핑은 1일 전에 조립할 수 있습니다. 뚜껑을 덮고 식힙니다.",
        "Image_Name": "cornbread-chorizo-cherry-and-pecan-stuffing-51255140.jpg"
    },
    {
        "Title": "무화과잼을 곁들인 더치 오븐 콘브레드",
        "Ingredients": "['무염 버터 3/4컵(1 1/2개 스틱)', '다용도 밀가루 1 1/2컵', '옥수수 가루 1 1/2컵', '설탕 1/4컵', '베이킹 소다 2티스푼', '코셔 소금 2티스푼', '베이킹 파우더 1/2티스푼', '큰 달걀 3개', '전유 1컵', '무화과 잼 3/4컵']",
        "Instructions": "오븐을 425°로 예열합니다. 버터를 직경 10~12인치의 더치 오븐에 넣고 뚜껑을 덮은 다음 오븐에 넣고 냄비를 데워 버터를 녹입니다(버터가 타지 않도록 주의). 버터를 돌려 팬 바닥과 측면을 반쯤 코팅합니다. 버터를 작은 그릇에 붓고 따로 보관합니다.\n그동안 큰 그릇에 밀가루, 콘밀, 설탕, 베이킹 소다, 소금, 베이킹 파우더를 휘젓습니다. 중간 크기의 그릇에 계란과 우유를 휘젓습니다. 콘밀 혼합물에 남겨둔 녹인 버터를 넣고 휘젓고 섞습니다. 반죽을 뜨거운 더치 오븐에 긁어 넣습니다.\n콘브레드가 가장자리 주변이 굳기 시작할 때까지 10~12분간 덮고 굽습니다. 표면에 잼을 뿌립니다. 덮고 중앙에 꽂은 테스터가 깨끗해질 때까지 굽습니다. 15~20분 더 굽습니다. 뚜껑을 열고 15분간 식힙니다. 서빙하려면 콘브레드를 쐐기 모양으로 자릅니다.",
        "Image_Name": "dutch-oven-cornbread-with-fig-jam-51238440.jpg"
    },
    {
        "Title": "진저브레드",
        "Ingredients": "['다용도 밀가루 2컵', '생강가루 1 1/2티스푼', '베이킹소다 1티스푼', '계피 1/2티스푼', '소금 1/2티스푼 약간', '무염 버터 1스틱(연화)', '진한 흑설탕 3/4컵', '큰 달걀 1개', '연한 당밀 1/2컵(강력하거나 블랙스트랩은 불가)', '잘 흔든 버터밀크 3/4컵', '뜨거운 물 1/2컵', '가볍게 달게 한 휘핑크림']",
        "Instructions": "오븐을 350°F로 예열하고 랙을 가운데에 놓습니다. 9인치 정사각형 베이킹 팬에 버터를 바릅니다.\n그릇에 밀가루, 생강, 베이킹 소다, 계피, 소금을 넣고 휘젓습니다. 버터와 설탕을 전기 믹서로 중간 속도로 옅고 부드러워질 때까지 치세요. 계란을 넣고 섞은 다음 당밀과 버터밀크를 넣고 치세요. 밀가루 혼합물을 저속으로 부드러워질 때까지 섞은 다음 뜨거운 물을 넣고 1분간 치세요(반죽이 응고된 것처럼 보일 수 있음).\n반죽을 팬에 고르게 펴 바르고 가운데에 꽂은 나무 송곳이 깨끗하게 나올 때까지 굽습니다. 40~45분. 팬에 넣고 랙 위에 식힙니다.",
        "Image_Name": "gingerbread-51210010.jpg"
    },
    {
        "Title": "진저브레드 쿠키 샌드위치",
        "Ingredients": "['다용도 밀가루 3 1/2컵', '베이킹 소다 1 1/2티스푼', '코셔 소금 1/4티스푼', '생강가루 1 1/2티스푼', '계피가루 1티스푼', '정향가루 1/4티스푼', '올스파이스가루 1/4티스푼', '무염 버터 1컵(실온)', '진한 갈색 설탕 1컵(단단히 꽉 채워서)', '과립 설탕 1/2컵', '큰 달걀 1개', '당밀 1/4컵', '무염 버터 1/3컵(실온)', '순수 바닐라 추출물 1/2티스푼', '코셔 소금 1/8티스푼', '제과용 설탕 1 1/2컵', '우유 1큰술(필요에 따라 더 추가 가능)']",
        "Instructions": "1. 큰 그릇에 밀가루, 베이킹 소다, 소금, 향신료를 넣고 섞은 다음 따로 보관합니다. 스탠드 믹서의 그릇에 버터와 설탕을 넣고 가볍고 부드러워질 때까지 섞습니다. 계란을 넣고 섞습니다. 당밀을 넣고 섞고 필요하면 그릇의 측면을 한 번 긁어내립니다.\n2. 세 번에 나눠서 건조한 재료를 넣고, 각 재료 사이에 섞어서 완전히 섞일 때까지 섞습니다. 반죽을 꺼내서 비닐 랩에 펴서 디스크 모양으로 만들고 단단히 포장한 다음 단단해질 때까지 냉장고에 보관합니다. 최소 2시간 동안 보관합니다. (반죽은 최대 1일 전에 만들 수 있습니다.)\n3. 오븐을 350°F로 예열합니다. 반죽을 꺼내서 반으로 자릅니다. 반쪽을 다시 포장해서 냉장고에 다시 넣습니다. 나머지 반쪽은 실온에 몇 분간 두어 약간 부드럽게 합니다. 작업대와 밀대에 가볍게 밀가루를 뿌리고 반죽을 1/4인치 두께로 펴세요.\n4. 베이킹 시트에 양피지를 깔아줍니다. 쿠키 커터를 사용하여 진저브레드 맨을 잘라내어 준비된 시트에 옮깁니다. (반죽이 매우 부드럽다면 오븐에 넣어 굽기 전에 진저브레드 맨을 베이킹 시트에 15분 동안 냉장 보관합니다.) 쿠키가 단단하고 바삭바삭해지기 시작할 때까지 12~15분간 굽습니다. 꺼내서 시트에서 5분간 식힌 다음 랙에 옮겨 완전히 식힙니다.\n5. 그동안 샌드위치 속을 만듭니다. 버터, 바닐라, 소금을 푹신해질 때까지 함께 치세요. 제과용 설탕을 두 번에 나눠 넣고 저속으로 섞어서 섞습니다. 우유를 넣고 혼합물이 걸쭉하지만 펴질 수 있을 때까지 치세요. 필요에 따라 우유를 1티스푼씩 더 넣습니다. 식은 진저브레드 맨의 절반에 아이싱을 펴 바르고 각각을 다른 쿠키와 샌드위치로 끼웁니다.",
        "Image_Name": "gingerbread-cookie-sandwiches-51205820.jpg"
    },
    {
        "Title": "로즈마리와 토스트 캐러웨이 쇼트브레드",
        "Ingredients": "['캐러웨이 씨앗 1티스푼', '1컵(2스틱) 냉장 무염 버터, 1/2인치 조각으로 자름', '과립 설탕 1/2컵', '가루 설탕 1/4컵', '코셔 소금 1/2티스푼', '다용도 밀가루 2 1/2컵', '잘게 다진 신선한 로즈마리 2티스푼, 통째 잎', '큰 달걀 1개, 섞기 위해 치기', '굵은 샌딩 설탕(뿌리기용)']",
        "Instructions": "오븐을 350°F로 예열합니다. 캐러웨이 씨앗을 중불에서 작은 마른 프라이팬에 넣고 가끔씩 뒤집어 향이 날 때까지 약 2분간 볶습니다. 거칠게 다지고 따로 보관합니다.\n전기 믹서기를 중불에서 고속으로 사용하여 버터, 과립 설탕, 가루 설탕, 소금을 매우 가볍고 부드러워질 때까지 7~10분간 치십시오(공기를 버터에 넣으면 부드러운 쇼트브레드가 됩니다). 속도를 낮추고 밀가루, 캐러웨이, 다진 로즈마리 2티스푼을 넣고 잘 섞습니다. 반죽은 엉성하고 약간 건조해 보일 것입니다(그렇지 않습니다!).\n반죽을 직경 8인치 케이크 팬 두 개에 눌러 넣습니다. 계란을 바르고, 샌딩 설탕을 뿌리고, 위에 로즈마리 잎을 얹습니다.\n쇼트브레드가 황금빛 갈색이 되고 측면이 팬에서 떨어질 때까지 20~25분간 굽습니다. 팬을 와이어 랙으로 옮깁니다. 팬에서 식힌 후 꺼내서 쐐기 모양이나 막대 모양으로 자릅니다.\n미리 만들기: 쇼트브레드 반죽은 1개월 전에 만들어서 단단히 포장하고 냉동합니다. 쇼트브레드는 1주일 전에 만들어서 단단히 포장해서 실온에서 보관합니다.",
        "Image_Name": "rosemary-and-toasted-caraway-shortbread-51205390.jpg"
    },
    {
        "Title": "캐러멜 사과와 양파를 곁들인 콘브레드",
        "Ingredients": "['무염 버터 3/4컵 플러스 2큰술', '중간 크기 양파 1개, 얇게 썬 것', '소금 1작은술, 더 추가', '갓 갈은 검은 후추', '중간 크기 빨간색 또는 분홍색 껍질 사과 2개(핑크 레이디 등), 얇게 썬 것', '설탕 5큰술, 나누어 담기', '신선한 타임 잎 3작은술, 나누어 담기', '옥수수 가루 1 1/2컵', '다용도 밀가루 1컵', '베이킹파우더 1큰술', '큰 달걀 2개', '버터밀크 1 1/2컵']",
        "Instructions": "오븐을 400°F로 예열합니다. 중불에서 8인치 주철 프라이팬에 버터를 녹입니다. 2큰술 버터를 제외한 나머지를 작은 그릇에 붓고 따로 보관합니다.\n프라이팬에 버터와 양파를 넣고 소금과 후추로 간을 한 다음 가끔 저어주면서 양파가 부드러워지고 갈색이 되기 시작할 때까지 약 4분간 조리합니다. 사과, 설탕 2큰술, 타임 2작은술을 넣고 자주 저어주면서 사과가 부드러워질 때까지 약 4분간 조리합니다. 양파 혼합물을 중간 크기의 그릇에 옮기고 프라이팬을 따로 보관합니다.\n큰 그릇에 콘밀, 밀가루, 베이킹파우더, 소금 1작은술, 남은 설탕 3큰술을 넣고 휘젓습니다. 계란, 버터밀크, 따로 보관해둔 녹인 버터 3/4컵을 부드러워질 때까지 조금씩 휘젓습니다(덩어리가 없어야 함). 양파 혼합물을 반으로 접고 따로 보관해둔 프라이팬에 반죽을 긁어 넣습니다. 남은 양파 혼합물과 남은 타임 1작은술을 위에 얹습니다.\n콘브레드를 황금색이 될 때까지 굽고 중앙에 꽂은 테스터가 나올 때까지 굽습니다. 깨끗이, 30-40분. 서빙하기 전에 약간 식힙니다.\n미리 준비: 콘브레드는 6시간 전에 만들 수 있습니다. 원한다면 서빙하기 전에 다시 데웁니다.",
        "Image_Name": "cornbread-with-caramelized-apples-and-onions-51198760.jpg"
    },
    {
        "Title": "초콜릿 쇼트브레드 쿠키",
        "Ingredients": "['밀가루 1 1/2 C', '무가당 코코아 1/2 C*', '굵은 소금 1/4 tsp', '무염 버터 1/2 파운드(2개), 실온', '과립 설탕 1/2 C', '카카오닙스 1 큰술*', '*샤펜 버거와 같은 고품질 초콜릿을 사용하세요.']",
        "Instructions": "작은 그릇에 밀가루와 코코아를 체로 걸러 섞습니다. 거친 소금을 넣고 따로 보관합니다.\n전기 믹서로 버터를 중속으로 3~5분간 부드러워질 때까지 치세요. 설탕과 카카오닙을 넣고 약 2분 더 매우 옅은 색이 될 때까지 계속 치세요. 밀가루와 코코아 혼합물을 넣고 저속으로 섞어 밀가루가 섞이고 손가락으로 꽉 쥐었을 때 반죽이 서로 붙을 때까지 섞습니다.\n왁스 종이에 반죽을 두드려 길이 약 12~14인치, 지름 1~1 1/2인치의 통나무 모양으로 만듭니다. 둥글지 않고 정사각형 또는 직사각형 쿠키를 원하시면 왁스 종이에 말아 올리면서 통나무의 각 면을 평평하게 펴세요. 단단해질 때까지 최소 1시간 동안 식힙니다.\n오븐을 325도로 예열합니다.\n쿠키 시트에 양피지를 깔아줍니다. 반죽에서 왁스 종이를 제거하고 통나무를 1/4인치 두께로 자릅니다. 쿠키를 깔아놓은 베이킹 시트에 놓습니다. 단단해질 때까지 17~20분간 굽습니다. 와이어 랙에서 완전히 식힙니다. 기밀 용기에 담아 3~4주 동안 보관할 수 있습니다.",
        "Image_Name": "chocolate-shortbread-cookies-51192010.jpg"
    },
    {
        "Title": "로즈워터 쇼트브레드 쿠키",
        "Ingredients": "['카다멈 가루 1/2티스푼', '흰쌀가루 1 1/2컵, 롤링용 추가', '가루 설탕 3/4컵', '무염 버터 1/2컵(1스틱), 실온', '큰 달걀 1개', '장미수 1티스푼', '양귀비 씨앗 1티스푼', '재료 정보: 쌀가루는 천연 식품점에서, 장미수는 중동 시장에서 판매합니다. 두 제품 모두 특산 식품점과 일부 슈퍼마켓에서 판매합니다.']",
        "Instructions": "중간 크기의 그릇에 카다멈과 밀가루 1 1/2컵을 넣고 휘저어 따로 보관합니다. 전기 믹서를 사용하여 중간 크기의 그릇에 설탕과 버터를 넣고 부드러워질 때까지 섞습니다. 계란과 장미수를 넣고 섞습니다.\n믹서기를 저속으로 줄이고 마른 재료를 서서히 섞습니다(반죽이 딱딱해질 것입니다). 덮고 최소 6시간 또는 밤새도록 식힙니다.\n오븐을 300°로 예열합니다. 반죽을 평평한 큰술로 떠서 가볍게 밀가루를 묻힌 손으로 공 모양으로 만듭니다. 양피지를 깐 베이킹 시트에 약 1 1/2인치 간격으로 놓습니다. 반죽에 장식 패턴을 만들 수 있는 포크나 다른 도구를 사용하여 공을 1/4인치 두께로 납작하게 만듭니다. (또는 공을 납작하게 만들고 엄지손가락으로 가운데를 움푹 패게 합니다.) 쿠키에 양귀비 씨앗을 뿌립니다.\n쿠키를 단단하지만 여전히 창백해질 때까지 20~25분간 굽습니다. 와이어 랙으로 옮기고 식힙니다.\n미리 준비: 쿠키는 5일 전에 구울 수 있습니다. 실온의 밀폐된 공간에 보관하세요.",
        "Image_Name": "rose-water-shortbread-cookies-51169140.jpg"
    },
    {
        "Title": "소금 쇼트브레드 크러스트를 곁들인 레몬-허니 타르트",
        "Ingredients": "['논스틱 식물성 기름 스프레이', '다용도 밀가루 1 3/4컵', '옥수수 전분 2큰술', '코셔 소금 1 1/4작은술', '무염 버터 3/4컵(1 1/2스틱), 실온, 1인치 조각으로 자름', '가루 설탕 2/3컵', '마이어 레몬 또는 얇은 껍질의 일반 레몬 1개', '설탕 1컵', '꿀 3큰술', '잘게 갈은 레몬 제스트 1큰술', '큰 달걀 3개', '큰 달걀 노른자 2개', '다용도 밀가루 1/4컵', '옥수수 전분 2작은술', '코셔 소금 1/4작은술', '신선한 레몬 주스 2/3컵, 가급적 마이어 레몬', '직경 9인치 스프링폼 팬']",
        "Instructions": "스프링폼 팬에 노스틱 스프레이를 뿌립니다. 작은 그릇에 밀가루, 옥수수 전분, 소금을 넣고 휘저어 둡니다. 따로 보관합니다. 버터와 가루 설탕을 푸드 프로세서에 넣습니다. 혼합물이 부드러워질 때까지 펄스합니다. 건조 재료를 푸드 프로세서에 넣고 혼합물이 중간 크기의 자갈과 비슷해질 때까지 펄스합니다(반죽이 완전히 합쳐지지는 않습니다). 반죽을 준비된 팬에 옮깁니다. 손가락을 사용하여 반죽을 팬 바닥과 1 1/2인치 위 측면에 고르게 누릅니다. 미리 준비: 크러스트는 1일 전에 준비할 수 있습니다. 덮고 냉장합니다.\n만돌린을 사용하여 레몬을 종이처럼 얇게 자릅니다. 씨를 제거합니다. (일반 레몬을 사용하는 경우 끓는 물에 4분간 데친 다음 물기를 빼고 식힌 다음 진행합니다). 중간 크기의 그릇에 설탕, 꿀, 레몬 제스트를 섞습니다. 레몬 조각을 넣고 섞어 코팅합니다. 레몬이 부드러워지고 설탕이 녹을 때까지 30~45분간 둡니다. 미리 준비: 레몬 조각 혼합물은 1일 전에 준비할 수 있습니다. 덮고 냉장합니다.\n오븐의 위쪽 1/3에 랙을 놓습니다. 325°F로 예열합니다. 중앙이 딱딱해지고 가장자리가 황금빛 갈색으로 변하기 시작할 때까지 30~35분간 굽습니다.\n크러스트가 거의 구워지면 중간 크기의 그릇에 계란과 달걀 노른자를 넣고 섞습니다. 밀가루, 옥수수 전분, 소금을 작은 그릇; 계란 혼합물에 넣고 휘저어 섞는다. 레몬즙을 넣고 휘저어 섞는다. 레몬 슬라이스 혼합물을 넣고 부드럽게 섞어 섞는다.\n오븐 온도를 300°F로 낮춘다. 뜨거운 크러스트에 충전물을 붓는다. 충전물이 굳고 가장자리가 약간 부풀어 오를 때까지 굽는다. 25-30분. 팬을 와이어 랙으로 옮기고 완전히 식힌다. 최소 4시간 동안 식힌 다음 틀에서 꺼낸다. 차갑게 제공한다. 미리 준비: 타르트는 2일 전에 만들 수 있다. 덮고 차갑게 보관한다.",
        "Image_Name": "lemon-honey-tart-with-salted-shortbread-crust-51140700.jpg"
    },
    {
        "Title": "크랜베리 쇼트브레드",
        "Ingredients": "['다용도 밀가루 1컵', '설탕 3/4컵 (나누어 사용)', '소금 1/4티스푼', '냉장 무염 버터 1/2컵 (1스틱) (1/2인치 크기로 자름)', '신선한 크랜베리 ​​10온스 봉지 (또는 냉동, 해동)', '신선한 자몽 주스 1/4컵', '강판한 자몽 제스트 1티스푼']",
        "Instructions": "오븐을 350°F로 예열합니다. 8x8x2인치 팬에 양피지를 깔고, 반대쪽 면에 2인치를 남겨둡니다. 중간 크기의 그릇에 밀가루, 설탕 1/4컵, 소금을 넣고 휘젓습니다. 손가락 끝을 사용하여 버터를 마른 재료에 문질러서 혼합물이 거친 밀가루와 비슷해질 때까지 문지릅니다.\n준비된 팬에 옮깁니다. 팬 바닥에 고르게 누릅니다(평평한 계량컵 바닥을 사용하면 좋습니다). 포크로 반죽을 찔러줍니다.\n쇼트브레드가 익고 옅은 황금색이 될 때까지 굽습니다(25~30분). 와이어 랙으로 옮깁니다. 팬에서 완전히 식힙니다. 미리 준비: 쇼트브레드는 3일 전에 만들어둘 수 있습니다. 팬을 비닐 랩으로 단단히 덮고 실온에 보관합니다.\n남은 설탕 1/2컵, 크랜베리 ​​1 1/2컵, 자몽 주스를 작은 냄비에 넣고 가끔 저어주면서 크랜베리가 터지고 혼합물이 시럽처럼 될 때까지 약 8분간 끓입니다. 남은 크랜베리를 넣고 껍질이 갈라지기 시작할 때까지 약 3분간 조리합니다. 식힙니다. 미리 준비: 크랜베리 ​​토핑은 3일 전에 만들 수 있습니다. 덮고 식힙니다.\n식힌 크랜베리 ​​토핑을 쇼트브레드 위에 얹습니다. 제스트를 뿌립니다. 종이를 덮고 쇼트브레드를 팬에서 들어 올려 도마로 옮깁니다. 쇼트브레드를 자릅니다.",
        "Image_Name": "cranberry-shortbread-51122650.jpg"
    },
    {
        "Title": "심플한 딸기 둘세 데 레체 쇼트브레드 타르트",
        "Ingredients": "['다용도 밀가루 1컵', '옥수수 전분 1/3컵', '베이킹파우더 1/4티스푼', '소금 1/4티스푼', '무염 버터 3/4스틱(6큰술), 부드럽게 한 것', '과립 설탕 1/3컵', '큰 달걀 노른자 2개', '바닐라 1티스푼', '차갑게 식힌 진한 크림 1컵', '사워크림 1/2컵', '설탕 3큰술', '바닐라 1티스푼', '수제 덜세 데 레체(또는 시중에서 구입한 것) 1/2컵', '딸기 1파운드, 껍질을 벗기고 썰어 놓은 것']",
        "Instructions": "오븐을 350°F로 가열하고 랙을 가운데에 놓습니다. 큰 베이킹 시트에 가볍게 버터를 바릅니다.\n작은 그릇에 밀가루, 옥수수 전분, 베이킹 파우더, 소금을 넣고 휘젓습니다.\n큰 그릇에 버터와 설탕을 넣고 전기 믹서기를 중간에서 높은 속도로 돌려 가볍고 부드러워질 때까지 섞은 다음 달걀 노른자와 바닐라를 넣습니다. 속도를 낮추고 밀가루 혼합물을 섞어서 잘 섞습니다.\n반죽을 원반 모양으로 만들고 양피지 두 장 사이에 펴서 11인치(약 1/8인치 두께)의 원형을 만듭니다. 양피지의 윗부분을 벗겨서 버립니다. (양피지의 아랫부분에 여전히 있는) 원형을 베이킹 시트에 밀어 넣습니다. (시트에 버터를 바르면 양피지가 제자리에 고정됩니다.)\n원형이 만져도 딱딱하고 가장자리가 옅은 황금색이 될 때까지 12~16분간 굽습니다. 양피지 위에 원형을 밀어서 랙에 올려 완전히 식힙니다.\n전기 믹서기를 사용하여 크림과 사워크림, 설탕, 바닐라를 부드러운 봉우리가 형성될 때까지 휘젓습니다.\n차가운 타르트를 양피지에서 조심스럽게 평평한 접시나 도마로 옮깁니다. 덜세 데 레체를 크러스트에 부드럽게 펴 바릅니다(이 경우 오프셋 주걱이 유용합니다). 크러스트가 깨지지 않도록 주의합니다. 덜세 데 레체 위에 크림을 얹고 딸기를 얹습니다.\n즉시 제공합니다.",
        "Image_Name": "simple-strawberry-dulce-de-leche-shortbread-tart-395010.jpg"
    },
    {
        "Title": "파마산 치즈 쇼트브레드, 회향과 바다소금",
        "Ingredients": "['무염 버터 1컵(2스틱), 실온', '가루 설탕 1/2컵', '갓 갈은 후추 1티스푼', '코셔 소금 3/4티스푼', '다용도 밀가루 2컵(추가 재료)', '파마산 치즈 잘게 갈은 것 1컵(약 2온스)', '회향 씨앗 1큰술', '말던 바다 소금 또는 기타 거친 소금 1티스푼', '엑스트라 버진 올리브 오일 2큰술']",
        "Instructions": "전기 믹서를 사용하여 중간 크기의 그릇에 버터를 넣고 저속으로 1~2분간 부드러워질 때까지 섞습니다. 가루 설탕, 후추, 코셔 소금을 넣습니다. 속도를 중간으로 줄이고 가끔 그릇의 측면을 긁어내리면서 가볍고 부드러워질 때까지 4~5분간 섞습니다. 밀가루와 치즈를 넣습니다. 믹서 속도를 낮게 줄이고 반죽이 뭉쳐질 때까지 섞습니다.\n반죽을 비닐에 싸서 직사각형 모양으로 납작하게 만듭니다. 단단해질 때까지 냉장합니다(최소 2시간). 미리 만들기: 반죽은 5일 전에 만들 수 있습니다. 냉장 보관합니다. 계속하기 전에 30분 동안 실온에 두세요.\n회향 씨앗을 다시 밀봉할 수 있는 비닐 냉동실 백에 넣습니다. 밀대나 프라이팬 바닥으로 굵게 으깨세요. 또는 향신료 분쇄기에 넣고 굵게 으깨질 때까지 펄스합니다. 작은 그릇에 옮기고 바닷소금을 넣고 저어줍니다. 회향 소금은 따로 보관합니다.\n오븐 중앙에 랙을 놓고 350°F로 예열합니다. 베이킹 시트에 양피지를 깔아줍니다. 반죽에서 비닐 랩을 제거합니다. 가볍게 밀가루를 뿌린 표면에 반죽을 펴서 두께가 약 1/4인치인 10x8인치 직사각형으로 펴세요. 가로로 3등분한 다음, 가로로 3등분한 각 3등분을 6개의 직사각형으로 자릅니다. 쿠키를 준비된 베이킹 시트에 1인치 간격으로 배열합니다. 쿠키에 기름을 듬뿍 바르고 회향 소금을 뿌립니다.\n시트를 반쯤 돌린 후 쿠키가 황금빛 갈색이 될 때까지 굽습니다(치즈 조각은 약간 더 진해질 것입니다). 20-24분 동안 굽습니다. 시트 위에서 최소 10분 동안 식힙니다. 따뜻하게 또는 실온에서 제공합니다. 미리 준비: 2일 전에 만들 수 있습니다. 실온에서 밀폐 보관합니다.",
        "Image_Name": "parmesan-shortbread-with-fennel-and-sea-salt-394673.jpg"
    },
    {
        "Title": "진저브레드 케이크",
        "Ingredients": "['논스틱 식물성 기름 스프레이', '다용도 밀가루 1 1/2컵', '생강가루 1티스푼', '계피가루 3/4티스푼', '코셔 소금 3/4티스푼', '베이킹파우더 1/2티스푼', '베이킹소다 1/2티스푼', '무염 버터 1/2컵(1스틱), 1/2인치 조각으로 자름', '연한 황설탕 1/2컵(꽉 채움)', '연한 풍미(연한) 당밀 1/2컵', '큰 달걀 1개, 섞기 위해 치기', '껍질을 벗긴 생강 2티스푼', '차갑게 식힌 진한 크림 1컵', '가루 설탕 1큰술', '시중에서 판매하는 레몬커드 1/4컵', '잘게 갈은 레몬 제스트', '8인치 정사각형 금속 케이크팬']",
        "Instructions": "오븐을 350°F로 예열합니다. 팬에 노스틱 스프레이를 뿌립니다. 바닥에 양피지를 깔고 스프레이를 뿌립니다. 중간 크기의 그릇에 밀가루와 다음 5가지 재료를 넣고 휘젓습니다. 큰 그릇에 버터를 넣습니다. 끓는 물 1/2컵을 붓고 녹을 때까지 휘젓습니다. 설탕과 다음 3가지 재료를 넣고 휘젓습니다. 마른 재료를 넣고 휘젓고 섞습니다. 준비된 팬에 옮깁니다.\n케이크 중앙에 꽂은 테스터가 깨끗하게 나올 때까지 굽습니다(약 25분). 팬에 넣고 10분간 식힙니다. 와이어 랙에 뒤집어 식힙니다. 양피지를 제거합니다.\n중간 크기의 그릇에 크림과 설탕을 넣고 단단한 봉우리가 형성될 때까지 휘젓습니다. 두부를 넣고 소용돌이 모양으로 접습니다. 케이크 위에 펴 바릅니다. 풍미로 장식합니다.",
        "Image_Name": "gingerbread-cake-368939.jpg"
    },
    {
        "Title": "쇼트브레드 쿠키",
        "Ingredients": "['통밀가루 2컵', '설탕 1/2컵', '베이킹파우더 1 1/2티스푼', '소금 버터 10 1/2큰술(실온)', '큰 달걀 1개(실온)', '큰 달걀 노른자 1개(실온)', '라즈베리잼 3큰술(대략)']",
        "Instructions": "오븐을 400°F로 예열합니다. 큰 그릇에 밀가루, 설탕, 베이킹파우더를 넣고 휘젓습니다. 버터를 넣고 손가락 끝으로 버터를 문질러 거친 가루가 형성될 때까지 문지릅니다. 그릇에 계란과 노른자를 넣고 휘젓고 밀가루 혼합물에 넣고 섞습니다.\n베이킹 시트 2개에 양피지를 깔아줍니다. 반죽을 2큰술씩 재서 공 모양으로 굴립니다. 준비된 시트에 2인치 간격으로 놓습니다. 각 공의 중앙에 홈을 냅니다. 각각에 잼을 1/2티스푼 채웁니다.\n쿠키를 노릇노릇해질 때까지 굽습니다(12~14분). 와이어 랙으로 옮겨 식힙니다.",
        "Image_Name": "shortbread-cookies-367140.jpg"
    },
    {
        "Title": "레몬라임 바질 쇼트브레드 쿠키",
        "Ingredients": "['다용도 밀가루 1컵', '가루 설탕 1/2컵 (쿠키 압착용 설탕 추가)', '무염 버터 1/2컵(1스틱)을 1/2인치 크기로 썰어 냉장 보관', '신선한 바질 잎 2큰술', '레몬 제스트 잘게 갈은 것 1작은술', '신선한 레몬즙 1큰술', '라임 제스트 잘게 갈은 것 1/2작은술', '소금 1/4작은술', '샌딩 설탕(선택 사항)', '성분 정보: 장식용 샌딩 설탕은 크고 바삭한 결정이 있습니다. 전문 식품점과 beryls.com에서 구입 가능합니다.']",
        "Instructions": "오븐을 375°F로 예열합니다. 밀가루, 가루 설탕 1/2컵, 버터, 바질, 두 가지 제스트, 레몬즙, 소금을 푸드 프로세서에 넣습니다. 크고 촉촉한 덩어리가 형성될 때까지 펄스합니다. 반죽을 평평한 큰술로 측정하고 손바닥 사이에서 굴려 공 모양을 만듭니다. 2인치 간격으로 큰 베이킹 시트에 놓습니다. 평평한 계량 컵의 바닥에 가루 설탕을 살짝 뿌리고 쿠키를 2인치 크기로 눌러서 필요에 따라 컵 바닥에 가루 설탕을 뿌려 달라붙지 않도록 합니다. 쿠키 위에 샌딩 설탕을 뿌립니다(사용하는 경우).\n가장자리가 갈색이 될 때까지 굽습니다(약 20분). 와이어 랙으로 옮기고 식힙니다.",
        "Image_Name": "lemon-lime-basil-shortbread-cookies-366434.jpg"
    },
    {
        "Title": "코코넛 쇼트브레드 크러스트가 들어간 레몬그라스 바",
        "Ingredients": "['다용도 밀가루 1 1/2컵', '달콤한 강판 코코넛 1컵(약 3온스)', '가루 설탕 1/2컵', '무염 버터 1/2컵 + 3큰술, 실온', '설탕 1 1/4컵', '레몬그라스 줄기 3개, 바닥 4인치만, 딱딱한 바깥층 제거, 잘게 다진 것(1/2컵 미만)', '신선한 레몬즙 5큰술', '큰 달걀 3개', '다용도 밀가루 1/4컵', '가루 설탕']",
        "Instructions": "오븐을 350°F로 예열합니다. 13 x 9 x 2인치 금속 베이킹 팬에 버터를 바릅니다. 전기 믹서를 사용하여 큰 그릇에 밀가루, 코코넛, 가루 설탕, 소금 1/2티스푼을 넣고 잘 섞일 때까지 30초 동안 치세요. 버터를 넣고 저속으로 습한 덩어리가 형성될 때까지 치세요. 반죽을 팬 바닥과 1/2인치 위 측면에 눌러 붙입니다. 크러스트가 노릇노릇해질 때까지 굽습니다(가장자리가 더 어두워질 것입니다), 약 25분.\n그동안 설탕과 레몬그라스를 프로세서에 넣고 레몬그라스가 잘 갈릴 때까지 펄스합니다(약 1분). 레몬즙을 넣고 잘 섞일 때까지 약 30초 동안 가공합니다. 계란을 넣고 10~15초 동안 가공합니다. 밀가루와 소금을 넣고 부드러워질 때까지 펄스합니다.\n오븐 온도를 325°F로 낮춥니다. 뜨거운 크러스트에 충전물을 붓고 충전물이 단단해질 때까지 굽습니다(22~23분). 랙에 팬을 올려 식힙니다.\n레몬그라스 바를 세로로 4조각으로 자른 다음 가로로 6조각으로 자릅니다. 바에 가루 설탕을 뿌리고 서빙합니다.",
        "Image_Name": "lemongrass-bars-with-coconut-shortbread-crust-364029.jpg"
    },
    {
        "Title": "크리스털 생강을 곁들인 커피 스파이스 쇼트브레드",
        "Ingredients": "['다용도 밀가루 2 3/컵', '진한 갈색 설탕 3/4컵(꽉 채운 것)', '커피콩 가루 2큰술과 2작은술', '생강 가루 2작은술', '계피 가루 1 1/2작은술', '카다멈 가루 1작은술', '소금 1/2작은술', '무염 버터 1컵(2스틱)을 1/2인치 크기로 잘라 냉장 보관', '가루 설탕 1/2컵', '물 2작은술(또는 그 이상)', '바닐라 추출물 1작은술', '다진 설탕 생강 6큰술', '바닥을 떼어낼 수 있는 직경 9인치 타르트 팬 2개']",
        "Instructions": "오븐의 상단 1/3에 랙 1개, 하단 1/3에 랙 1개를 놓고 325°F로 예열합니다. 밀가루, 황설탕, 커피 가루, 생강, 계피, 카다멈, 소금을 프로세서에 넣고 5초간 섞습니다. 버터를 넣고 켜고 끄는 방식으로 촉촉한 덩어리가 형성될 때까지 섞습니다. 반죽을 공 모양으로 모읍니다. 반죽을 지름 9인치의 두 개의 타르트 팬에 균등하게 나눕니다(바닥 분리 가능). 반죽을 각 타르트 팬 바닥에 단단하고 고르게 누릅니다.\n쇼트브레드를 25분간 굽습니다. 팬의 위치를 ​​반대로 바꾸고 쇼트브레드가 황금빛 갈색이 되고 가장자리는 단단하지만 중앙은 여전히 ​​약간 부드러워질 때까지 계속 굽습니다(약 20분 더 굽습니다). 팬에 있는 쇼트브레드를 5분간 식힙니다. 팬 측면을 제거합니다. 각 팬에 있는 따뜻한 쇼트브레드를 12조각으로 자릅니다. 완전히 식힙니다.\n작은 그릇에 가루 설탕, 물 2티스푼, 바닐라를 넣고 섞고, 필요한 경우 바를 수 있는 유약을 위해 물을 1/4티스푼 더 넣습니다. 오프셋 주걱을 사용하여 쿠키 위에 유약을 얇게 펴 바르고 가장자리에 1/2인치 테두리를 남겨둡니다. 결정화된 생강을 뿌립니다. 유약이 굳을 때까지 약 1시간 동안 그대로 둡니다. 미리 만들어 3주 전에 만들 수 있습니다. 냉동고에 밀폐하여 보관합니다. 서빙하기 전에 실온으로 맞춥니다.",
        "Image_Name": "coffee-spice-shortbread-with-crystallized-ginger-362592.jpg"
    },
    {
        "Title": "브라운 슈가 쇼트브레드",
        "Ingredients": "['무염 버터 1컵(2스틱), 실온', '밝은 갈색 설탕 또는 무스코바도 설탕 1/2컵', '다용도 밀가루 1 2/3컵', '옥수수 전분 1/3컵', '소금 한 꼬집']",
        "Instructions": "1. 오븐 중앙에 랙을 놓고 350도로 예열합니다. 9~9 1/2인치 스프링폼 팬에 가볍게 버터를 바릅니다.\n2. 중간 크기의 그릇에 버터를 넣고 전기 믹서기를 고속으로 설정하여 약 1분간 부드러워질 때까지 섞습니다. 설탕을 넣고 약 2분간 혼합물의 색상과 질감이 밝아질 때까지 섞습니다. 나무 숟가락을 사용하여 밀가루, 옥수수 전분, 소금을 넣고 저어줍니다. 반죽을 팬에 고르게 눌러 넣습니다. 포크의 갈래를 사용하여 반죽의 둘레를 누릅니다. 반죽을 팬 바닥까지 찔러 10개의 동일한 쐐기 모양으로 만듭니다.\n3. 약 30분간 가볍게 갈색이 될 때까지 굽습니다. 팬에서 완전히 식힙니다. 팬의 측면을 제거합니다. 반죽의 천공을 따라 쇼트브레드를 쐐기 모양으로 자릅니다. (쇼트브레드는 기밀 용기에 최대 5일까지 보관할 수 있습니다.)",
        "Image_Name": "brown-sugar-shortbread-361649.jpg"
    },
    {
        "Title": "초콜릿 토피 쇼트브레드 핑거",
        "Ingredients": "['1/2컵 토스트하고 식힌 피칸, 굵게 다진 것', '3/4컵 히스 비츠 '오 브리클 토피 비츠 또는 스코르 또는 히스 바, 굵게 다진 것', '1백(12온스) 비터스위트 또는 세미스위트 초콜릿 칩', '식물성 기름 1큰술', '4팩(각 8.8온스) 워커스 퓨어 버터 쇼트브레드 핑거']",
        "Instructions": "1. 양피지로 베이킹 시트 몇 장을 깔아줍니다. 얕은 그릇에 견과류와 토피 조각을 섞습니다.\n2. 작은 전자레인지용 그릇에 초콜릿과 오일을 섞습니다. 전자레인지의 강도에 따라 30초에서 1분 동안 초콜릿을 전자레인지에서 높은 온도로 가열하여 녹입니다. 부드러워질 때까지 저어줍니다. (또는 더블 보일러나 큰 냄비 바닥에 물을 1인치 깊이로 넣고 끓입니다. 초콜릿 칩과 오일을 더블 보일러 위나 냄비 위에 올려놓을 만큼 큰 스테인리스 스틸 그릇에 넣고 물에 닿지 않게 합니다. 가끔 휘저으며 초콜릿이 녹을 때까지 가열합니다.)\n3. 쿠키 한쪽 끝을 잡고 초콜릿에 담그고 뒤집어 쿠키의 3/4을 코팅합니다. 남은 것은 그릇에 다시 떨어뜨립니다. 쿠키를 견과류와 토피 조각 그릇 위에 올려놓고 혼합물 일부를 초콜릿으로 코팅된 쿠키 위와 옆면에 뿌립니다. 쿠키를 준비된 베이킹 시트에 놓습니다. 나머지 쿠키로 반복합니다. 초콜릿이 굳을 때까지 쿠키를 쉬게 두세요. 약 30분 정도.\n초콜릿 토피 쇼트브레드 핑거는 양피지 사이에 두고 밀폐 용기에 담아 실온에서 최대 1주일 동안 보관할 수 있습니다.\n피칸을 토스트하려면 기름을 바르지 않은 베이킹 시트에 한 겹으로 놓고 350°F 오븐에서 가끔 팬을 흔들면서 향이 날 때까지 5~10분간 굽습니다. 타지 않도록 주의 깊게 지켜보고 토스트한 견과류를 접시에 옮겨 식힙니다.",
        "Image_Name": "chocolate-toffee-shortbread-fingers-361429.jpg"
    },
    {
        "Title": "소금 메이플-카라멜 소스를 곁들인 메이플-진저브레드 레이어 케이크",
        "Ingredients": "['3/4컵 피칸 반쪽, 토스트', '1/4컵 순수 메이플 시럽(등급 B가 좋음)', '굵은 코셔 소금', '2 1/2컵 다용도 밀가루', '1 1/2티스푼 중국 오향분말', '1티스푼 베이킹 소다', '1/2티스푼 굵은 코셔 소금', '1/3컵 다진 결정화 생강(1 1/2~2온스)', '1컵 메이플 설탕', '3/4컵(1 1/2스틱) 무염 버터, 실온', '2개의 큰 달걀', '3/4컵 뜨거운 물', '2/3컵 순한 맛(라이트) 당밀', '1 1/3컵 냉장 크렘 프레쉬', '1 1/3컵 냉장 진한 휘핑크림', '1/2컵 메이플 설탕', '6큰술 가루 설탕', '소금 메이플 캐러멜 소스', '성분 정보: 중국 오향분말-보통 갈은 회향씨, 쓰촨 후추, 계피, 스타 아니스, 정향을 포함하는 향신료 블렌드-는 대부분 슈퍼마켓의 향신료 섹션에서 구입할 수 있습니다. 크렘 프레쉬는 대부분 슈퍼마켓과 특산 식품점에서 판매됩니다.']",
        "Instructions": "작업대에 큰 호일을 놓습니다. 무거운 중간 크기의 프라이팬(논스틱은 사용하지 마세요)에 견과류와 메이플 시럽을 넣고 중불에서 끓이며 코팅합니다. 시럽이 진한 호박색이 되고 거의 익어서 견과류에 두껍게 코팅될 때까지 3~3분 30초 동안 자주 저어줍니다. 견과류를 호일에 긁어냅니다. 포크 2개로 재빨리 작업하여 견과류를 분리합니다. 거친 소금을 뿌립니다. 코팅이 바삭바삭하고 딱딱해질 때까지 약 1시간 동안 식힙니다. 미리 준비: 피칸은 하루 전에 만들어둘 수 있습니다. 실온에서 밀폐하여 보관합니다.\n오븐을 350°F로 예열합니다. 1 1/2인치 높이의 측면이 있는 직경 9인치 케이크 팬 두 개에 버터와 밀가루를 바릅니다. 처음 네 가지 재료를 프로세서에 넣고 섞습니다. 생강을 넣습니다. 생강이 잘 갈릴 때까지 약 1분간 블렌딩합니다. 믹서를 사용하여 큰 그릇에 메이플 설탕과 버터를 넣고 부드러워질 때까지 휘핑합니다. 계란을 하나씩 넣고 휘핑합니다(반죽이 응고된 것처럼 보일 수 있음). 작은 그릇에 뜨거운 물 3/4컵과 당밀을 넣고 저어줍니다. 마른 재료를 버터 혼합물에 4번 넣고, 당밀 혼합물을 3번 넣고 번갈아가며 섞습니다.\n반죽을 준비한 팬에 나눠 넣습니다(각각 약 21/2컵). 중앙에 꽂은 테스터가 깨끗하게 나올 때까지 굽습니다(30~32분). 팬에 넣은 케이크를 랙에 올려 식힙니다.\n큰 그릇에 크렘 프레쉬, 크림, 두 가지 설탕을 섞습니다. 전기 믹서를 사용하여 매우 걸쭉하고 딱딱해질 때까지 치세요.\n팬 측면을 따라 자르고 케이크 층을 풀어서 랙에 놓습니다. 접시에 케이크 층 1개를 올립니다. 프로스팅 1 1/3컵을 바릅니다. 카라멜 소스 3큰술을 뿌립니다. 두 번째 케이크 층으로 덮습니다. 남은 프로스팅을 케이크 위와 옆에 매끈하게 바릅니다. 케이크 위에 소스 3큰술을 뿌립니다. 케이크 돔으로 덮습니다. 최소 1시간 동안 식힙니다. 미리 만들어두세요: 1일 전에 만들어도 됩니다. 냉장 보관하세요. 계속하기 전에 30분 동안 실온에 두십시오.\n피칸을 조각으로 자르거나 그대로 두십시오. 피칸을 케이크 옆면의 프로스팅에 눌러 넣으십시오. 케이크를 쐐기 모양으로 자릅니다. 숟가락으로 소스를 얹으십시오.",
        "Image_Name": "maple-gingerbread-layer-cake-with-salted-maple-caramel-sauce-361294.jpg"
    },
    {
        "Title": "루꼴라, 아스파라거스, 튀긴 계란을 곁들인 플랫브레드",
        "Ingredients": "['1컵(포장) 신선한 시금치(약 2온스)', '1컵(포장) 아루굴라 잎(약 2온스) + 추가(장식용)', '1/2컵 + 2큰술 엑스트라 버진 올리브 오일 + 추가(솔질용)', '마늘 4쪽, 굵게 다진 것', '1컵(또는 그 이상) 따뜻한 물(110°F~115°F), 나누어 담음', '꿀 1큰술', '활성 건조 효모 2 1/4온스 팩', '다용도 밀가루 3컵', '굵은 코셔 소금 1/4작은술', '옥수수 가루(뿌리기용)', '핑거링 감자 8온스, 익혀서 식힌 후 가로로 1/3인치 두께로 썬 것', '아스파라거스 8온스; 얇은 줄기를 1/2인치 조각으로 자름, 두꺼운 줄기를 1/4~1/3인치 조각으로 자름', '껍질을 벗긴 큰 옥수수 2개, 옥수수알은 이삭에서 자름', '신선한 완두콩 또는 냉동 완두콩 2/3컵, 해동', '리코타 치즈 3/4컵(물기를 빼지 않음)', '큰 달걀 8개', '파마산 치즈 shavings', '반죽 후크 부착물이 있는 고성능 스탠드 믹서']",
        "Instructions": "시금치를 전자레인지용 그릇에 넣습니다. 물을 뿌립니다. 시들 때까지 전자레인지를 돌립니다(약 20초). 물기를 빼고 시금치를 눌러 액체를 냅니다. 블렌더에 시금치, 아루굴라 1컵, 기름 1/2컵, 마늘을 넣습니다. 거친 퓌레가 될 때까지 섞습니다. 페스토를 작은 그릇에 옮깁니다. 소금과 후추로 간을 합니다. 미리 만들어 둡니다: 1일 전에 만들어 둘 수 있습니다. 덮고 식힙니다.\n작은 그릇에 따뜻한 물 1/4컵과 꿀을 넣고 저어줍니다. 효모를 넣고 저어줍니다. 거품이 날 때까지 약 10분간 그대로 둡니다. 반죽 후크 부착물이 달린 스탠드 믹서에 밀가루와 거친 소금을 넣습니다. 따뜻한 물 3/4컵과 효모 혼합물을 넣습니다. 반죽이 뭉쳐지고 그릇 옆면에서 떨어질 때까지 중간 속도로 섞습니다. 너무 건조하면 물을 큰술씩 더 넣어줍니다(약 2~3분). 큰 그릇에 기름을 바릅니다. 반죽을 공 모양으로 만듭니다. 그릇에 넣고 뒤집어서 코팅합니다. 비닐로 덮습니다. 따뜻하고 통풍이 잘되는 곳에 두어 부피가 두 배가 될 때까지 약 1시간 동안 둡니다.\n피자 스톤이나 베이킹 시트를 오븐에 넣습니다(테두리 있는 베이킹 시트를 사용하는 경우, 시트를 뒤집어서 테가 아래로 향하게 합니다). 오븐을 500°F로 예열합니다. 그릇에 반죽을 반죽합니다. 덮고 부피가 두 배가 될 때까지 약 45분간 다시 팽창시킵니다. 반죽을 4등분합니다. 각 부분을 공 모양으로 만듭니다. 밀가루를 뿌린 작업대에 놓습니다. 비닐 랩으로 덮고 10분간 쉬게 합니다.\n테두리 없는 베이킹 시트에 콘밀을 뿌립니다. 한 번에 공 1개씩 작업하면서 밀가루를 뿌린 작업대에서 반죽을 12x7인치 타원형으로 펼칩니다. 시트로 옮깁니다. 반죽 위에 페스토 2큰술을 펴 바르고 1/2인치의 평평한 테두리를 남겨둡니다. 페스토 위에 감자 1/4, 아스파라거스 1/4, 옥수수 1/4, 완두콩 1/4을 뿌립니다. 야채 위에 리코타 치즈 1큰술을 3숟가락 얹습니다. 피자를 스톤에 밀어 넣고 바닥과 가장자리가 황금빛 갈색이 될 때까지 굽습니다(10~12분).\n그 사이에 논스틱 프라이팬에 기름을 바르고 중불로 가열합니다. 프라이팬에 계란 2개를 깨서 넣고 흰자는 굳고 노른자는 아직 흐를 때까지 약 3분간 조리합니다.\n피자를 작업대에 옮깁니다. 피자 위에 튀긴 계란 2개를 올립니다. 얇게 썬 파마산 치즈와 아루굴라 잎을 뿌립니다. 피자를 쐐기 모양으로 자르고 서빙합니다. 남은 반죽, 페스토, 감자, 아스파라거스, 옥수수, 완두콩, 리코타, 계란으로 반복합니다.",
        "Image_Name": "flatbread-with-arugula-asparagus-and-fried-eggs-360754.jpg"
    },
    {
        "Title": "베이컨 크러스트를 곁들인 콘브레드",
        "Ingredients": "['두껍게 썬 베이컨 슬라이스 10개', '중간 크기의 옥수수가루 1 1/2컵', '다용도 밀가루 1 1/2컵', '황금빛 갈색 설탕 3큰술', '베이킹파우더 1큰술', '소금 1작은술', '전유 1 2/3컵', '큰 달걀 3개', '꿀이나 아가베 시럽 3큰술', '무염 버터 2큰술(녹인 것)', '냉동 옥수수 알갱이 2컵(해동되지 않은 것)']",
        "Instructions": "베이컨을 중불로 큰 프라이팬에 넣고 바삭해질 때까지 굽습니다. 종이 타월에 물기를 빼세요. 프라이팬에서 떨어진 기름 2큰술을 따로 보관하세요. 베이컨을 잘게 부수세요.\n오븐을 350°F로 예열하세요. 12인치 직경의 내열 프라이팬에 베이컨 기름을 묻힙니다. 큰 그릇에 콘밀과 다음 4가지 재료를 넣고 휘젓습니다. 중간 크기의 그릇에 우유, 계란, 꿀, 버터를 넣고 휘젓습니다. 우유 혼합물을 마른 재료에 넣고 저어줍니다. 옥수수를 넣고 섞습니다.\n준비된 프라이팬을 오븐에 넣고 약 10분간 매우 뜨거워질 때까지 굽습니다. 프라이팬에 반죽을 붓습니다. 베이컨을 뿌립니다. 콘브레드가 노릇노릇해지고 중앙에 꽂은 테스터가 깨끗하게 나올 때까지 약 50분간 굽습니다. 프라이팬에서 최소 30분간 식힙니다. 프라이팬에서 콘브레드를 바로 제공합니다. 미리 만들어두세요: 8시간 전에 만들어둘 수 있습니다. 원하시면 350°F 오븐에서 뚜껑을 열고 10~15분간 다시 데워주세요.",
        "Image_Name": "cornbread-with-bacon-crust-355804.jpg"
    },
    {
        "Title": "염소 치즈와 머스타드 크림을 곁들인 스파이스 배 플랫브레드",
        "Ingredients": "['휘핑크림 6큰술', '통밀 디종 머스타드 3큰술', '디종 머스타드 1 1/2큰술', '신선한 레몬즙 1큰술', '꿀이나 아가베 시럽 1/2작은술', '빵가루 2 1/4컵', '따뜻한 물 1컵과 7큰술(115°F~120°F)', '다용도 밀가루 3/4컵', '통밀가루 1/3컵', '올리브 오일 2큰술', '고운 바닷소금 2작은술', '꿀 1/2작은술', '빠르게 부풀어 오르는 활성 건조효모 1/4작은술', '단단하지만 익은 보스크 배 2개, 세로로 반으로 자르고 씨 제거', '올리브 오일', '굵게 갈은 에스펠레트 피망, 알레포 고추 또는 카이엔 고추', '고운 바닷소금', '아루굴라 아기 5컵(약 4 온스)', '8온스 굵게 부순 블루 염소 치즈(블루에 또는 파이어플라이 팜 블랙 앤 블루 등)', '피자 스톤']",
        "Instructions": "모든 재료를 작은 그릇에 넣고 휘젓습니다. 소금과 후추로 간을 합니다. 미리 만들어 두세요: 1일 전에 만들어 두어도 됩니다. 덮고 식힙니다. 사용하기 전에 실온으로 맞춥니다.\n모든 재료를 반죽 후크가 달린 중장비 믹서 그릇에 넣고 섞습니다. 반죽이 형성되고 그릇 옆면에서 떨어질 때까지 약 2분간 저속으로 치세요. 후크에서 반죽을 긁어냅니다. 그릇을 비닐 랩으로 덮습니다. 반죽을 30분간 쉬게 합니다.\n반죽 후크를 깨끗이 닦고 다시 붙입니다. 반죽을 중간 속도로 3분간 치세요. 후크에 있는 반죽을 그릇에 긁어 넣습니다. 그릇을 비닐 랩과 수건으로 덮습니다. 반죽이 가볍고 약간 부풀어 오를 때까지 약 1시간 동안 두세요. 반죽을 부드럽게 반죽하여 공기를 빼세요. 밀가루를 묻힌 손으로 끈적끈적한 반죽을 4등분합니다. 각각을 공 모양으로 만들고 비닐이 깔린 베이킹 시트에 놓습니다. 덮고 최소 45분간 식힙니다. 미리 만들어 두세요: 8시간 전에 만들어 두어도 됩니다. 냉장 보관합니다. 사용하기 전에 실온으로 맞춥니다.\n배를 세로로 반으로 자르고 두께가 1/4인치로 매우 얇게 썬다. 양쪽에 기름을 바르고 에스펠렛 후추를 뿌립니다. 호일에 배열합니다. 피자 스톤을 사용하는 경우 오븐에 넣습니다. (또는 무거운 큰 베이킹 시트를 뒤집어서 오븐에 넣습니다.) 오븐을 500°F로 최소 45분 동안 예열합니다.\n가볍게 밀가루를 뿌린 작업대에서 각 반죽 공을 늘리고 9인치 원형으로 굴립니다. 밀가루를 뿌린 피자 껍질이나 림리스 베이킹 시트에 반죽 원형 1개를 놓습니다. 반죽에 기름을 바르고 바다 소금과 에스펠렛 후추를 뿌립니다. 아루굴라 1/4을 뿌립니다. 기름을 가볍게 뿌립니다. 배 조각과 치즈 1/4을 얹습니다.\n플랫브레드를 뜨거운 피자 스톤이나 베이킹 시트에 밀어 넣습니다. 가끔씩 돌려가며 껍질이 황금빛 갈색이 되고 바삭해지고 치즈가 녹을 때까지 굽습니다(10~11분). 나머지 플랫브레드에도 반복합니다. 플랫브레드를 접시에 옮깁니다. 머스타드 크림을 뿌리고 서빙합니다.",
        "Image_Name": "spiced-pear-flatbreads-with-goat-cheese-and-mustard-cream-354834.jpg"
    },
    {
        "Title": "진저브레드 바",
        "Ingredients": "['다용도 밀가루 2컵', '생강가루 2티스푼', '계피가루 1티스푼', '육두구가루 1/4티스푼', '정향가루 1/4티스푼', '베이킹소다 1/2티스푼', '소금 1/2티스푼', '무염 버터 10큰술(1 1/4스틱), 실온', '진한 갈색 설탕 3/4컵(꽉 채운 것)', '설탕 7 1/2큰술(나누어 담음)', '큰 달걀 2개', '황화되지 않은 가벼운 당밀 1/4컵']",
        "Instructions": "오븐을 350°F로 예열합니다. 15x10x1인치 베이킹 시트에 버터와 밀가루를 바릅니다. 중간 크기의 그릇에 밀가루 2컵을 넣습니다. 밀가루 2큰술을 작은 그릇에 옮겨 따로 보관합니다. 중간 크기의 그릇에 밀가루에 향신료, 베이킹 소다, 소금을 넣고 휘저어 섞습니다. 전기 믹서를 사용하여 큰 그릇에 버터, 황설탕, 설탕 6큰술을 넣고 부드러워질 때까지 섞습니다. 계란을 하나씩 넣고 당밀을 넣습니다. 버터 혼합물에 건조 재료를 넣고 휘저어 섞습니다. 준비된 팬에 반죽을 고르게 펴 바릅니다. 따로 보관한 밀가루 2큰술을 반죽 위에 고르게 체로 걸러 낸 다음 남은 설탕 1 1/2큰술을 고르게 뿌립니다.\n진저브레드를 황금색이 될 때까지 굽고 중앙에 꽂은 테스터가 깨끗하게 나올 때까지 약 22분간 굽습니다. 팬에 올려 완전히 식힙니다. 진저브레드를 가로로 4개의 조각으로 자른 다음 각 조각을 6조각으로 자르고 각각 약 31/2x13/4인치 크기의 막대 24개를 만듭니다. 미리 준비하세요: _2일 전에 미리 만들어 놓을 수 있습니다._실온에서 밀폐하여 보관하세요.",
        "Image_Name": "gingerbread-bars-353838.jpg"
    },
    {
        "Title": "밀 비스킷 쇼트브레드",
        "Ingredients": "['무염 버터 2개(실온)', '과립 설탕 2/3컵', '바닐라 추출물 2티스푼', '고운 소금 1/2티스푼', '표백되지 않은 다용도 밀가루 1 1/4컵', '흰 통밀가루 1컵', '세미스위트 초콜릿 8온스']",
        "Instructions": "오븐의 위쪽과 아래쪽 1/3에 랙을 배치하고 오븐을 325°F로 예열합니다. 큰 쿠키 시트 2개와 양피지 또는 실리콘 시트를 깔아줍니다.\n큰 그릇에 버터, 설탕, 바닐라, 소금을 중저속으로 부드러워질 때까지 섞습니다. 밀가루를 넣고 완전히 섞일 때까지 섞습니다. 반죽을 반으로 나눈 다음 너무 많이 다루지 않고 두 개의 원반 모양으로 만듭니다.\n가볍게 밀가루를 뿌린 표면에서 반죽 1개를 13인치, 1/4인치 두께의 정사각형으로 펼칩니다. 자와 플루트 페이스트리 휠 또는 큰 칼을 사용하여 가장자리를 다듬고 2 x 1인치 직사각형으로 자릅니다. 쿠키를 베이킹 시트에 1 1/2인치 간격으로 옮깁니다. 조각을 다시 굴리고 나머지 반죽으로 반복합니다. 각 쿠키에 포크로 여러 번 표시한 다음 팬을 냉장고에 10분간 식힙니다. 쿠키를 약 17분 동안 구워서 중앙이 노릇노릇해지고 거의 단단해질 때까지 굽습니다. 베이킹 시트에 5분간 식힌 후 랙에 옮겨 완전히 식힙니다.\n세미스위트 초콜릿을 잘게 다집니다. 내열성 그릇에 초콜릿의 절반을 넣고 끓는 물 1인치가 담긴 냄비 위에 올려놓고 초콜릿이 녹고 매끄러워질 때까지 저어줍니다. 나머지 초콜릿을 그릇에 넣습니다. 그릇을 냄비에서 꺼내 접은 수건 위에 놓습니다. 초콜릿이 매끄러워질 때까지 가끔 저어줍니다. 초콜릿을 작은 그릇에 긁어 담습니다. 베이킹 시트에 깨끗한 양피지나 왁스 종이를 깔아줍니다. 쿠키를 초콜릿에 반쯤 담그고, 남은 것을 떨어뜨린 다음 종이로 깔아준 시트에 올려놓습니다. 굳고 마를 때까지 최소 1시간 동안 그대로 둡니다.",
        "Image_Name": "wheat-biscuit-shortbread-243132.jpg"
    },
    {
        "Title": "알제리 플랫브레드",
        "Ingredients": "['통밀가루 3컵(인도 아타 또는 킹아서 통밀가루가 좋음)', '소금 1티스푼', '올리브 오일 1/2컵(나누어 사용)', '물 1 1/2컵', '가루 쿠민 1티스푼', '달콤한 파프리카 1티스푼', '강황 1티스푼']",
        "Instructions": "큰 그릇에 밀가루, 소금, 기름 2큰술을 넣고 섞는다. 부드러운 반죽이 될 때까지 물을 천천히 넣고 섞는다. 필요하다면 물을 한 번에 1큰술씩 더 넣는다. 가볍게 밀가루를 뿌린 표면에 반죽을 꺼내 반죽하고, 반죽이 달라붙지 않을 만큼만 밀가루를 뿌리고 매끄럽고 탄력이 생길 때까지 약 15분간 반죽한다.\n반죽을 공 모양으로 만들고 그릇에 기름 2큰술을 바른다. 그릇을 비닐 랩으로 덮고 반죽을 따뜻한 실온에서 1시간 둔다.\n작은 그릇에 커민, 파프리카, 강황, 남은 기름 1/4컵을 넣고 섞는다.\n반죽을 12개로 나누고, 남은 조각은 비닐 랩으로 덮은 채로 반죽 한 조각을 디스크 모양으로 편다. 가볍게 밀가루를 뿌린 표면에 6인치 나무 막대나 밀대를 사용하여 디스크를 가능한 한 얇게(9인치 원형으로) 펼친다. 손가락 끝으로 반죽에 향신료 오일 1티스푼을 바른 다음, 긴 원통 모양으로 단단히 말아서 단단한 나선형으로 감습니다. 큰 양피지로 옮긴 다음, 비닐 랩으로 느슨하게 덮습니다.\n같은 방식으로 나선형을 11개 더 만듭니다.\n작업대에 양피지를 한 장 더 붙이고 그 위에 반죽 나선형 1개를 지름이 약 6인치인 원형으로 펼칩니다. 중불로 건조한 대형 주철 프라이팬이나 프라이팬을 뜨거워질 때까지 가열한 다음, 납작빵을 한 번 뒤집어서 부풀어 오르고 반점이 갈색이 될 때까지 굽습니다. 총 3~4분 동안 굽습니다. 접시에 옮기고 주방 타월로 덮습니다. 납작빵을 11개 더 펴서 굽고 접시에 쌓습니다.\nCape Mentelle Margaret River Chardonnay '05",
        "Image_Name": "algerian-flatbread-241505.jpg"
    },
    {
        "Title": "새우와 흰콩 후무스를 곁들인 플랫브레드",
        "Ingredients": "['따뜻한 물 1 1/4컵(105°F~115°F)', '활성 건조 효모 1티스푼', '설탕 1티스푼', '다용도 밀가루 3컵', '코셔 소금 1 1/2티스푼', '엑스트라 버진 올리브 오일 2테이블스푼', '껍질을 벗기지 않은 마늘 5~6쪽', '엑스트라 버진 올리브 오일 1테이블스푼', '코셔 소금 1 1/8티스푼', '흰콩 1캔(15온스), 헹구고 물기를 뺀 것', '식초 2테이블스푼', '신선한 레몬즙 2티스푼', '타히니 1테이블스푼', '신선한 로즈마리 1티스푼, 잘게 다진 것', '무염 버터 2티스푼', '중간 크기 스페인 양파 2개, 중간 크기로 다진 것', '설탕 1 1/2티스푼', '코셔 소금 1/4티스푼', '갓 갈은 후추 1/4티스푼', '엑스트라 버진 올리브 오일 2큰술', '부추 4개(흰 부분과 연한 녹색 부분만), 씻어서 중간 크기로 자름', '코셔 소금 1/4티스푼', '갓 갈은 후추 1/4티스푼', '플랫브레드에 바르는 엑스트라 버진 올리브 오일 1큰술', '레몬 1개, 세로로 반으로 자르고 아주 얇게 썬 것', '작은 달콤한 새우 1파운드(예: 캐리비안 래핑 버드*), 껍질을 벗기고 익힌 것', '그라나 파다노 또는 파르미지아노 레지아노 치즈 6온스, 잘게 갈은 것(약 1 ½컵)', '코셔 소금 3/4티스푼', '신선한 레몬즙 1 1/2티스푼', '혼합 마이크로 그린(예: 아루굴라) 3/4컵', \"*작고 풍미가 가득한 캐리비안 래핑 버드 새우는 벨리즈 해안에서 지속 가능하게 양식됩니다. 이용할 수 없다면, 맛은 비슷하지만 환경 친화적이지 않은 바위 새우로 대체할 수 있습니다. 아니면, 큰 새우라면 조각으로 자른 달콤한 새우를 사용하세요.\", '패들 부착물과 반죽 후크가 달린 스탠드 믹서, 파스타 머신이나 롤링 핀, 피자 스톤이나 두꺼운 베이킹 시트, 푸드 프로세서']",
        "Instructions": "스탠드 믹서의 패들 부착물을 장착한 그릇에 물, 효모, 설탕을 녹을 때까지 약 5초간 저어줍니다. 거품이 날 때까지 약 5분간 그대로 둡니다. 큰 그릇에 밀가루와 소금을 넣고 휘젓습니다. 효모 혼합물에 넣고 약 30초간 저속으로 섞습니다. 기름을 넣고 약 30초간 저속으로 섞습니다. 반죽 고리로 바꾸고 반죽이 탄력이 있고 측면에서 떨어질 때까지 중속으로 섞습니다. 약 8분. (반죽은 단단하고 촉촉해야 하지만 끈적거리지 않아야 합니다.)\n큰 그릇에 가볍게 기름을 바릅니다. 반죽을 부드럽게 공 모양으로 빚어 그릇에 옮깁니다. 여러 번 뒤집어 기름을 살짝 바른 다음 비닐 랩으로 덮고 따뜻한 곳(80°F~85°F, 셰프 노트 참조)에서 크기가 두 배가 될 때까지 약 1시간 동안 팽창시킵니다.\n반죽이 팽창하는 동안 오븐 바닥 근처에 랙을 놓고 피자 스톤이나 두꺼운 베이킹 시트를 올려놓습니다. 오븐을 450°F로 1시간 동안 예열합니다.\n파스타 머신의 매끄러운 롤러를 가장 넓은 설정으로 설정합니다(셰프 노트 참조). 반죽을 6등분합니다. 5등분한 부분을 비닐 랩으로 덮습니다. 남은 조각을 거친 직사각형 모양으로 만들고 롤러에 한 번 통과시켜 약 12x4인치 직사각형, 두께 약 1/8인치로 납작하게 만듭니다. 플랫브레드를 큰 베이킹 시트에 옮기고 밀가루를 뿌리고 양피지를 얹습니다. 나머지 플랫브레드도 같은 방식으로 펴서 양피지 사이에 쌓습니다. 구울 준비가 될 때까지 비닐 랩으로 덮습니다.\n1개 이상의 플랫브레드를 예열된 피자 스톤에 옮기고 약 5분 동안 약간 부풀어 오르지만 여전히 창백해질 때까지 배치별로 굽습니다. 와이어 랙으로 옮겨 완전히 식힙니다. 오븐을 켜둡니다. 미리 준비: 플랫브레드는 미리 준비하여 냉동하고 양피지와 비닐 랩으로 단단히 싸서 최대 6개월까지 보관할 수 있습니다.\n마늘을 6인치 정사각형 호일에 옮기고 올리브 오일 1티스푼을 뿌리고 소금 1/8티스푼을 뿌린 다음 단단히 포장합니다. 약 45분 동안 부드러워질 때까지 굽습니다. 포장을 풀고 식힙니다. 미리 준비: 구운 마늘은 미리 준비하여 밀폐 용기에 담아 냉장 보관하면 최대 3일까지 보관할 수 있습니다.\n마늘을 껍질에서 짜서 푸드 프로세서에 넣습니다. 흰콩, 남은 올리브 오일 2티스푼, 식초, 레몬즙, 타히니, 로즈마리, 남은 소금 1티스푼을 넣고 약 2분간 부드러워질 때까지 퓌레합니다. 미리 준비: 후무스는 미리 준비하여 밀폐 용기에 담아 냉장 보관하면 최대 3일까지 보관할 수 있습니다.\n크고 무거운 냄비에 적당히 약한 불로 버터를 녹입니다. 양파를 넣고 가끔 저어주면서 약간 투명해지고 부드러워질 때까지 약 2분간 볶습니다. 설탕과 물 4티스푼을 넣고 가끔 저어주며 황금빛 갈색이 될 때까지 12분간 볶습니다. 소금과 후추를 넣고 저은 다음 중간 크기의 그릇에 옮겨 식힙니다. 미리 준비: 양파는 미리 준비해서 밀폐 용기에 담아 냉장 보관하면 최대 3일까지 보관할 수 있습니다.\n크고 무거운 냄비에 중불로 올리브 오일을 데웁니다. 부추를 넣고 가끔 저어주며 부드럽고 반투명해질 때까지 약 8분간 볶습니다. 소금과 후추를 넣고 저은 다음 중간 크기의 그릇에 옮겨 식힙니다. 미리 준비: 부추는 미리 준비해서 밀폐 용기에 담아 냉장 보관하면 최대 3일까지 보관할 수 있습니다.\n랙을 오븐 바닥 근처에 놓고 피자 스톤이나 두꺼운 베이킹 시트를 올려놓습니다. 오븐을 450°F로 1시간 예열합니다.\n각 플랫브레드에 올리브 오일을 바르고 후무스를 바릅니다. 양파와 부추를 뿌리고 레몬 조각과 새우를 올립니다. 치즈를 뿌리고 소금과 레몬즙을 뿌립니다.\n1개 이상의 플랫브레드를 예열된 피자 스톤에 옮기고 토핑이 데워지고 치즈가 녹을 때까지 6~8분 동안 배치별로 굽습니다.\n플랫브레드를 큰 도마에 옮기고 마이크로 그린을 얹습니다. 매우 날카로운 칼을 사용하여 6개의 얇은 조각으로 자르고 즉시 제공합니다.",
        "Image_Name": "flatbread-with-shrimp-and-white-bean-hummus-351889.jpg"
    },
    {
        "Title": "핑거링 감자, 시타케 버섯, 트러플 오일을 곁들인 플랫브레드",
        "Ingredients": "['따뜻한 물 1컵(105~115° F)', '활성 건조 효모 1 1/4티스푼', '설탕 1티스푼', '분유 가루 1큰술 + 1티스푼', '다용도 밀가루 1 3/4컵', '코셔 소금 1/2티스푼', '4개(너비 약 1인치, 길이 3인치) 핑거링 감자', '신선한 타임 4가지 + 신선한 타임 잎 2티스푼', '마늘 1쪽, 껍질을 벗기고 칼등으로 으깬다', '코셔 소금 2 1/2티스푼', '카놀라유 1큰술', '무염 버터 1큰술', '신선한 시타케 버섯 2컵(4온스), 줄기를 제거하고 얇게 썬다', '샬롯 1/4컵, 다진 것(중간 크기 샬롯 2개에서)', '3/4티스푼 [갓 빻은 검은 후추], [엑스트라 버진 올리브 오일 2티스푼], [화이트 트러플 오일 1/4컵], [크렘 프레쉬 1/2컵], [신선한 파 2큰술, 다진 것], [패들 부착물과 반죽 후크가 달린 스탠드 믹서, 두꺼운 베이킹 시트]",
        "Instructions": "스탠드 믹서의 그릇에 패들 어태치먼트를 장착하고 물, 효모, 설탕을 약 5초간 녹을 때까지 저어줍니다. 분유를 약 5초간 녹을 때까지 저어줍니다.\n큰 그릇에 밀가루와 소금을 넣고 휘젓습니다. 효모 혼합물에 넣고 저속으로 섞어서 완전히 섞일 때까지 약 30초간 섞습니다. 반죽 고리로 바꾸고 반죽이 탄력이 있지만 여전히 끈적거릴 때까지 중속으로 섞습니다(약 10분).\n식물성 기름을 사용하여 큰 그릇에 가볍게 기름을 바릅니다. 반죽을 부드럽게 공 모양으로 빚어 그릇에 옮깁니다. 기름을 가볍게 바르기 위해 여러 번 뒤집은 다음, 비닐 랩으로 덮고 따뜻한 곳(75°F~80°F, 셰프 노트 참조)에서 크기가 두 배가 될 때까지 팽창시킵니다(약 1시간 30분).\n식물성 기름을 사용하여 두꺼운 베이킹 시트에 기름을 넉넉히 바릅니다. 손으로 반죽을 그릇에서 들어 올리고 부드럽게 여러 번 뒤집어서 여분의 공기를 제거합니다. 공 모양으로 빚어 준비된 베이킹 시트에 옮깁니다. 비닐 랩으로 덮고 따뜻한 곳(75°F~80°F, 셰프 노트 참조)에서 30분간 팽창시킵니다.\n손가락 끝을 이용해 반죽을 베이킹 시트 가장자리에 눌러 펴 바릅니다. (반죽이 찢어지면 주변 반죽을 눌러 구멍을 메웁니다. 비닐 랩으로 덮고 따뜻한 곳(75°F~80°F, 요리사 노트 참조)에서 부풀어 오를 때까지 약 1시간 30분 동안 발효시킵니다.\n오븐을 475°F로 예열합니다.\n중간 크기의 냄비에 중간 정도의 강한 불로 감자, 타임 4가지, 마늘, 소금, 1인치 정도 덮일 만큼의 물을 넣습니다. 끓인 다음 불을 중간 정도로 줄이고 뚜껑을 열어두고 감자에 포크로 쉽게 찔릴 때까지 약 20분간 끓입니다. 타임과 마늘을 버리고 바로 물기를 뺍니다. 손으로 만질 수 있을 만큼 식으면 감자를 1/4인치 두께로 썰어 따로 보관합니다. (감자는 미리 준비해서 냉장 보관할 수 있으며, 최대 24시간까지 보관할 수 있습니다.)\n중간 크기의 소테 팬에 중간 정도의 강한 불로 캐놀라유와 버터를 뜨거워질 때까지 가열하지만 연기가 나지 않게 합니다. 버섯을 넣고 1분간 볶습니다. 샬롯을 넣고 약 2분간 연한 황금빛 갈색이 되고 부드러워질 때까지 볶습니다. 소금 1/2티스푼과 후추 1/4티스푼을 넣고 저은 다음, 종이 타월이 깔린 접시에 옮겨서 따로 보관합니다. (버섯은 미리 만들어서 냉장고에 넣고 덮어서 최대 24시간 보관할 수 있습니다.)\n플랫브레드에 감자 조각을 얹은 다음 올리브 오일을 바르고 타임 잎을 뿌립니다. 버섯 혼합물을 위에 펴 바르고 흰 트러플 오일 2큰술을 뿌리고 소금 1티스푼과 후추 1/2티스푼을 뿌립니다. 굽고, 중간에 팬을 180도 돌려서 빵 껍질이 연한 황금빛 갈색이 될 때까지 20~22분간 굽습니다.\n플랫브레드를 굽는 동안 작은 그릇에 크렘 프레쉬와 남은 트러플 오일 2큰술을 함께 휘젓습니다.\n플랫브레드를 큰 도마에 옮겨 약 5분간 식힙니다. 트러플 오일이 주입된 크렘 프레를 뿌리고 파를 뿌립니다. 피자 휠이나 매우 날카로운 칼을 사용하여 조각으로 자르고 즉시 제공합니다.",
        "Image_Name": "flatbread-with-fingerling-potatoes-shitake-mushrooms-and-truffle-oil-351233.jpg"
    },
    {
        "Title": "진저브레드 엔젤스",
        "Ingredients": "['다용도 밀가루 6컵', '생강가루 1큰술', '계피가루 1큰술', '베이킹소다 2작은술', '소금 1작은술', '굵게 다진 결정화된 생강 1/2컵(약 3온스)', '무염 버터 1컵(2스틱), 실온', '설탕 1컵', '황금빛 갈색 설탕 1/2컵(꽉 채운)', '큰 달걀 2개', '연한 맛(라이트) 당밀 1/4컵', '신선한 오렌지 주스 1/4컵', '잘게 갈은 오렌지 껍질 2작은술', '달걀 흰자 1개, 물 1큰술과 함께 푼 것(유약용, 선택 사항)', '원당 및/또는 유색 설탕(선택 사항)']",
        "Instructions": "큰 그릇에 밀가루, 생강가루, 계피, 소다, 소금을 넣고 휘젓습니다. 미니 프로세서에 결정화된 생강을 넣고, 밀가루 혼합물 1큰술을 넣고 생강이 아주 잘게 다질 때까지 섞습니다. 전기 믹서를 사용하여 다른 큰 그릇에 버터를 넣고 부드러워질 때까지 섞습니다. 설탕 1컵과 황설탕 1/2컵을 넣고 가볍고 부드러워질 때까지 섞습니다. 계란을 하나씩 넣고 섞습니다. 당밀, 오렌지 주스, 오렌지 껍질을 넣고 섞습니다(반죽이 응고된 것처럼 보일 수 있음). 결정화된 생강 혼합물을 넣고 섞습니다. 남은 밀가루-향신료 혼합물을 넣고 섞습니다. 반죽을 모읍니다. 원반 모양으로 납작하게 펴줍니다. 비닐에 싸서 최소 4시간 동안 냉장합니다.\n오븐의 상단 1/3에 랙 1개, 하단 1/3에 랙 1개를 놓습니다. 350°F로 예열합니다. 베이킹 시트 2개에 양피지를 깔아줍니다. 반죽을 4등분하여 각각 둥글게 만듭니다. 3개를 냉장합니다. 남은 반죽을 밀가루를 뿌린 작업대 위에 1/8인치 두께로 둥글게 펴줍니다. 밀가루를 뿌린 천사 모양 쿠키 커터를 사용하여 쿠키를 잘라냅니다. 반죽 조각을 모아서 1/8인치 두께로 다시 펴고 쿠키를 더 잘라냅니다. 주걱을 사용하여 쿠키를 1인치 간격으로 시트에 옮깁니다. 쿠키에 유약을 바르고 원하는 경우 원당 및/또는 색 설탕을 뿌립니다.\n쿠키가 노릇노릇해질 때까지 굽고, 7분 후 시트를 뒤집어서 총 14분 정도 굽습니다. 2분간 그대로 두었다가 랙에 옮겨 식힙니다. 나머지 반죽으로 반복하고 배치 사이에 베이킹 시트를 식힙니다. 미리 준비: 1주일 전에 만들어도 됩니다. 밀폐 용기에 왁스 종이 시트 사이에 보관합니다.",
        "Image_Name": "gingerbread-angels-350818.jpg"
    },
    {
        "Title": "시나몬 피칸 쇼트브레드",
        "Ingredients": "['다용도 밀가루 2컵', '설탕 1/4컵', '황금빛 갈색 설탕 1/4컵', '옥수수 전분 1/4컵', '계피 가루 1 1/4티스푼', '소금 1/4티스푼', '무염 버터 1컵(2스틱), 1/2인치 입방체로 자름, 실온', '큰 달걀 흰자 1개, 물 1큰술(유약용)과 섞어서 섞음', '웨지용 다진 구운 피칸 1 1/2컵 또는 둥근 쿠키용 피칸 반쪽 36개', '원당*']",
        "Instructions": "큰 그릇에 처음 6가지 재료를 넣고 섞습니다. 버터를 넣습니다. 포크 뒤쪽으로 굵은 가루가 될 때까지 으깨줍니다. 손가락 끝을 사용하여 반죽이 부드러워질 때까지 반죽을 섞고, 원반 모양으로 만듭니다. 비닐로 싸서 단단해질 때까지 냉장합니다(약 30분).\n오븐 중앙에 랙을 놓습니다. 325°F로 예열합니다. 웨지 모양의 경우 반죽을 2개의 원반 모양으로 만듭니다. 두꺼운 베이킹 시트 2개에 올려놓고 비닐로 덮습니다. 10인치 크기로 납작하게 만듭니다. 비닐을 제거합니다. 유약을 바릅니다. 다진 피칸을 뿌린 다음, 설탕을 뿌려서 붙입니다. 둥근 쿠키의 경우 반죽을 1인치 크기의 공 모양으로 만듭니다. 두꺼운 베이킹 시트 2개에 2인치 간격으로 놓습니다. 바닥이 매끈한 유리잔을 비닐로 덮습니다. 유리잔을 사용하여 각 반죽 공을 2인치 크기로 누릅니다. 원하는 경우, 스캘럽 쿠키 커터로 자릅니다. 유약을 바릅니다. 피칸 반쪽을 위에 올리고 설탕을 뿌립니다.\n쿠키를 한 번에 한 장씩 황금색이 될 때까지 굽습니다. 큰 쿠키는 약 30분, 작은 쿠키는 약 22분 정도 걸립니다. 큰 쿠키는 시트에 10분간 식힌 다음 각각 16조각으로 자릅니다. 모든 쿠키를 시트에 완전히 식힙니다. 미리 준비: 3일 전에 만들어도 됩니다. 실온에서 밀폐하여 보관합니다.\n*터비나도 또는 데메라라 설탕이라고도 합니다. 대부분 슈퍼마켓과 천연 식품점에서 판매합니다.",
        "Image_Name": "cinnamon-pecan-shortbread-350831.jpg"
    },
    {
        "Title": "다크 진저브레드 배 케이크",
        "Ingredients": "['다용도 밀가루 1 1/2컵', '베이킹소다 1티스푼', '계피 1/2티스푼', '올스파이스 가루 1/8티스푼', '소금 1/4티스푼', '무염 버터 1스틱', '물 1/4컵', '진한 흑설탕 1/2컵', '당밀(강력한 설탕이나 블랙스트랩 설탕은 불가) 1/2컵', '큰 달걀 3개', '껍질을 벗긴 강판 생강 1/4컵', '보스크 배 1개', '반주: 휘핑크림']",
        "Instructions": "오븐을 350°F로 예열하고 랙을 가운데에 놓습니다. 9인치 케이크 팬에 버터와 밀가루를 바르고, 여분의 밀가루를 털어냅니다.\n밀가루, 베이킹 소다, 계피, 올스파이스, 소금을 함께 휘젓습니다.\n버터를 물에 녹입니다.\n전기 믹서로 황설탕과 당밀을 잘 섞일 때까지 섞습니다. 계란을 하나씩 넣고 잘 섞습니다. 밀가루 혼합물을 저속으로 넣고 잘 섞일 때까지 섞습니다. 버터 혼합물과 생강을 넣고 부드러워질 때까지 섞습니다. 케이크 팬에 붓습니다.\n배를 껍질을 벗기고 3/4인치 조각으로 자릅니다. 반죽 위에 뿌립니다. 중앙에 꽂은 나무 꼬치가 깨끗하게 나올 때까지 굽습니다(약 35분). 약간 식힙니다.",
        "Image_Name": "dark-gingerbread-pear-cake-350222.jpg"
    },
    {
        "Title": "귀신이 나오는 진저브레드 하우스",
        "Ingredients": "['로얄 아이싱 또는 바닐라 프로스팅 1개(16온스)', '빨강, 노랑, 초록, 파랑의 액상 식용 색소', '장식되지 않은 진저브레드 하우스 1개*', '검은색 감초 레이스', '거미 젤리', '여러 가지 맛의 캔디 콘', '녹색 사과 사워 벨트', '멜로크림 호박', '설탕 캔디 배트(덱스트로스 캔디 배트라고도 함)', '마시멜로 유령', '*장식되지 않은 진저브레드 하우스는 Dylans Candy Bar 또는 Amazon.com에서 구입할 수 있습니다.']",
        "Instructions": "아이싱 1/2컵을 작은 그릇에 넣고 보라색으로 물들입니다(장식 팁 참조).\n아이싱 1/2컵을 작은 그릇에 넣고 녹색으로 물들입니다(장식 팁 참조).\n아이싱 1/4컵을 작은 그릇에 넣고 주황색으로 물들입니다(장식 팁 참조).\n작은 오프셋 주걱이나 칼을 사용하여 보라색 아이싱을 지붕에 얇고 고르게 펴 바릅니다.\n검은색 감초 레이스를 더 짧게 자른 다음 지붕 오른쪽에 십자 모양으로 배열하여 거미줄을 만듭니다. 아이싱에 살짝 눌러 고정합니다. 지붕에 거미줄을 배열하고 살짝 눌러 고정합니다. 지붕의 좌우가 만나는 이음새를 따라 캔디콘을 배열합니다. 지붕 왼쪽에 캔디콘을 세 개의 수직선으로 배열합니다.\n작은 오프셋 주걱이나 칼을 사용하여 집 바닥에 녹색 아이싱을 얇고 고르게 펴 바릅니다. 집 바닥 주위에 녹색 사과 사워 벨트를 배열하여 잔디를 만듭니다.\n작은 오프셋 주걱이나 칼을 사용하여 멜로크림 호박 한 개의 바닥에 오렌지색 아이싱을 약간 뿌린 다음 집 앞에 놓습니다. 원하는 경우 다른 호박으로 반복합니다.\n작은 오프셋 주걱이나 칼을 사용하여 문 표면에 흰색 아이싱을 얇고 고르게 뿌립니다. 설탕 사탕 박쥐를 문에 살짝 누릅니다. 설탕 박쥐 1개에 흰색 아이싱을 약간 뿌린 다음 지붕 왼쪽에 붙입니다. 원하는 대로 반복합니다.\n작은 오프셋 주걱이나 칼을 사용하여 마시멜로 고스트에 흰색 아이싱을 약간 뿌린 다음 집 앞에 살짝 누릅니다.\n작은 오프셋 주걱이나 칼을 사용하여 지붕과 집 앞이 만나는 이음새를 따라 오렌지색 아이싱을 얇게 뿌립니다. 이음새를 따라 캔디 콘을 배열하고 살짝 눌러 고정합니다.\n캔디 콘을 집 옆면과 뒷면을 따라 배열하여 울타리를 만듭니다. 필요한 경우 추가 아이싱으로 고정합니다.\n원하는 대로 캔디를 계속 추가합니다.",
        "Image_Name": "haunted-gingerbread-house-350143.jpg"
    },
    {
        "Title": "체리 아몬드 쇼트브레드 쿠키",
        "Ingredients": "['말린 타트 체리 24개(약 1 1/2온스)', '크렘 드 카시스(블랙커런트 리큐어) 1/3컵', '껍질이 벗겨지지 않은 생 아몬드 1/2컵(나누기)', '다용도 밀가루 1/2컵', '통밀가루 1/2컵', '소금 1/2티스푼', '무염 버터 1/2컵(1스틱), 실온', '가루 설탕 1/2컵(체로 걸러낸 것)', '큰 달걀 1개(가볍게 풀어둔 것)']",
        "Instructions": "체리를 작은 그릇에 있는 카시스에 최소 4시간 또는 밤새 담가둡니다. 물기를 빼고 물기를 제거합니다.\n미니 프로세서에 아몬드 3큰술을 넣고 잘 갈립니다. 남은 아몬드를 잘게 다집니다.\n다용도 밀가루, 통밀가루, 소금을 중간 크기의 그릇에 넣고 휘젓습니다. 전기 믹서를 사용하여 큰 그릇에 버터와 설탕을 넣고 약 2분간 크림이 될 때까지 치십시오. 아몬드 가루를 넣고 잘 섞일 때까지 약 1분간 치십시오. 저속으로 밀가루 혼합물을 넣고 섞습니다.\n반죽을 양피지나 왁스 종이에 긁어냅니다. 종이를 보조재로 사용하여 반죽을 81/2x13/4인치 통나무 모양으로 만듭니다. 반죽 전체에 계란을 바릅니다(끝부분 제외). 잘게 썬 아몬드를 비닐 랩에 뿌립니다. 통나무 모양으로 아몬드를 굴려 코팅합니다. 비닐 랩에 싸서 최소 2시간 동안 냉장합니다. 미리 준비: 반죽은 2일 전에 만들 수 있습니다. 냉장 보관합니다. 체리를 덮고 냉장합니다.\n오븐을 350°F로 예열합니다. 반죽을 실온에 10분간 두세요. 반죽을 풀고 3/8인치 두께로 자릅니다. 쿠키를 기름을 바르지 않은 큰 베이킹 시트에 1인치 간격으로 놓습니다. 각 쿠키 중앙에 체리 1개를 놓습니다.\n10분간 굽습니다. 체리를 쿠키에 눌러 넣습니다(쿠키가 부드러워집니다). 오븐에서 베이킹 시트를 돌려 쿠키가 약간 노릇노릇해지고 약간 부풀어 오를 때까지 굽습니다. 약 18분 더 굽습니다. 쿠키를 랙에 올려놓고 시트에 5분간 식힙니다. 쿠키를 랙으로 옮겨 완전히 식힙니다. 미리 준비: 쿠키는 2일 전에 만들어도 됩니다. 실온에서 밀폐 보관합니다.",
        "Image_Name": "cherry-almond-shortbread-cookies-350132.jpg"
    },
    {
        "Title": "고수와 실란트로 플랫브레드",
        "Ingredients": "['표백되지 않은 다용도 밀가루 1 1/2컵(또는 그 이상)', '고수 가루 2 1/2티스푼', '베이킹파우더 1 1/2티스푼', '소금 3/4티스푼', '베이킹소다 1/2티스푼', '다진 신선한 고수 1/3컵', '일반 전유 요거트 3/4컵(또는 그 이상)', '올리브 오일(튀김용)']",
        "Instructions": "중간 크기의 그릇에 처음 5가지 재료를 체로 걸러 넣습니다. 실란트로를 넣고 저어줍니다. 요거트를 넣고 포크로 작은 덩어리가 형성될 때까지 저어줍니다. 반죽이 뭉쳐질 때까지 그릇에 반죽을 넣고, 부드럽고 약간 끈적거리는 반죽을 위해 밀가루나 요거트를 큰술 단위로 더 넣습니다. 반죽을 밀가루를 뿌린 표면에 꺼냅니다. 매끄러워질 때까지 반죽합니다(약 1분). 반죽을 8개로 나눕니다.\n각 조각을 공 모양으로 굴린 다음, 밀가루를 뿌린 표면에 각 반죽 조각을 펴서 4 1/2인치 원형으로 만듭니다. 큰 논스틱 프라이팬에 올리브 오일을 듬뿍 바르고 중불로 가열합니다. 배치별로 작업하면서 3개의 반죽을 프라이팬에 넣고 황금빛 갈색이 되고 부풀어 오를 때까지 요리합니다. 필요에 따라 중불로 불을 조절하여 고르게 갈색이 되게 합니다(면당 약 3분). 플랫브레드를 접시에 옮기고 따뜻하게 제공합니다.",
        "Image_Name": "ground-coriander-and-cilantro-flatbreads-242112.jpg"
    },
    {
        "Title": "텍사스 버터밀크 콘브레드",
        "Ingredients": "['무염 버터', '노란 옥수수가루 2컵', '다용도 밀가루 6큰술', '베이킹파우더 1큰술', '소금 1/2작은술', '베이킹소다 1/8작은술', '버터밀크 1 1/3컵']",
        "Instructions": "오븐을 400°F로 예열합니다. 8x8x2인치 유리 베이킹 접시에 버터 2큰술을 바릅니다. 접시를 오븐에 10분간 넣습니다(버터가 갈색으로 변할 수 있음).\n그동안 큰 그릇에 콘밀, 밀가루, 베이킹파우더, 소금, 베이킹소다를 넣고 섞습니다. 버터밀크와 남은 녹인 버터 6큰술을 넣습니다. 반죽이 고르게 촉촉해질 때까지 저어줍니다(과도하게 섞지 마세요).\n콘브레드 반죽을 뜨거운 접시에 옮겨 고르게 펴 바릅니다. 콘브레드를 윗부분이 바삭해지고 중앙에 꽂은 테스터가 깨끗하게 나올 때까지 약 25분간 굽습니다. 콘브레드를 최소 10분간 식힙니다. 따뜻하게 제공합니다.",
        "Image_Name": "texas-buttermilk-cornbread-241130.jpg"
    },
    {
        "Title": "세이지 향 쇼트브레드",
        "Ingredients": "['다용도 밀가루 2컵', '가루 설탕 1/2컵', '얇게 썬 신선한 세이지 잎 2큰술 또는 말린 세이지 2작은술', '굵은 코셔 소금 1작은술', '무염 버터 1컵(2스틱)을 1/2인치 두께로 썰어 실온 보관']",
        "Instructions": "프로세서에서 처음 4가지 재료를 섞습니다. 버터를 넣고, 켜고 끄는 방식으로 반죽이 합쳐질 때까지 섞습니다. 반으로 나눕니다. 각 반죽 조각을 지름이 약 1 1/2인치인 통나무 모양으로 만듭니다. 썰기에 충분히 단단해질 때까지 약 30분간 식힙니다.\n오븐의 상단 1/3에 랙 1개, 하단 1/3에 랙 1개를 놓습니다. 350°F로 예열합니다. 베이킹 시트 2개에 양피지를 깔아줍니다. 각 반죽 통나무를 1/3~1/2인치 두께의 원형으로 자릅니다. 시트에 올려놓습니다. 10분간 굽습니다. 시트를 뒤집어서 하단 시트가 오븐의 상단 랙에, 상단 시트가 하단 랙에 오도록 합니다. 쿠키가 노릇노릇해질 때까지 약 15분 더 굽습니다. 랙 위에서 식힙니다.",
        "Image_Name": "sage-scented-shortbread-240377.jpg"
    },
    {
        "Title": "세이지 앤 허니 스킬릿 콘브레드",
        "Ingredients": "['옥수수 가루 1컵(통곡물, 중간 분쇄가 좋음)', '표백되지 않은 다용도 밀가루 1컵', '베이킹파우더 1큰술', '소금 1작은술', '다진 신선한 세이지 2작은술과 신선한 세이지 잎 12장', '전유 1컵', '꿀 1/2컵', '큰 달걀 1개', '무염 버터 1/2컵(1스틱)']",
        "Instructions": "오븐을 400°F로 예열합니다. 10인치 직경의 두꺼운 내열 프라이팬(주철이 좋음)을 오븐에서 10분간 가열합니다.\n큰 그릇에 첫 번째 4가지 재료와 다진 세이지 2티스푼을 넣고 휘저어 섞습니다. 중간 크기의 그릇에 우유, 꿀, 계란을 넣고 휘저어 섞습니다.\n프라이팬을 오븐에서 꺼냅니다. 버터 1/2컵을 넣습니다. 버터가 녹을 때까지 돌립니다. 버터 2큰술을 제외한 모든 것을 계란 혼합물에 붓습니다. 프라이팬에 있는 버터에 세이지 잎을 통째로 넣고 섞습니다. 프라이팬 바닥에 잎을 간격을 두고 놓습니다.\n옥수수가루 혼합물에 계란 혼합물을 넣고 섞을 때까지 저어줍니다(과도하게 섞지 마세요. 반죽이 젖고 묽어집니다). 프라이팬에 있는 세이지 잎 위에 반죽을 붓습니다. 가장자리가 갈색이 되고 중앙에 꽂은 테스터가 깨끗하게 나올 때까지 약 22분간 굽습니다. 프라이팬에서 10분간 식힙니다. 접시에 뒤집습니다. 필요한 경우 콘브레드 위에 세이지 잎을 다시 올려놓습니다.",
        "Image_Name": "sage-and-honey-skillet-cornbread-240376.jpg"
    },
    {
        "Title": "쇼트브레드 쿠키",
        "Ingredients": "['다용도 밀가루 1컵', '설탕 1/4컵', '소금 1/4티스푼', '무염 버터 1/2컵(1스틱)을 1/2인치 크기로 잘라 냉장 보관']",
        "Instructions": "오븐을 300°F로 예열합니다. 직경 9인치 스프링폼 팬에 가볍게 버터를 바릅니다. 중간 크기의 그릇에 밀가루, 설탕, 소금을 넣고 섞습니다. 버터 1/2컵을 넣고 손가락 끝으로 문질러서 혼합물이 거친 밀가루와 비슷해질 때까지 섞습니다. 반죽을 모아서 공 모양으로 만들고, 디스크 모양으로 납작하게 펴줍니다. 가볍게 밀가루를 뿌린 표면에 반죽을 펴서 두께 1/2인치의 둥근 모양으로 만듭니다. 둥근 모양을 준비된 팬에 옮깁니다. 손가락을 사용하여 반죽을 팬 바닥에서 팬 가장자리까지 고르게 누릅니다. 작고 날카로운 칼 끝을 사용하여 반죽을 8개의 동일한 삼각형으로 자른 다음 포크로 전체에 구멍을 뚫습니다. 쇼트브레드가 완전히 익고 옅은 황금색이 될 때까지 굽습니다(약 45분).\n날카로운 칼 끝을 사용하여 따뜻한 쇼트브레드를 자른 선을 따라 삼각형으로 자릅니다. 쇼트브레드 주위로 칼을 돌려 풀어줍니다. 팬에서 최소 30분 동안 식힙니다. 스프링폼 팬 측면을 엽니다. 주걱을 사용하여 쇼트브레드를 팬에서 조심스럽게 꺼냅니다(쇼트브레드는 깨지기 쉽습니다). 미리 만들어두세요. 1일 전에 만들어둘 수 있습니다. 쇼트브레드를 한 겹으로 접어서 실온에서 밀폐하여 보관하세요.",
        "Image_Name": "shortbread-cookies-237919.jpg"
    },
    {
        "Title": "메이플 버터를 곁들인 콘브레드 머핀",
        "Ingredients": "['무염 버터 3/4컵(1 1/2스틱), 실온', '순수 메이플 시럽 3 1/2큰술(B등급이 좋음)', '노란 옥수수가루 1컵', '표백되지 않은 다용도 밀가루 1컵', '설탕 1/4컵', '베이킹파우더 1큰술', '소금 1/4작은술', '버터밀크 1컵', '큰 달걀 1개', '무염 버터 5큰술, 녹여서 살짝 식힌 것']",
        "Instructions": "전기 믹서를 사용하여 중간 크기의 그릇에 버터를 넣고 크림이 될 때까지 섞습니다. 메이플 시럽을 넣고 잘 섞이고 부드러워질 때까지 점차적으로 섞습니다. 미리 만들어 두세요. 1주일 전에 만들어도 됩니다. 덮고 냉장 보관합니다.\n오븐을 375°F로 예열합니다. 일반(1/3컵) 머핀 컵 12개에 버터를 바릅니다. 옥수수가루, 밀가루, 설탕, 베이킹파우더, 소금을 중간 크기의 그릇에 체로 걸러 넣습니다. 다른 중간 크기의 그릇에 버터밀크와 계란을 넣고 휘젓습니다. 녹인 버터를 넣고 휘젓습니다. 버터밀크 혼합물을 건조한 재료에 넣고 잘 섞일 때까지 저어줍니다(너무 섞지 마세요). 반죽을 준비한 머핀 컵에 똑같이 나눕니다. 머핀을 가운데에 꽂은 테스터가 깨끗이 나올 때까지 굽습니다(머핀은 옅은 색이 됩니다). 랙에 10분간 식힙니다. 메이플 버터와 함께 제공합니다.",
        "Image_Name": "cornbread-muffins-with-maple-butter-237892.jpg"
    },
    {
        "Title": "진짜 진저브레드",
        "Ingredients": "['다용도 밀가루 2 1/4컵', '베이킹 소다 1티스푼', '계피가루 1티스푼', '올스파이스가루 1/4티스푼', '소금 1/2티스푼', '무염 버터 1스틱(1/2컵), 잘 부드럽게 한 것', '당밀(블랙스트랩 제외) 2/3컵', '진한 갈색 설탕 2/3컵', '큰 달걀 2개', '껍질을 벗긴 생강 3큰술(잘게 갈아서)', '뜨거운 물 2/3컵']",
        "Instructions": "오븐 랙을 가운데에 놓고 오븐을 350°F로 예열합니다. 9인치 정사각형 베이킹 팬에 버터를 바릅니다.\n그릇에 밀가루, 베이킹 소다, 향신료, 소금을 넣고 휘젓습니다.\n큰 그릇에 버터, 당밀, 황설탕, 계란, 생강을 넣고 전기 믹서기를 중간 속도로 돌려서 섞습니다. 속도를 낮추고 밀가루 혼합물을 부드러워질 때까지 섞은 다음 뜨거운 물을 넣고 섞습니다(반죽이 응고된 것처럼 보일 수 있음).\n반죽을 팬에 붓고 케이크 중앙에 꽂은 나무 꼬치나 꼬치가 깨끗하게 나올 때까지 35~40분간 굽습니다. 랙 위에 팬을 올려놓고 식혀서 데웁니다.",
        "Image_Name": "real-gingerbread-237680.jpg"
    },
    {
        "Title": "크렘 프레쉬를 곁들인 카라멜 양파 플랫브레드",
        "Ingredients": "['따뜻한 물 1/4컵에 1큰술(105°F~115°F)', '활성 건조 효모 3/4작은술', '다용도 밀가루 3/4컵에 2큰술', '니젤라(칼론지) 씨앗 3/4작은술', '소금 1/2작은술', '버터 1큰술(실온)', '엑스트라 버진 올리브 오일 2큰술', '양파 1파운드(중간 크기 2개 정도), 뿌리까지 1/3인치 두께로 자름', '다진 신선한 타임 2작은술', '꿀 1작은술', '셰리 와인 식초 1큰술', '크렘 프레쉬 1/2컵', '큰 달걀 1개', '소금 1/2작은술', '후추 가루 1/4작은술', '세몰리나 가루(파스타 가루)* 또는 콘밀', '다진 신선한 파 2큰술']",
        "Instructions": "작은 그릇에 따뜻한 물 1/4컵과 1큰술, 효모를 넣고 휘젓습니다. 효모가 녹을 때까지 약 10분간 그대로 둡니다.\n중간 크기의 그릇에 밀가루, 니젤라 씨앗, 소금을 섞습니다. 효모 혼합물을 넣고 나무 숟가락으로 저어서 덩어리가 뭉쳐질 때까지 섞습니다. 버터를 넣고 잘 섞습니다. 가볍게 밀가루를 뿌린 작업대에 반죽을 꺼내서 부드럽고 탄력이 생길 때까지 약 5분간 반죽합니다. 반죽을 6등분합니다. 각각을 공 모양으로 굴립니다. 베이킹 시트에 올려놓고 비닐 랩으로 덮습니다. (1일 전에 준비할 수 있습니다. 덮어두고 냉장 보관합니다.)\n중불에서 큰 논스틱 프라이팬에 기름을 두릅니다. 프라이팬에 양파 조각을 넣고 뒤집지 않고 갈색이 될 때까지 약 7분간 익힙니다. 조심스럽게 양파를 뒤집습니다. 불을 중불로 줄이고 양파가 부드럽고 갈색이 될 때까지 계속 익히면서 가끔 가볍게 저어줍니다. 약 10분간 익힙니다. 타임과 꿀을 넣고 1분간 익힙니다. 식초를 넣고 저어줍니다. 소금과 후추로 간을 합니다. 프라이팬을 불에서 내립니다. 식힙니다. (1일 전에 준비할 수 있습니다. 덮고 냉장 보관하세요.)\n반죽을 따뜻하고 통풍이 잘 되지 않는 곳에 두어 두 배로 부풀 때까지 약 1시간 동안 두세요. 작은 그릇에 크렘 프레쉬와 계란을 넣고 휘저어 섞으세요. 소금 1/2티스푼과 후추 1/4티스푼을 넣고 저어주세요.\n오븐을 450°F로 예열하세요. 테두리가 있는 베이킹 시트 2개에 세몰리나 가루를 가볍게 뿌립니다. 각 반죽을 5인치 크기로 펴세요. 준비된 각 베이킹 시트에 3개의 반죽을 옮깁니다. 10분간 쉬게 두세요. 포크로 반죽을 찔러 넣으세요. 각 반죽에 크렘 프레쉬 혼합물 1큰술을 넉넉히 바르고 1/4인치의 평평한 테두리를 남겨두세요. 각 반죽 위에 양파를 고르게 놓고 크렘 프레쉬 혼합물을 가볍게 뿌리세요(혼합물이 반죽 가장자리로 넘칠 수 있음).\n플랫브레드를 빵 껍질이 부풀고 노릇노릇해질 때까지 약 12분간 굽습니다. 접시에 옮기고 파를 뿌립니다.\n*일부 슈퍼마켓, 특수 식품점, 이탈리아 시장에서 구매 가능합니다.",
        "Image_Name": "caramelized-onion-flatbreads-with-creme-fraiche-233905.jpg"
    },
    {
        "Title": "아몬드 쇼트브레드 크러스트가 들어간 카라멜 푸딩 타르트",
        "Ingredients": "['1/2컵 아몬드 슬라이스, 토스트하여 식힌 것', '1/4컵 설탕', '1컵 다용도 밀가루', '1/4컵 가루 설탕', '1/4티스푼 소금', '1/2컵(1스틱) 냉장 무염 버터, 1/2인치 입방체로 자른 것', '큰 달걀 노른자 1개', '옥수수 전분 2 1/2큰술', '1/4티스푼 소금', '2 1/4컵 전유, 나누어 넣은 것', '큰 달걀 노른자 3개', '설탕 1컵', '물 1/3컵', '무염 버터 3큰술', '바닐라 추출물 1/2티스푼', '설탕 2/3컵', '물 1/3컵', '아몬드 슬라이스 1컵', '냉장 진한 휘핑크림 1/2컵', '가루 설탕 1/2큰술', '바닐라 추출물 1/8티스푼', 'Fleur de sel*', '*바다소금의 일종으로 일부 슈퍼마켓과 특수 식품점에서 구입할 수 있습니다.']",
        "Instructions": "탈착식 바닥이 있는 직경 9인치 타트 팬에 버터를 바릅니다. 아몬드와 설탕 1/4컵을 프로세서에 넣고 섞습니다. 견과류를 잘게 갈아줍니다. 밀가루, 가루 설탕, 소금을 넣고 5초 동안 섞습니다. 버터를 넣고 온/오프 턴을 사용하여 거친 가루가 형성될 때까지 섞습니다. 달걀 노른자를 넣고 촉촉한 덩어리가 형성될 때까지 약 30초 동안 섞습니다. 반죽을 반죽하여 공 모양으로 만듭니다. 반죽 1/4컵을 작은 그릇에 옮겨 다른 용도로 보관합니다. 남은 반죽을 준비된 팬의 바닥과 윗면에 고르게 누릅니다. 포크로 바닥 전체를 찔러줍니다. 팬을 호일로 덮고 껍질을 최소 1시간에서 최대 1일까지 냉동합니다.\n오븐을 375°F로 예열합니다. 껍질을 덮지 않은 채로 짙은 황금빛 갈색이 될 때까지 굽고, 자주 확인하고 껍질이 부풀거나 거품이 생기면 처음 15분 동안 포크 뒷면으로 측면과 바닥을 누릅니다. 총 약 20분. 완전히 식힙니다.\n옥수수 전분과 소금을 중간 크기의 그릇에 넣습니다. 점차적으로 우유 1/4컵을 넣고 옥수수 전분이 녹을 때까지 휘젓습니다. 달걀 노른자를 넣고 휘젓습니다.\n설탕과 물 1/3컵을 무거운 대형 냄비에 넣고 중불에서 설탕이 녹을 때까지 저어줍니다. 끓이면서 젖은 페이스트리 브러시로 냄비 측면을 닦습니다. 시럽이 진한 호박색이 될 때까지 저어주지 않고 끓이며, 가끔 냄비를 돌려줍니다. 약 10분 정도 걸립니다. 우유 2컵을 넣습니다(혼합물이 거품을 냅니다). 캐러멜 조각이 녹을 때까지 휘젓습니다. 뜨거운 우유 혼합물을 노른자 혼합물에 천천히 휘젓고 같은 냄비로 다시 넣습니다. 푸딩이 걸쭉해지고 끓을 때까지 약 2분 정도 휘젓습니다. 불에서 내립니다. 버터와 바닐라를 넣고 휘젓습니다. 크러스트로 옮깁니다. 뚜껑을 열고 차갑고 딱딱해질 때까지 식힙니다. 최소 3시간. 미리 만들어두기 하루 전에 만들어둘 수 있습니다.\n설탕 2/3컵과 물 1/3컵을 무거운 중불에서 중불에서 설탕이 녹을 때까지 저어줍니다. 끓이면서 젖은 페이스트리 브러시로 냄비 측면을 닦습니다. 시럽이 중간 호박색이 될 때까지 저어주지 않고 끓이며, 약 7분 정도 걸립니다. 아몬드를 넣고 캐러멜로 고르게 코팅되도록 저어줍니다. 코팅된 아몬드를 즉시 호일 시트에 긁어냅니다. 포크 2개로 재빨리 아몬드를 분리하고 한 겹으로 펼칩니다. 완전히 식힙니다. 미리 만들어두기 아몬드를 실온에 최대 6시간 두거나 덮고 최대 1일까지 식힙니다. 사용하기 전에 아몬드를 작은 덩어리로 쪼개줍니다.\n팬 바닥을 눌러 타르트를 꺼냅니다. 그릇에 크림, 가루 설탕, 바닐라를 넣고 봉우리가 형성될 때까지 휘저은 다음 타르트 위에 펼칩니다. 아몬드 덩어리에 플뢰르 드 셀을 뿌립니다. 덩어리로 타르트에 장식합니다.",
        "Image_Name": "caramel-pudding-tart-with-almond-shortbread-crust-236889.jpg"
    },
    {
        "Title": "주니퍼 베리 글레이즈를 곁들인 진저브레드 나무",
        "Ingredients": "['표백되지 않은 다용도 밀가루 2 1/4컵', '생강가루 1티스푼', '올스파이스가루 1티스푼', '계피가루 1/2티스푼', '베이킹소다 1/2티스푼', '소금 1/2티스푼', '무염 버터 1컵(2스틱), 실온', '황금빛 갈색 설탕 1/2컵(꽉 채운)', '연한 풍미(라이트) 당밀 1/4컵', '하프앤하프 3/4컵', '주니퍼베리 1/3컵(1온스), 가볍게 으깬 것', '가루 설탕 1파운드', '다양한 장식(컬러 설탕, 노파레일, 드라제)']",
        "Instructions": "중간 크기의 그릇에 첫 번째 재료 6가지를 휘젓습니다. 큰 그릇에 버터와 설탕을 넣고 부드러워질 때까지 휘젓습니다. 당밀을 넣고 휘젓습니다. 마른 재료를 넣고 휘젓습니다. 반죽을 모아서 4조각으로 나눕니다. 원반 모양으로 만듭니다. 포장합니다. 최소 2시간에서 최대 2일까지 냉장합니다.\n오븐을 350°F로 예열합니다. 베이킹 시트 2개에 양피지를 깔아줍니다. 반죽 원반 1개를 1/8인치 두께로 펼칩니다. 3 1/2인치 커터를 사용하여 쿠키를 자릅니다. 시트로 옮깁니다. 조각을 모으고 냉장합니다.\n쿠키를 중앙이 거의 굳을 때까지 12분간 굽습니다. 시트에서 2분간 식힌 다음 랙에서 식힙니다. 모든 반죽을 사용하여 반복합니다. 미리 만들어 둡니다. 실온에서 최대 3일까지 기밀 보관하거나 최대 2주까지 냉동합니다.\n첫 번째 재료 2가지를 끓입니다. 덮고 5시간 냉장합니다. 걸러냅니다. 그릇에 가루 설탕을 넣습니다. 유약이 바를 수 있을 때까지 숟가락으로 반씩 휘젓습니다. 쿠키에 프로스팅을 합니다. 장식합니다. 유약이 굳을 때까지 그대로 둡니다. 미리 보관하세요 왁스 종이에 싸서 밀폐 용기에 넣고 실온에서 최대 3일 동안 보관할 수 있습니다.",
        "Image_Name": "gingerbread-trees-with-juniper-berry-glaze-236805.jpg"
    },
    {
        "Title": "스코틀랜드 샤프 체다 쇼트브레드",
        "Ingredients": "['무염 버터 1/2컵(1스틱), 실온', '소금 1/2티스푼', '갓 갈은 검은 후추 1/4티스푼', '카옌페퍼 한 꼬집', '매우 강한 맛의 흰색 체다 치즈 8온스, 잘게 썬 것', '표백되지 않은 다용도 밀가루 1컵']",
        "Instructions": "전기 믹서기를 휘핑기 부착물을 사용하여 버터, 소금, 후추, 카이엔을 저속으로 섞습니다. 체다 치즈와 밀가루를 넣고 부드러워질 때까지 저속으로 섞습니다(과도하게 섞지 마세요). 반죽을 디스크 모양으로 만들고, 비닐 랩이나 왁스 종이에 싸서 30분간 식힙니다.\n오븐의 위아래 1/3에 랙을 놓고 350°F로 예열합니다. 2개의 큰 베이킹 시트에 양피지를 깔아줍니다.\n가볍게 밀가루를 뿌린 표면에 반죽을 1/4~1/8인치 두께의 원형으로 펴줍니다. 1 1/2~2인치 원형 커터를 사용하여 원형을 잘라서 베이킹 시트에 1 1/2인치 간격으로 놓습니다. 원하는 경우 스크랩을 다시 말아줍니다(다시 말아준 스크랩은 더 딱딱합니다).\n쇼트브레드를 가볍게 황금색이 되고 가장자리가 갈색이 될 때까지 굽습니다(약 13~15분). 시트에 5분간 식힌 다음 랙으로 옮겨 완전히 식힙니다.",
        "Image_Name": "scottish-sharp-cheddar-shortbread-236735.jpg"
    },
    {
        "Title": "노르웨이 플랫브레드",
        "Ingredients": "['중간 크기의 러셋 감자 4개(약 2파운드), 잘게 썬 것', '무염 버터 5큰술, 1/2인치 두께로 썬 것', '소금 1 3/4작은술', '농후한 크림 1/2컵', '표백되지 않은 다용도 밀가루 2컵', '설탕 1/2컵', '계피 1작은술', '표백되지 않은 다용도 밀가루 약 3컵', '소금 버터 4큰술, 녹인 것']",
        "Instructions": "중간 크기의 냄비에 고열로 감자와 찬물을 섞어 덮습니다. 덮고 끓인 다음 불을 약하게 줄이고 약 15분간 부드러워질 때까지 끓입니다. 물기를 잘 빼고 감자를 쌀밥통이나 푸드밀로 큰 그릇에 넣습니다. 버터를 넣고 저어줍니다. 소금과 크림을 넣고 부드러워질 때까지 저어줍니다. 밀가루를 넣고 반죽이 형성될 때까지 저어줍니다(과도하게 섞지 마세요). 덮고 최소 6시간에서 최대 3일까지 냉장합니다.\n작은 그릇에 설탕과 계피를 넣고 휘저어 섞습니다. 10인치 주철 프라이팬에 가볍게 기름을 바르고 적당히 약한 불에 올립니다. 롤링 핀, 페이스트리 벤치 스크레이퍼, 얇은 금속 주걱을 준비합니다.\n반죽을 잘 밀가루를 뿌린 작업대에 꺼냅니다. 페이스트리 벤치 스크레이퍼를 사용하여 반으로 자르고 반을 그릇에 다시 넣습니다. 다른 조각을 다시 반으로 자릅니다. 한 조각을 8개의 작은 조각으로 자르고 다른 조각은 따로 보관합니다.\n작은 조각 하나를 두드려서 납작하게 합니다. 반죽은 감자의 수분 함량에 따라 매우 부드럽고 끈적거릴 수 있습니다. 필요에 따라 밀가루 3컵을 약간 넣어 달라붙지 않도록 합니다. 스크레이퍼를 사용하여 반죽을 뒤집고 다시 두드려서 납작하게 합니다. 패티를 7인치 원으로 펴세요.\n페이스트리 벤치 스크레이퍼를 사용하여 플랫브레드를 뜨거운 프라이팬에 조심스럽게 옮기고 반죽이 거품을 내고 아래가 갈색으로 변하기 시작할 때까지 1분 이내에 굽습니다. 얇고 유연한 금속 주걱을 사용하여 플랫브레드를 뒤집고 반대쪽이 약간 갈색이 될 때까지 약 1분 동안 굽습니다. 접시에 옮기고 여분의 밀가루를 털어냅니다. 프라이팬에서 여분의 밀가루를 긁어냅니다.\n반죽 8개로 다시 펴고 굽는 작업을 한 다음, 남은 반죽을 카운터에 8개로 나누고 각 조각을 펴서 굽습니다. 그릇에 남은 반죽으로 이 과정을 반복하여 플랫브레드 32개를 만듭니다.\n서빙할 때는 따뜻한 레프세에 녹인 버터를 바르고 계피 설탕을 뿌린 다음 말아 올립니다. 따뜻하게 서빙합니다.",
        "Image_Name": "norwegian-flatbreads-236734.jpg"
    },
    {
        "Title": "설탕에 절인 사과를 곁들인 진저브레드 푸딩",
        "Ingredients": "['무가당 사과 사이다 또는 사과 주스 8컵', '그래니 스미스 사과 1파운드 반, 껍질을 벗기고 씨를 제거하고 1/3인치 크기로 자름(약 4 1/2컵)', '황금빛 갈색 설탕 3/4컵(꽉 채움)', '다용도 밀가루 1 3/4컵', '생강가루 1큰술', '베이킹 소다 1작은술', '계피가루 1작은술', '소금 1/4작은술', '정향가루 1/4작은술', '검은 후추 가루 1/4작은술', '무염 버터 1/2컵(1스틱), 실온', '황금빛 갈색 설탕 3/4컵(꽉 채움)', '큰 달걀 1개', '순한 맛(라이트) 당밀 3/4컵', '끓는 물 1/2컵', '순한 우유 3컵', '신선한 생강 4인치 길이 2조각(약 [4온스), 껍질을 벗기고 두껍게 썬 것', '검은 후추알 1큰술', '큰 계란 4개', '설탕 3/4컵', '바닐라 추출물 1티스푼', '생강가루 1티스푼', '소금 한 꼬집', '아이스크림 또는 크렘 프레쉬*', '*일부 슈퍼마켓과 특수 식품점에서 판매됩니다.']",
        "Instructions": "큰 냄비에 모든 재료를 넣습니다. 설탕이 녹을 때까지 강한 불로 끓입니다. 불을 중불로 줄이고 사과가 부드럽고 반투명해지고 사이다가 사과에 두껍게 코팅될 때까지 가끔 저어가며 약 2시간 동안 끓입니다. 그릇에 옮겨 식힙니다. 미리 만들어 두세요. 1주일 전에 만들어 둘 수 있습니다. 덮고 식힙니다. 서빙하기 전에 실온으로 맞춥니다.\n오븐을 350°F로 예열합니다. 9x9x2인치 금속 베이킹 팬에 버터를 바릅니다. 중간 크기의 그릇에 처음 7가지 재료를 넣고 섞습니다. 전기 믹서를 사용하여 큰 그릇에 버터를 넣고 부드러워질 때까지 섞습니다. 황설탕과 계란을 넣고 섞일 때까지 섞습니다. 당밀을 넣고 밀가루 혼합물을 넣습니다. 고무 주걱을 사용하여 끓는 물 1/2컵을 넣고 저어줍니다. 반죽을 준비된 팬에 옮깁니다.\n중앙에 꽂은 테스터가 깨끗하게 나올 때까지 진저브레드를 굽습니다(약 40분). 팬을 랙에 옮기고 팬에서 진저브레드를 완전히 식힙니다. 미리 만들어 두세요. 1일 전에 만들어 둘 수 있습니다. 팬을 호일로 덮고 실온에 두세요.\n오븐을 325°F로 예열합니다. 우유, 신선한 생강, 후추를 무거운 중간 크기의 냄비에 넣고 섞습니다. 끓입니다. 불에서 내립니다. 계란, 설탕, 바닐라, 갈은 생강, 소금을 중간 크기의 그릇에 넣고 섞습니다. 뜨거운 우유 혼합물을 계란 혼합물에 서서히 넣고 휘젓습니다. 커스타드를 중간 크기의 그릇에 걸러냅니다. 고형물은 체에 버립니다.\n진저브레드를 1/2인치 입방체로 잘라 5 1/3컵으로 만듭니다(나머지 진저브레드는 다른 용도로 보관합니다). 진저브레드 입방체를 8개의 3/4컵 커스타드 컵이나 라메킨에 나눕니다. 각 컵에 커스타드를 진저브레드 위에 붓고 균등하게 나눕니다. 진저브레드가 커스타드를 흡수하도록 15분 정도 둡니다.\n컵을 로스팅 팬에 넣습니다. 컵의 측면 중간까지 올라올 만큼 뜨거운 물을 팬에 붓습니다. 팬을 호일로 덮습니다. 푸딩이 굳을 때까지 약 1시간 동안 굽습니다. 수조에서 꺼냅니다.\n푸딩을 따뜻하거나 실온으로 유지하고, 설탕에 절인 사과 장식과 아이스크림을 얹어 드세요.",
        "Image_Name": "gingerbread-puddings-with-candied-apples-236546.jpg"
    },
    {
        "Title": "치즈 호박과 붉은 양파 플랫브레드",
        "Ingredients": "['논스틱 식물성 오일 스프레이', '냉장 피자 도우 10온스 튜브 1개', '마늘 허브 치즈 스프레드(알루에트 등) 3/4컵, 나누어 담기', '파마산 치즈 잘게 갈은 3/4컵, 나누어 담기', '다진 신선한 이탈리안 파슬리 3큰술, 나누어 담기', '작은 붉은 양파 1개', '7~8인치 길이의 호박(노란색 또는 녹색) 1개를 가로질러 1/8인치 두께로 잘라서 나누어 담기', '올리브 오일']",
        "Instructions": "오븐을 400°F로 예열합니다. 베이킹 시트에 양피지를 깔고, 노스틱 스프레이를 뿌립니다. 반죽을 양피지에 펼칩니다. 허브 치즈의 절반을 반죽의 긴 반쪽에 펴 바르고, 1/2인치의 평범한 테두리를 남겨둡니다. 파마산 치즈의 절반과 파슬리 2큰술을 뿌립니다. 양피지를 사용하여 반죽의 평범한 반쪽을 채워진 반쪽 위로 접습니다(가장자리는 밀봉하지 마세요). 남은 허브 치즈를 위에 펴 바르고, 남은 파마산을 뿌립니다. 양파의 바깥층을 충분히 제거하여 직경 2인치의 핵을 만들고, 1/8인치 두께의 원형으로 자릅니다. 반죽의 긴 변 한쪽에 호박 1줄을 배열합니다. 호박 옆에 양파 원형을 일렬로 배열합니다. 양파 옆에 호박 1줄을 더 배열합니다. 야채에 기름을 바르고, 소금과 후추를 뿌립니다. 빵이 부풀어 오르고 가장자리가 짙은 갈색이 될 때까지 약 24분간 굽습니다. 파슬리 1큰술을 뿌립니다.",
        "Image_Name": "cheesy-zucchini-and-red-onion-flatbread-235578.jpg"
    },
    {
        "Title": "마카다미아 스트로이젤을 곁들인 망고 진저브레드",
        "Ingredients": "['잘게 다진 가볍게 소금을 뿌린 건조 로스트 마카다미아 너트 1/3컵', '설탕 1/4컵', '잘게 다진 결정화된 생강 2 1/2큰술', '다용도 밀가루 2컵', '황금빛 갈색 설탕 3/4컵', '생강 가루 1 1/2큰술', '베이킹파우더 2작은술', '베이킹소다 1작은술', '소금 1/4작은술', '익은 망고 1파운드, 껍질을 벗기고 씨 제거', '버터밀크 1/2컵', '카놀라유 1/4컵', '큰 달걀 2개']",
        "Instructions": "모든 재료를 작은 그릇에 넣고 저어서 섞습니다.\n랙을 오븐 중앙에 놓고 350°F로 예열합니다. 9x9x2인치 금속 베이킹 팬에 버터를 바릅니다. 중간 크기의 그릇에 처음 6가지 재료를 넣고 휘저어서 섞습니다. 푸드 프로세서로 망고를 거칠게 퓌레합니다. 망고 퓌레 1컵을 큰 그릇에 옮깁니다(남은 퓌레는 다른 용도로 보관합니다). 버터밀크, 오일, 계란을 넣어 퓌레를 만들고 섞일 때까지 휘저어 섞습니다. 밀가루 혼합물을 넣고 잘 섞일 때까지 저어줍니다. 반죽의 절반(약 2컵)을 준비된 팬에 옮깁니다. 슈트로이젤의 절반을 뿌립니다. 남은 반죽을 숟가락으로 떠서 주걱으로 고르게 펴고 남은 슈트로이젤을 뿌립니다.\n빵을 굽다가 탄력이 생기고 중앙에 꽂은 테스터가 깨끗이 나올 때까지 굽습니다(약 45분). 팬에 넣고 랙에 올려 완전히 식힙니다(8시간 전에 만들어도 됩니다. 덮고 실온에서 보관합니다). 빵을 9조각으로 자르고 서빙합니다.\n버터밀크와 베이킹소다는 진저브레드에 부드러운 질감을 부여하는 데 도움이 됩니다.",
        "Image_Name": "mango-gingerbread-with-macadamia-streusel-233912.jpg"
    },
    {
        "Title": "살구-오렌지 쇼트브레드 바",
        "Ingredients": "['살구 보존료 1컵', '오렌지 리큐어 3큰술(그랑 마르니에 등)', '무염 버터 1컵(2스틱), 실온', '설탕 3/4컵', '아몬드 추출물 1티스푼', '다용도 밀가루 2컵', '소금 1/4티스푼', '아몬드 페이스트 1/4컵(꽉 채운 것), 부순 것', '슬라이스 아몬드 1/2컵, 나누어 담음']",
        "Instructions": "오븐을 325°F로 예열합니다. 9x9x2인치 금속 베이킹 팬에 버터를 바르고, 팬 바닥과 측면에 양피지를 깔고, 측면까지 덮습니다. 양피지에 버터를 바릅니다. 작은 그릇에 보존식품과 오렌지 리큐어를 섞고, 따로 보관합니다.\n전기 믹서를 사용하여 큰 그릇에 버터 1컵과 설탕을 넣고 잘 섞일 때까지 치십시오. 아몬드 추출물을 넣고 치십시오. 밀가루와 소금을 넣고, 섞일 때까지 치십시오. 반죽 1컵을 다른 작은 그릇에 옮기고, 부순 아몬드 페이스트를 넣고 손가락 끝으로 작은 덩어리가 형성될 때까지 섞습니다. 슬라이스 아몬드 1/4컵을 넣고 섞고, 토핑용으로 따로 보관합니다.\n남은 반죽을 준비된 팬 바닥에 고르게 누릅니다. 보존식품 혼합물을 고르게 펴 바릅니다. 손가락 끝을 사용하여 보존식품 위에 토핑을 거칠게 부순 다음, 아몬드 1/4컵을 뿌립니다. 보존식품에 토핑을 가볍게 누릅니다.\n쇼트브레드를 윗면과 껍질 가장자리가 황금빛 갈색이 될 때까지 굽습니다(약 1시간). 팬에서 랙 위에 놓고 완전히 식힙니다. 양피지를 보조도구로 사용하여 쇼트브레드를 팬에서 들어 올립니다. 쇼트브레드를 4등분한 다음 각 스트립을 가로로 잘라 8개의 작은 바 쿠키로 만듭니다. (미리 준비할 수 있습니다. 밀폐 용기에 한 겹으로 보관하면 실온에서 최대 4일, 냉동하면 최대 2주까지 보관할 수 있습니다.)",
        "Image_Name": "apricot-orange-shortbread-bars-233425.jpg"
    },
    {
        "Title": "초콜릿으로 코팅한 쇼트브레드",
        "Ingredients": "['무염 버터 2개(1/2파운드), 실온', '설탕 2/3컵', '바닐라 추출물 2티스푼', '소금 1/2티스푼', '다용도 밀가루 2 1/4컵', '고품질 세미스위트 초콜릿 8온스, 잘게 다진 것']",
        "Instructions": "오븐의 위아래 1/3에 랙을 놓고 325°F로 예열합니다. 큰 쿠키 시트 2개에 양피지를 깔아줍니다.\n전기 믹서기에 버터, 설탕, 바닐라, 소금을 중간 속도로 부드러워질 때까지 치세요. 밀가루를 넣고 저속으로 섞어서 잘 섞습니다. 반죽을 반으로 나누어 두 개의 원반 모양으로 만듭니다.\n가볍게 밀가루를 뿌린 작업대에서 반죽 1개를 1/4인치 두께의 직사각형으로 펴줍니다. 플루트 페이스트리 휠이나 큰 칼을 사용하여 2 x 1인치 직사각형으로 자릅니다. 쿠키를 베이킹 시트에 옮겨 1 1/2인치 간격으로 놓습니다. 나머지 반죽도 반복합니다.\n각 쿠키에 포크로 여러 번 찔러 넣은 다음 10분간 식힙니다. 가장자리가 노릇노릇해질 때까지 약 15분간 굽습니다. 팬에 5분간 식힌 다음 랙에 옮겨 완전히 식힙니다.\n장식: 베이킹 시트에 깨끗한 양피지나 왁스지를 깔아줍니다. 끓는 물이 담긴 냄비 위에 중간 내열성 그릇을 놓고 초콜릿 반쪽을 녹입니다. 남은 초콜릿을 넣고 그릇을 불에서 내리고 가끔 저어서 부드러워질 때까지 저어줍니다. 작은 그릇에 붓습니다.\n각 쿠키를 초콜릿에 반쯤 담그고, 남은 초콜릿을 떨어뜨린 다음 베이킹 시트에 올려놓습니다. 초콜릿이 굳을 때까지 약 1시간 동안 그대로 둡니다. 밀폐 용기에 담아 실온에서 보관합니다. (냉장고에 넣지 마세요.)",
        "Image_Name": "chocolate-dipped-shortbread-233311.jpg"
    },
    {
        "Title": "콘브레드 캐서롤과 버터넛 스쿼시, 버섯, 안초 몰레",
        "Ingredients": "['엑스트라 버진 올리브 오일 3큰술', '다진 양파 2 1/2컵', '각종 야생버섯(굴버섯, 살구버섯, 포르토벨로버섯 등) 1 1/4파운드, 굵게 다진 것', '다진 신선한 세이지 1 1/2큰술', '다진 신선한 타임 4작은술', '큰 마늘 3쪽, 다진 것', '가루 쿠민 2 1/2작은술', '씨를 제거하고 껍질을 벗긴 버터넛 스쿼시 1/2인치 입방체 4컵(약 2 1/2파운드)', '물기를 뺀 헹군 검은콩 2컵(15온스 캔 2개)', '주스에 절인 다진 토마토 2컵(14 1/2온스 캔 2개)', '물 1/2컵', '마사 하리나(옥수수 토르티야 믹스) 4컵', '노란색 옥수수가루 2/3컵', ' 소금 티스푼', '베이킹파우더 3/4티스푼', '물 4 1/4컵(또는 그 이상)', '버터 10큰술(1 1/4스틱) 녹인 것, 나누어 놓음', '큰 계란 2개', '큰 계란 노른자 1개', '굵게 갈은 엑스트라 샤프 화이트 체다 치즈 2컵(꽉 채움)(약 8온스)', '잘게 다진 신선한 이탈리안 파슬리 3큰술', '안초 몰레']",
        "Instructions": "큰 냄비에 중불에서 기름을 데웁니다. 양파를 넣고 노릇노릇해질 때까지 약 10분간 볶습니다. 버섯을 넣고 부드러워질 때까지 약 10분간 볶습니다. 세이지, 타임, 마늘, 커민을 넣고 1분간 저어줍니다. 스쿼시, 콩, 토마토와 주스, 물 1/2컵을 넣고 끓입니다. 불을 중불로 줄이고 뚜껑을 덮고 8분간 끓입니다. 뚜껑을 열고 야채가 부드러워지고 액체의 대부분이 증발하지만 혼합물은 여전히 ​​촉촉할 때까지 약 12분간 끓입니다. 소금과 후추로 속을 듬뿍 간합니다. (1일 전에 만들어도 됩니다. 약간 식힙니다. 뚜껑을 덮고 냉장합니다.)\n오븐을 350°F로 예열합니다. 15x10x2인치 유리 베이킹 접시에 버터를 바릅니다. 큰 그릇에 마사 하리나, 콘밀, 소금, 베이킹파우더를 섞습니다. 다른 큰 그릇에 물 4 1/4컵, 녹인 버터 6큰술, 계란, 달걀 노른자를 넣고 섞습니다. 계란 혼합물을 마사 하리나 혼합물에 섞습니다. 치즈와 파슬리를 넣고 필요에 따라 큰 스푼으로 물을 더 넣어 걸쭉하고 촉촉한 반죽을 만듭니다.\n반죽 4컵을 준비된 베이킹 접시에 옮깁니다. 반죽 위에 큰 플라스틱 랩을 놓습니다. 플라스틱을 사용하여 반죽을 접시 바닥과 측면의 3/4까지 고르게 누르고 플라스틱을 벗깁니다. 접시에 있는 반죽에 충전물을 숟가락으로 넣고 고르게 펴 바릅니다. 남은 반죽을 작은 ​​덩어리로 채워 충전물 위에 얹습니다. 오프셋 주걱을 사용하여 덩어리를 충전물 위에 고르게 펴서 덮습니다. 위아래 반죽을 가장자리에서 눌러 밀봉하여 충전물을 감쌉니다. (1일 전에 만들 수 있습니다. 덮고 냉장합니다.)\n캐서롤 위에 녹인 버터 4큰술을 바릅니다. 반죽이 옅은 황금색이 되고 캐서롤이 데워질 때까지 굽습니다. 약 1시간(또는 냉장하면 약 1시간 15분) 정도 걸립니다. 10분간 식힙니다. 사각형으로 자르고 Ancho Mole과 함께 제공합니다.",
        "Image_Name": "cornbread-casserole-and-butternut-squash-mushrooms-and-ancho-mole-233151.jpg"
    },
    {
        "Title": "초콜릿 코팅 진저브레드 키즈",
        "Ingredients": "['다용도 밀가루 1 3/4컵 + 2큰술', '생강가루 2작은술', '계피가루 3/4작은술', '베이킹파우더 1/2작은술', '베이킹소다 1/4작은술', '육두구가루 1/4작은술', '정향가루 1/4작은술', '황금빛 갈색 설탕 6큰술(꽉 채운 것)', '무염 버터 1/4컵(1/2스틱) 실온', '연한 풍미(라이트) 당밀 3큰술', '큰 달걀 1개', '세미스위트 초콜릿 6온스(다진 것)', '식물성 기름 2작은술', '계피 장식 사탕 또는 다진 결정화된 생강']",
        "Instructions": "오븐 중앙에 랙을 놓고 325°F로 예열합니다. 큰 베이킹 시트 2개에 양피지를 깔아줍니다. 큰 그릇에 처음 7가지 재료를 넣고 섞습니다. 갈색 설탕, 버터, 당밀을 중간 크기의 냄비에 넣고 약한 불로 녹을 때까지 저어줍니다. 불을 중불로 올리고 끊임없이 저어가며 끓입니다. 불에서 내립니다. 10분간 식힙니다. 중간 크기의 그릇에 계란을 넣고 섞습니다. 당밀 혼합물을 계란에 서서히 휘저어줍니다. 전기 믹서를 사용하여 당밀 혼합물을 밀가루 혼합물에 서서히 넣고 섞일 때까지 치세요.\n가볍게 밀가루를 뿌린 표면에 반죽을 펴서 12x10인치 직사각형으로 만듭니다. 쿠키 커터로 진저브레드를 자릅니다. 베이킹 시트에 1인치 간격으로 옮깁니다. 쿠키 조각을 모아 가볍게 밀가루를 뿌린 표면에 펴고 추가로 쿠키를 자릅니다. 반죽을 다 쓸 때까지 반복합니다.\n쿠키를 한 번에 한 장씩 굽고, 부풀어 오르고 윗부분이 단단해질 때까지 약 10분간 굽습니다. 시트에 5분간 식힙니다. 랙에 옮기고 완전히 식힙니다.\n테두리가 있는 베이킹 시트 위에 랙을 놓습니다. 초콜릿과 오일을 거의 끓는 물 위에 올려놓은 더블 보일러 위에 넣고 녹을 때까지 저어줍니다. 쿠키 1개의 바닥을 잡고 윗부분을 초콜릿에 담그고, 남은 것은 떨어뜨립니다. 쿠키를 초콜릿 쪽을 위로 하여 준비된 랙에 옮깁니다. 나머지 쿠키와 초콜릿으로 반복합니다. 쿠키를 사탕이나 생강으로 장식합니다. 초콜릿이 굳을 때까지 쿠키를 식힙니다(약 30분). (쿠키는 3일 전에 만들어도 됩니다. 밀폐 용기에 한 겹으로 담아 냉장고에 보관합니다.) 서빙하기 15분 전에 쿠키를 실온에 두세요.",
        "Image_Name": "chocolate-covered-gingerbread-kids-231309.jpg"
    },
    {
        "Title": "당밀 휘핑 크림이 곁들여진 구식 진저브레드",
        "Ingredients": "['설탕 1컵에 1큰술', '무염 버터 1/2컵(1스틱), 실온', '순한 맛(라이트) 당밀 3/4컵에 2큰술', '큰 계란 2개', '다용도 밀가루 2컵', '베이킹 소다 2작은술', '계피 가루 1 1/4작은술', '생강 가루 3/4작은술', '소금 1/2작은술', '차갑게 식힌 휘핑크림 1 1/2컵(나누어 사용)', '끓는 물 3/4컵']",
        "Instructions": "오븐을 350°F로 예열합니다. 9x9x2인치 금속 베이킹 팬에 버터와 밀가루를 바릅니다. 전기 믹서를 사용하여 큰 그릇에 설탕 1컵과 버터를 넣고 잘 섞일 때까지 치세요. 당밀 3/4컵을 넣고 계란 1개를 넣고 치세요. 밀가루, 베이킹 소다, 계피, 생강, 소금을 체로 걸러 넣고 잘 섞일 때까지 치세요. 크림 1/4컵을 넣고 끓는 물 3/4컵을 넣고 치세요. 반죽을 준비된 팬에 옮깁니다.\n테스터를 중앙에 꽂아 깨끗하게 나올 때까지 약 45분간 케이크를 굽습니다. 팬에 넣은 케이크를 랙에 식힙니다.\n중간 크기의 그릇에 크림 1 1/4컵과 설탕 1큰술을 넣고 봉우리가 형성될 때까지 치세요. 당밀 2큰술을 줄무늬가 나타날 때까지 접어 넣습니다(과도하게 섞지 마세요). 케이크를 조각으로 자르고 접시에 옮깁니다. 당밀 휘핑 크림과 함께 제공합니다.",
        "Image_Name": "old-fashioned-gingerbread-with-molasses-whipped-cream-231121.jpg"
    },
    {
        "Title": "파-할라페뇨 콘브레드",
        "Ingredients": "['다용도 밀가루 3/4컵', '노란 옥수수가루 3/4컵', '설탕 1/4컵', '소금 1 1/2티스푼', '베이킹파우더 1 1/2티스푼', '베이킹소다 1티스푼', '얇게 썬 파 1/2컵', '씨가 든 다진 할라피뇨 칠리 2티스푼', '버터밀크 1 1/4컵', '큰 달걀 2개', '무염 버터 1/4컵(1/2스틱), 녹여서 식힌 것']",
        "Instructions": "오븐을 350°F로 예열합니다. 13x9x2인치 금속 베이킹 팬에 버터를 바릅니다. 큰 그릇에 밀가루, 콘밀, 설탕, 소금, 베이킹파우더, 베이킹소다를 넣고 섞습니다. 파와 할라페뇨를 넣고 저어줍니다. 중간 크기의 그릇에 버터밀크와 계란을 넣고 섞은 다음 녹인 버터를 넣고 저어줍니다. 버터밀크 혼합물을 마른 재료에 넣고 섞일 때까지 저어줍니다(너무 섞지 마세요). 반죽을 준비된 팬에 옮깁니다(반죽은 팬의 측면에서 약 3/4인치 정도만 올라옵니다).\n콘브레드를 위가 살짝 갈색이 되고 중앙에 꽂은 테스터가 깨끗하게 나올 때까지 약 25분간 굽습니다. 팬을 랙에 옮기고 팬에서 콘브레드를 완전히 식힙니다.(콘브레드는 1일 전에 준비할 수 있습니다. 호일로 단단히 덮고 실온에서 보관합니다.)",
        "Image_Name": "green-onion-jalapeno-cornbread-231072.jpg"
    },
    {
        "Title": "진저브레드 눈송이",
        "Ingredients": "['2/3컵 당밀(강하지 않음)', '2/3컵 진한 갈색 설탕', '1큰술 생강가루', '1 1/2작은술 계피가루', '1/2작은술 올스파이스가루', '1/2작은술 정향가루', '2작은술 베이킹 소다', '2스틱(1컵) 무염 버터, 큰술 크기로 자름', '1개의 큰 달걀, 가볍게 푼 것', '3 3/4~4컵 다용도 밀가루', '1/2작은술 소금', '장식용 아이싱', '1개의 금속 오프셋 주걱', '1/8~1/4인치 플레인 팁이 달린 페이스트리 백 1개', '다양한 2~3인치 쿠키 커터(바람직하게는 눈송이 모양); 금속 오프셋 주걱; 1/8~1/4인치 일반 팁이 장착된 페이스트리 백(선택 사항)']",
        "Instructions": "당밀, 황설탕, 향신료를 4~5쿼트 무거운 냄비에 넣고 중불로 끓이며 가끔 저어주고 불에서 내립니다. 베이킹 소다를 넣고 저어줍니다(혼합물이 거품을 낼 것입니다). 그런 다음 버터를 한 번에 3조각씩 넣고 각각 녹인 다음 다음에 넣어 모든 버터가 녹을 때까지 저어줍니다. 계란을 넣고 잘 섞일 때까지 저어준 다음 밀가루 3 3/4컵과 소금을 넣고 저어줍니다.\n오븐을 325°F로 예열합니다.\n반죽을 가볍게 밀가루를 뿌린 표면에 옮겨 반죽하고, 달라붙지 않도록 남은 밀가루 1/4컵을 필요한 만큼 뿌려 부드럽고 다루기 편해질 때까지 30초에서 1분 동안 반죽합니다. 반죽을 반으로 자르고, 반쪽을 비닐 랩으로 싸서 실온에 보관합니다.\n남은 반죽을 가볍게 밀가루를 뿌린 표면에서 14인치(1/8인치 두께)의 원형으로 펴줍니다. 쿠키를 커터로 최대한 많이 잘라내고 오프셋 주걱으로 버터를 바른 큰 베이킹 시트 2개에 조심스럽게 옮겨 약 1인치 간격으로 배열합니다.\n쿠키를 오븐의 위아래 1/3에서 굽고, 굽는 중간에 시트 위치를 바꿔 가장자리가 약간 어두워질 때까지 굽습니다. 총 10~12분(굽는 마지막에 주의해서 보세요. 쿠키는 쉽게 타 버립니다). 쿠키를 랙에 옮겨 완전히 식힙니다. 남은 반죽과 조각으로 쿠키를 더 만듭니다(한 번 다시 말아줍니다).\n아이싱을 페이스트리 백에 넣고(사용하는 경우) 쿠키 위에 짜거나 장식적으로 펼칩니다.",
        "Image_Name": "gingerbread-snowflakes-107445.jpg"
    },
    {
        "Title": "거꾸로 된 배 진저브레드 케이크",
        "Ingredients": "['딱딱한 배 2 1/2개(보스크가 좋음)', '무염 버터 1/2개(1/4컵)', '압축된 밝은 갈색 설탕 3/4컵', '다용도 밀가루 2 1/2컵', '베이킹 소다 1 1/2티스푼', '계피 가루 1티스푼', '생강 가루 1티스푼', '정향 가루 1/2티스푼', '소금 1/4티스푼', '당밀 1컵(가급적 순한 맛)', '끓는 물 1컵', '무염 버터 1개(1/2컵), 부드럽게 한 것', '압축된 밝은 갈색 설탕 1/2컵', '큰 달걀 1개, 가볍게 푼 것', '반주: 바닐라 아이스크림', '양념이 잘 된 10인치 주철 프라이팬 또는 12인치 깊이의 노스틱 프라이팬(오븐에 넣을 수 없는 경우 호일을 두 겹으로 감싼 것)']",
        "Instructions": "배의 껍질을 벗기고 씨를 빼고 각각 8조각으로 자릅니다.\n중불로 프라이팬에 버터를 녹여 거품이 가라앉을 때까지 녹입니다. 불을 약하게 줄인 다음, 프라이팬 바닥에 황설탕을 뿌리고 그대로 3분간 조리합니다(모든 설탕이 녹지는 않습니다). 설탕 위에 배를 장식적으로 놓고 그대로 2분간 조리합니다. 불에서 내립니다.\n오븐을 350°F로 예열합니다.\n그릇에 밀가루, 베이킹 소다, 계피, 생강, 정향, 소금을 넣고 휘젓습니다. 작은 그릇에 당밀과 끓는 물을 넣고 휘젓습니다. 큰 그릇에 버터, 황설탕, 계란을 전기 믹서로 중속으로 약 2분간 크림이 될 때까지 섞은 다음, 밀가루 혼합물과 당밀을 3회에 걸쳐 저속으로 번갈아가며 섞어 부드러워질 때까지 섞습니다.\n프라이팬에 토핑 위에 반죽을 붓고 고르게 펴며 배를 건드리지 않도록 주의하고, 테스터가 깨끗이 나올 때까지 오븐 중앙에서 40~50분간 굽습니다.\n케이크를 랙 위에 놓고 프라이팬에 5분간 식힙니다. 얇은 칼로 프라이팬 가장자리를 따라 돌린 다음, 프라이팬 위에 립이 있는 큰 접시를 뒤집고 냄비 받침을 사용하여 프라이팬과 접시를 단단히 고정한 다음 케이크를 접시에 뒤집습니다. 프라이팬에 붙은 배는 다시 넣습니다. 따뜻하게 또는 실온에서 제공합니다.",
        "Image_Name": "upside-down-pear-gingerbread-cake-106181.jpg"
    }
]
